[
  {
    "1": [
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Internship_Finance",
        "job_title": "Finance Intern",
        "job_link": "https://www.shine.com/job-search/finance-intern/internship_finance/16396070",
        "job_location": [
          "Rudrapur",
          "Other Uttarakhand"
        ],
        "posted_on": "2024-12-28T05:53:19",
        "required_experiance": "0 to 4 Yrs",
        "required_skills": "Analytical Skills, Financial Statements, Accounting, Communication skills,Finance knowledge, Financial software, Detailoriented, Organized",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Company Description\n\nWe suggest you enter details here.\n\nRole Description\n\nThis is a full-time on-site role for a Finance Intern at Internship_Finance located in Rudrapur. The Finance Intern will be involved in tasks related to finance, financial statements, accounting, and communication on a day-to-day basis.\n\nQualifications\n Analytical Skills and Finance knowledge\n Proficiency in Financial Statements and Accounting\n Strong Communication skills\n Ability to work with numbers and data\n Detail-oriented and organized\n Knowledge of financial software and tools\n Pursuing or completed a degree in Finance, Accounting, or related field,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Internship Studio",
        "job_title": "Support Intern",
        "job_link": "https://www.shine.com/job-search/support-intern/internship-studio/16332748",
        "job_location": [
          "Other Maharashtra",
          "Pune"
        ],
        "posted_on": "2024-12-22T02:10:53",
        "required_experiance": "0 to 4 Yrs",
        "required_skills": "Excellent communication skills, Customercentric approach, Verbal , written communication skills, Ability to convey technical information clearly, Customerfocused mindset, Multitasking, Prioritization, Proficiency in using computer applications",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "1",
        "max_salary": "50000",
        "job_description": "Role Description\n\nThis is a full-time on-site role for a\n\nSupportIntern at InternshipStudio located in Pune. We are seeking a motivated Support Intern to join our team and assist in providing outstanding customer support. The ideal candidate will have excellent communication skills, a strong customer-centric approach, and a willingness to learn and grow in a fast-paced environment.\n\nKey Responsibilities:\n Handle incoming customer calls and emails professionally and courteously.\n Provide timely and effective support to customers by troubleshooting issues and resolving inquiries promptly.\n Create and manage support tickets using our internal ticketing system, ensuring accurate documentation of customer interactions and resolutions.\n\nCollaborate with other team members to escalate complex issues and ensure timely resolution.\n Communicate effectively with customers to provide status updates, gather additional information, and ensure a positive support experience.\n\nQualifications:\n Currently pursuing or recently completed a degree in any field or equivalent practical experience.\n Excellent verbal and written communication skills, with the ability to convey technical information clearly and concisely.\n Customer-focused mindset with a passion for delivering exceptional service.\n Ability to multitask and prioritize tasks effectively in a fast-paced environment.\n Proficiency in using computer applications and familiarity with customer support software is a plus.\n Willingness to learn and adapt to new technologies and processes.\n\nExperience - Freshers\n\nLocation - Baner (Work From Office)\n\nStipend - 3000 to 5000 per month\n\nNotice Period- Immediate Joiner,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Coderwing Hiring For MERN Stack Intern (Fresher)",
        "job_title": "MERN Stack Intern (Fresher)",
        "job_link": "https://www.shine.com/job-search/mern-stack-intern-fresher/coderwing/16288926",
        "job_location": [
          "Indore"
        ],
        "posted_on": "2024-12-17T12:58:03",
        "required_experiance": "0 Yrs",
        "required_skills": "node.js, react.js, express.js, mongodb,",
        "job_area": [
          "General / Other Software",
          "IT Operations / EDP / MIS"
        ],
        "min_salary": "100000",
        "max_salary": "150000",
        "job_description": "[heading] Job description Job description [bold] Company: Company: CoderWing \n [bold] Location: Location: Indore, Madhya Pradesh \n [bold] Start Date: Start Date: Immediate At [bold] CoderWing CoderWing , we're a growing tech company with a focus on innovative software solutions. We are looking for a passionate and dedicated [bold] MERN Stack Intern MERN Stack Intern to join our dynamic team. If you're eager to learn, grow, and get hands-on experience with cutting-edge technologies, this is the perfect opportunity for you! [bold] What You'll Do: What You'll Do: Assist in the development of web applications using the MERN stack (MongoDB, Express.js, React, Node.js). Collaborate with senior developers to implement new features and functionality. Write clean, scalable, and efficient code. Debug and troubleshoot application issues. Participate in code reviews and learn best practices. Contribute to the improvement of our web applications. [bold] What We're Looking For: What We're Looking For: Basic understanding of web development concepts. Familiarity with the MERN stack (MongoDB, Express.js, React.js, Node.js). Knowledge of JavaScript, HTML, and CSS. Passion for coding and eagerness to learn. Good problem-solving skills. Strong communication skills and the ability to work collaboratively in a team. [bold] Preferred Qualifications: Preferred Qualifications: Previous experience or personal projects using the MERN stack. Understanding of version control systems (Git). Knowledge of RESTful APIs and backend development. [bold] Why CoderWing Why CoderWing Gain hands-on experience with the MERN stack and modern web technologies. Work in a collaborative and growth-oriented environment. Mentorship from experienced developers. Flexible working hours and a supportive work culture. [bold] How to Apply: How to Apply: Send your resume to [bold] inquiry.coderwing@gmail.com inquiry.coderwing@gmail.com or drop your CV at [bold] 9926640515 9926640515 via WhatsApp. Job Type: Internship Contract length: 3 months Schedule: Day shif Work Location: In person"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Human resources and marketing internship",
        "job_title": "Human resources and marketing internship",
        "job_link": "https://www.shine.com/job-search/human-resources-and-marketing-internship/human-resources-and-marketing-internship/16271306",
        "job_location": [
          "All India"
        ],
        "posted_on": "2024-12-14T05:25:59",
        "required_experiance": "0 to 4 Yrs",
        "required_skills": "HR,Sales  Marketing",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "*Internship Opportunity at Lernx*\n\nLernx, a leading digital learning platform, is offering a 2-month remote internship program for students interested in Sales & Marketing and HR roles.\n About Lernx:*\nLernx provides affordable online courses, industrial training programs, certification programs, one-to-one mentorships, and placement preparations, empowering learners to achieve their goals.\n Eligibility Criteria:*\n- Undergraduates, Graduates, and Freshers are eligible to apply\n Internship Details:*\n- Duration: 2 months (remote)\n- Areas of focus: HR and Sales & Marketing.\n Benefits:*\n- Upon completion, interns will receive:\n- Various Certificates\n- Performance-based Stipend\n- Letter of Recommendation\n- Potential for Pre-Placement Offer (PPO) based on outstanding performance\n\nThis internship offers a valuable opportunity to gain hands-on experience and build a strong foundation in your chosen field.\nApply now to kickstart your career!,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Coderwing Hiring For Frontend Development Intern",
        "job_title": "Frontend Development Intern",
        "job_link": "https://www.shine.com/job-search/frontend-development-intern/coderwing/16135825",
        "job_location": [
          "Indore"
        ],
        "posted_on": "2024-11-12T18:07:45",
        "required_experiance": "0 Yrs",
        "required_skills": "javascript, react.js,react.js development intern, react.js internship, react developer intern, javascript/react intern, intern, frontend development intern",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "50000",
        "max_salary": "100000",
        "job_description": "[bold] Job Summary Job Summary As a Frontend React.js Developer, you will be in charge of developing compelling user interfaces and interactive online applications with React.js. You'll collaborate with designers and backend engineers to create responsive designs, integrate APIs, and improve application performance. [bold] Key Responsibilities Key Responsibilities Convert UI/UX designs to high-quality code using React.js and other frontend technologies. Create reusable React components and frameworks to expedite development and ensure consistency across the application. Use Redux, Context API, or other state management tools to effectively manage application state and data flow. Integrate with backend APIs and services to access and manipulate data. Optimize frontend performance by identifying bottlenecks in rendering, network queries, and overall application performance. Write clean, maintainable code that adheres to best practices and coding standards. Conduct unit and integration testing to verify code quality and dependability. [bold] Experience and Qualifications Experience and Qualifications Bachelors degree in Computer Science, Engineering, or a related discipline. \n Experienced Frontend Developer specializing on React.js development. \n Proficient in JavaScript, HTML5, CSS3, and other frontend technologies. \n Extensive knowledge of React.js and its fundamental principles, including virtual DOM, JSX, and component-based architecture. \n Experience with state management libraries/frameworks, such as Redux or Context API. \n Experience using frontend build technologies like Webpack, Babel, and npm/yarn. \n Expertise in responsive design and CSS preprocessors such as Sass or LESS. \n Experience with RESTful APIs and AJAX. . \n \n [bold] Job Type: Full-time Job Type: Full-time"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Beep - Internship & Job Alerts",
        "job_title": "UI/UX Design Internship in Mumbai, Bangalore, Pune",
        "job_link": "https://www.shine.com/job-search/ui-ux-design-internship-in-mumbai-bangalore-pune/beep-internship-job-alerts/16316192",
        "job_location": [
          "Other Maharashtra",
          "Pune"
        ],
        "posted_on": "2024-12-20T07:21:02",
        "required_experiance": "0 to 4 Yrs",
        "required_skills": "User research, Wireframes, Usability testing,UI designs, Prototypes, Figma, Interactive prototypes, Analyzing user feedback, UIUX design, Design trends",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Selected Intern's Day-to-day Responsibilities Include\n Collaborate with the design team to create intuitive and visually appealing user interface designs for our digital products\n Assist in conducting user research and gathering feedback to inform design decisions and improve the user experience\n Translate wireframes and prototypes into polished UI designs using Figma, ensuring consistency and adherence to brand guidelines\n Create interactive prototypes to demonstrate the flow and functionality of the design concepts\n Support in building and maintaining UI components and style guides to facilitate efficient design workflows\n Assist in conducting usability testing and analyzing user feedback to identify areas of improvement and propose design enhancements\n Stay updated with the latest UI/UX design trends and best practices, and actively contribute innovative ideas to enhance our products\" user experience\n\nJoin our dynamic team and gain valuable industry experience while making a significant impact on the design of our cutting-edge digital products. Apply now and unleash your creativity in an exciting and collaborative environment at MentorBoxx!\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Nurturing Interns Private Limited",
        "job_title": "Relationship Manager",
        "job_link": "https://www.shine.com/job-search/relationship-manager/nurturing-interns-private-limited/16359219",
        "job_location": [
          "Other Madhya Pradesh",
          "Ratlam"
        ],
        "posted_on": "2024-12-23T12:34:37",
        "required_experiance": "2 to 6 Yrs",
        "required_skills": "Client Relationship Management, Business Development, Product Promotion, Customer Service, Market Analysis, Documentation, Compliance, Reporting,Sales Targets, CrossSelling",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Client Relationship Management: Develop and maintain strong relationships with existing and potential clients in the assigned territory or market segment.  Business Development: Identify new business opportunities and proactively market financial products (loans and related services) to potential customers.  Product Promotion: Effectively communicate and promote various financial products offered by the organization to prospective clients.  Sales Targets: Achieve sales targets by effectively managing leads, conversions, and client retention strategies.  Customer Service: Provide excellent customer service to clients, addressing their queries and resolving any issues promptly and professionally.  Market Analysis: Stay updated with market trends, competitor activities, and changes in regulations to identify opportunities and potential risks.  Cross-Selling: Identify cross-selling opportunities and recommend appropriate financial products to clients to meet their needs.  Documentation: Ensure accurate and timely documentation of all client interactions, transactions, and sales related activities.  Compliance: Adhere to the company's policies, procedures, and regulatory guidelines to maintain compliance at all times.  Reporting: Provide regular reports on sales activities, market insights, and customer feedback to the management team.\n\nJob Type: Full-time\n\nBenefits:\n Health insurance\n Paid sick time\n Provident Fund\n\nSchedule:\n Day shift\n Weekend availability\n\nEducation:\n Bachelor's (Preferred)\n\nExperience:\n total work: 2 years (Preferred)\n Sales: 2 years (Preferred)\n Financial services: 2 years (Preferred)\n\nLanguage:\n English (Preferred)\n\nWork Location: In person,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Applying internship",
        "job_title": "Multidisciplinary designer",
        "job_link": "https://www.shine.com/job-search/multidisciplinary-designer/applying-internship/16314501",
        "job_location": [
          "Chandigarh"
        ],
        "posted_on": "2024-12-20T05:29:02",
        "required_experiance": "0 to 4 Yrs",
        "required_skills": "Adobe Creative Cloud, Communication Skills,Design Elements, Design Principles, Design Techniques, Collaboration Skills, User Experience UX Design",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Company Description\n\nwe suggest you enter details here\n\nRole Description\n\nThis is a full-time hybrid role for a Multidisciplinary Designer at Applying Internship in Chandigarh, with flexibility for remote work. The Multidisciplinary Designer will be responsible for collaborating with cross-functional teams to create innovative design solutions, develop visual concepts, and produce high-quality design work across various mediums.\n\nQualifications\n Proficiency in design software such as Adobe Creative cloud\n Strong understanding of design elements, Principles and techniques.\n Excellent communication and collaboration skills\n Ability to work on multiple projects simultaneously\n Experience in user experience (UX) design is a plus\n Bachelor's degree in Design Field.,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Beep - Internship & Job Alerts",
        "job_title": "Event Management Specialist in Mumbai, Pune",
        "job_link": "https://www.shine.com/job-search/event-management-specialist-in-mumbai-pune/beep-internship-job-alerts/16303226",
        "job_location": [
          "Other Maharashtra",
          "Pune"
        ],
        "posted_on": "2024-12-19T06:46:25",
        "required_experiance": "2 to 6 Yrs",
        "required_skills": "Budget Management, Event Management, Vendor Management, Relationship Management, Marketing, Collateral Management, Reporting,Profit , Loss Analysis",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Key Responsibilities\n Coordinate and work on budget management for the event\n Manage the event execution team\n Manage key relationships with third-party vendors and contractors from Pune, Maharashtra\n Coordinate event communications including branding, online and offline marketing\n Handle event collaterals, event evaluation and reporting, and profit and loss analysis\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Beep - Internship & Job Alerts",
        "job_title": "Junior Teacher in Gujarat",
        "job_link": "https://www.shine.com/job-search/junior-teacher-in-gujarat/beep-internship-job-alerts/16279108",
        "job_location": [
          "All India"
        ],
        "posted_on": "2024-12-15T00:43:19",
        "required_experiance": "2 to 6 Yrs",
        "required_skills": "Curriculum implementation, Teacher development, Student assessment, Parental involvement, Classroom environment, Administrative responsibilities",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "To lead the planning and execution of the Cambridge Early Years curriculum, supporting and guiding pre-primary teachers to create a nurturing, developmentally appropriate learning environment that fosters the physical, emotional, cognitive, and social development of young children.\n\nKey Responsibilities\n Curriculum implementation:\n\nEnsure the effective delivery of the Cambridge Early Years curriculum across all pre-primary classrooms.\n\nCollaborate with teachers to plan and implement lessons that align with the Cambridge Early Years framework, emphasizing holistic child development.\n\nRegularly review and update curriculum materials and teaching resources to ensure they meet Cambridge standards.\n Teacher development and support:\n\nProvide coaching, mentoring, and professional development opportunities for pre-primary teachers to ensure they are well-prepared to deliver the Cambridge curriculum.\n\nConduct regular classroom observations to provide constructive feedback and support to teachers.\n Student assessment and development:\n\nGuide teachers in assessing young children's progress using developmentally appropriate tools and Cambridge Early Years assessment methods.\n\nEnsure that assessments reflect a child's development in key areas, including communication, physical development, personal-social development, and early literacy and numeracy.\n Parental involvement:\n\nOrganize and lead parent-teacher meetings to discuss the progress and development of pre-primary students.\n\nProvide parents with regular updates on their childs development and ways they can support learning at home.\n\nAddress any parental concerns related to the pre-primary program and Cambridge curriculum implementation.\n Classroom environment:\n\nEnsure that classrooms are set up in a manner that fosters exploration, creativity, and learning in a safe and nurturing environment.\n\nAssist teachers in creating developmentally appropriate activities and experiences that support all areas of a childs development.\n\nEnsure compliance with health and safety standards in all pre-primary classrooms.\n Administrative responsibilities:\n\nMaintain records of student progress, attendance, and teacher performance.\n\nDevelop and oversee the implementation of policies related to early childhood education.\n\nCoordinate with school administration on scheduling, resource allocation, and reporting requirements.\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Beep - Internship & Job Alerts",
        "job_title": "Senior Teacher in Gujarat",
        "job_link": "https://www.shine.com/job-search/senior-teacher-in-gujarat/beep-internship-job-alerts/16290435",
        "job_location": [
          "All India"
        ],
        "posted_on": "2024-12-17T22:57:12",
        "required_experiance": "3 to 7 Yrs",
        "required_skills": "Curriculum management, Teacher support, Student assessment, Parental engagement, Administrative duties",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Job Purpose\n\nTo oversee the implementation of the Cambridge International curriculum, ensuring high academic standards, supporting teachers with lesson planning, and maintaining an effective and well-organized learning environment.\n\nKey Responsibilities\n Curriculum management:\n Ensure that the Cambridge curriculum is delivered effectively across all grades.\n Collaborate with teachers to develop lesson plans that align with Cambridge standards and objectives.\n Review and update curriculum materials as required, ensuring they meet Cambridge guidelines.\n Teacher support:\n Assist in the recruitment and onboarding of qualified Cambridge teachers.\n Provide ongoing support, coaching, and training to teaching staff.\n Monitor and evaluate teacher performance, providing feedback for continuous improvement.\n Student assessment:\n Oversee the implementation of Cambridge assessments and examinations.\n Analyze student performance data to identify areas for improvement.\n Collaborate with teachers to create intervention plans for students who need additional support.\n Parental engagement:\n Organize parent-teacher meetings to discuss student progress.\n Act as a liaison between parents and the school administration on academic matters.\n Address parental concerns regarding the Cambridge curriculum and student performance.\n Administrative duties:\n Maintain accurate academic records, including grades, attendance, and student progress reports.\n Coordinate and participate in Cambridge training sessions, workshops, and seminars.\n Assist in the development of school policies related to academics and student conduct.\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Beep - Internship & Job Alerts",
        "job_title": "Customer Service/Customer Support Internship in Pune",
        "job_link": "https://www.shine.com/job-search/customer-service-customer-support-internship-in-pune/beep-internship-job-alerts/16254819",
        "job_location": [
          "Other Maharashtra",
          "Pune"
        ],
        "posted_on": "2024-12-13T00:21:31",
        "required_experiance": "0 to 4 Yrs",
        "required_skills": "Data Management, Customer interaction, Analytical skills,Customer Onboarding, Feedback Collection, CRM database management, Educational content creation",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Responsibilities\n Customer Onboarding: Assist the Customer Success managers in the onboarding process for new clients ,ensuring they are fully integrated and comfortable using our services. Prepare onboarding materials and help conduct introductory sessions for new users.\n Create assessments, sending invites, answering queries on emails.\n Data Management: Update and maintain customer records in the CRM database to ensure all customer interactions and details are logged accurately. Analyze customer usage data to identify patterns and insights that can be used to improve our services.\n Feedback Collection: Assist in the development and implementation of feedback mechanisms to gather meaningful insights from customers. Compile and report feedback to the Customer Success team to help refine strategies and improve customer experiences.\n Contribute to the creation of educational content and resources that help customers maximize the value of our services. Educational Requirements\n Currently enrolled in or a recent graduate of a bachelors degree program in Business Administration, Communications, Marketing, or a related field. About Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Beep - Internship & Job Alerts",
        "job_title": "Business Development Associate in Pune, Surat, Bhopal, Lucknow",
        "job_link": "https://www.shine.com/job-search/business-development-associate-in-pune-surat-bhopal-lucknow/beep-internship-job-alerts/16255085",
        "job_location": [
          "Other Maharashtra",
          "Pune"
        ],
        "posted_on": "2024-12-13T00:33:55",
        "required_experiance": "2 to 6 Yrs",
        "required_skills": "Direct sales, Negotiation, Client management,Building relationships, Ecommerce services",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Key Responsibilities\n Engaging in direct sales activities for e-commerce services\n Building and maintaining relationships with potential clients\n Demonstrating the value and benefits of eCommerce services\n Negotiating contracts and closing sales deals\n Assisting new sellers in launching their shop on an eCommerce platform\n Helping sellers set up their seller accounts and profiles\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Beep - Internship & Job Alerts",
        "job_title": "Data Entry Internship in Pune",
        "job_link": "https://www.shine.com/job-search/data-entry-internship-in-pune/beep-internship-job-alerts/16273484",
        "job_location": [
          "Other Maharashtra",
          "Pune"
        ],
        "posted_on": "2024-12-14T07:05:15",
        "required_experiance": "0 to 4 Yrs",
        "required_skills": "Database Management, Data Entry, Data Processing,Attention to Detail",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Maintain the database by entering new and updated candidate information\n Prepare source data for computer entry by compiling and sorting information\n Establish entry priorities\n Process documents by reviewing data for deficiencies\n Resolve deficiencies by using standard procedures or returning incomplete documents to the team leader for resolution\n Maintain data entry requirements by following data program techniques and procedures\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Beep - Internship & Job Alerts",
        "job_title": "Voice Process Associate in Delhi",
        "job_link": "https://www.shine.com/job-search/voice-process-associate-in-delhi/beep-internship-job-alerts/16277366",
        "job_location": [
          "Delhi"
        ],
        "posted_on": "2024-12-14T23:25:28",
        "required_experiance": "1 to 5 Yrs",
        "required_skills": "Lead generation, Sales, Voice process,Performance goals",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Key Responsibilities\n Outbound and inbound calls for lead generation and sales\n Handle voice process tasks efficiently\n Maintain a professional and positive attitude\n Meet performance goals in a dynamic environment\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Coderwing Hiring For Recruitment and Engagement Intern",
        "job_title": "Recruitment and Engagement Intern",
        "job_link": "https://www.shine.com/job-search/recruitment-and-engagement-intern/coderwing/16130818",
        "job_location": [
          "Indore"
        ],
        "posted_on": "2024-11-12T08:06:11",
        "required_experiance": "0 Yrs",
        "required_skills": "talent acquisition, hr generalist activities,recruitment process, candidate sourcing",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "100000",
        "max_salary": "300000",
        "job_description": "[heading] Job description Job description [bold] Job Summary Job Summary The person should be responsible for maintaining basic HR functions in the company, and also extending support to other departments. [bold] Responsibilities and Duties Responsibilities and Duties Screening of candidates, recruitment, and selection of candidates Timely facilitation of hiring & selections as per open positions Documentation/Completion of joining formalities Counselling of new joiners and mentoring them Office operations, admin and record-keeping Attendance management, performance appraisal Department coordination, and handling reporting management [bold] Required Experience and Qualifications Required Experience and Qualifications Qualification Graduation/Post Graduation Go-getter approach Good English communication Leadership skills, and can performance with multi-streaming efforts"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Nurturing Interns Private Limited",
        "job_title": "TMS Manager (POS Operations)",
        "job_link": "https://www.shine.com/job-search/tms-manager-pos-operations/nurturing-interns-private-limited/16240435",
        "job_location": [
          "Chennai",
          "Other Tamil Nadu"
        ],
        "posted_on": "2024-12-09T00:03:52",
        "required_experiance": "8 to 12 Yrs",
        "required_skills": "SIM,POS business process  terminal functionality knowledge, POS terminal configuration APN,  IPport,  key injection, UATProduction testing coordination, Troubleshooting  problemsolving for POS terminals, Team  stakeholder management, TMS Terminal Management System expertise, Compliance  audit adherence, Technical expertise in POS terminal functionalities , software",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "-POS business process & terminal functionality knowledge\n\n-POS terminal configuration (APN, IP/port, SIM, key injection)\n\n-UAT/Production testing coordination\n\n-Troubleshooting & problem-solving for POS terminals\n\n-Team & stakeholder management\n\n-TMS (Terminal Management System) expertise\n\n-Compliance & audit adherence\n\n-Technical expertise in POS terminal functionalities and software\n\n-8-12 years, with at least 5 years in POS services.\n\n-Target Companies: Any organization with a PoS business focus like- Square, Toast, -Lightspeed, Clover etc.\n\nJob Type: Full-time\n\nEducation:\n Bachelor's (Preferred)\n\nExperience:\n Operations: 8 years (Preferred)\n total work: 8 years (Preferred)\n\nWork Location: In person,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Beep - Internship & Job Alerts",
        "job_title": "Graphic Designer in Pune",
        "job_link": "https://www.shine.com/job-search/graphic-designer-in-pune/beep-internship-job-alerts/16226449",
        "job_location": [
          "Other Maharashtra",
          "Pune"
        ],
        "posted_on": "2024-12-05T23:22:28",
        "required_experiance": "2 to 6 Yrs",
        "required_skills": "Digital media, Graphics, Web design, Social media, Analytical skills,Brand assets, Creative tasks, Marketing activities, Email campaigns",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Key Responsibilities\n Think, act, and design for digital media\n Develop and strengthen brand assets, including style and brand guidelines\n Deliver high-quality & on-brand graphics (still & motion) to support superior digital & performance marketing\n Perform mid-to-high complexity creative tasks independently that are cohesive, simple, intuitive, and customer-centric\n Produce creative assets, including graphics, templates, layouts, and visual standards for marketing activities across multiple channels (these include web, social media, events, email campaigns, and other activities)\n Refine other peoples ideas and come up with new ones to create high-quality creative outcomes\n Analyze, report, and improve your designs iteratively with each initiative\n\nSkills & Requirements\n Should have previous work samples\n Someone who lives breathes and expresses oneself through design in its many manifestations in and across a digital-first ecosystem\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Beep - Internship & Job Alerts",
        "job_title": "Business Development Associate in Lucknow, Pune, Surat, Bhopal",
        "job_link": "https://www.shine.com/job-search/business-development-associate-in-lucknow-pune-surat-bhopal/beep-internship-job-alerts/16174366",
        "job_location": [
          "Other Maharashtra",
          "Pune"
        ],
        "posted_on": "2024-11-21T01:59:13",
        "required_experiance": "2 to 6 Yrs",
        "required_skills": "Direct sales, Negotiation, Client management,Building relationships, Ecommerce services",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Key Responsibilities\n Engaging in direct sales activities for e-commerce services\n Building and maintaining relationships with potential clients\n Demonstrating the value and benefits of eCommerce services\n Negotiating contracts and closing sales deals\n Assisting new sellers in launching their shop on an eCommerce platform\n Helping sellers set up their seller accounts and profiles\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Ex-Intern@Hawlett Packard Enterprise",
        "job_title": "Web Developer",
        "job_link": "https://www.shine.com/job-search/web-developer/ex-internhawlett-packard-enterprise/16106925",
        "job_location": [
          "Other Madhya Pradesh",
          "Khargone"
        ],
        "posted_on": "2024-11-05T23:29:01",
        "required_experiance": "2 to 6 Yrs",
        "required_skills": "HTML, CSS, JavaScript, graphic design, Adobe Photoshop, web analytics,responsive design, SEO principles, Sketch, problemsolving",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "\"\nCompany Description\n\nwe suggest you enter details here\n\nRole Description\n\nThis is a full-time on-site role for a Web Developer at Ex-Intern@Hawlett Packard Enterprise located in Khargone. The Web Developer will be responsible for designing, coding, and modifying websites, from layout to function according to a client's specifications. They will strive to create visually appealing sites that feature user-friendly design and clear navigation.\n\nQualifications\n Proficiency in HTML, CSS, JavaScript, and other web development languages\n Experience with responsive design and understanding of SEO principles\n Knowledge of graphic design applications, such as Adobe Photoshop or Sketch\n Ability to work independently and collaborate effectively in a team setting\n Strong problem-solving skills and attention to detail\n Bachelor's degree in Computer Science or related field\n Experience with website management tools and web analytics\n\","
      }
    ]
  },
  {
    "2": [
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Beep - Internship & Job Alerts",
        "job_title": "Mobile App Development Internship in Pune, Mumbai",
        "job_link": "https://www.shine.com/job-search/mobile-app-development-internship-in-pune-mumbai/beep-internship-job-alerts/16130219",
        "job_location": [
          "Other Maharashtra",
          "Pune"
        ],
        "posted_on": "2024-11-10T04:15:53",
        "required_experiance": "0 to 4 Yrs",
        "required_skills": "Android, Firebase,Flutter, React Native",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Selected Intern's Day-to-day Responsibilities Include\n Work closely with our experienced app developers to design and implement cutting-edge mobile applications using Flutter, Android, React Native, and other technologies\n Collaborate with the team to ensure seamless integration of Firebase and other back-end services for enhanced functionality and user experience\n Participate in code reviews and debugging sessions to identify and resolve any issues or bugs that may arise during the development process\n Assist in the creation and maintenance of technical documentation for future reference and knowledge sharing within the team\n Stay up to date with the latest industry trends and advancements in mobile app development to contribute innovative ideas and solutions\n Conduct thorough testing and quality assurance checks to ensure the final product meets the highest standards of performance, reliability, and user satisfaction\n Participate in team meetings and discussions, providing valuable input and suggestions to improve overall app development processes and strategies\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Beep - Internship & Job Alerts",
        "job_title": "Data Annotation Internship in Pune",
        "job_link": "https://www.shine.com/job-search/data-annotation-internship-in-pune/beep-internship-job-alerts/16147225",
        "job_location": [
          "Other Maharashtra",
          "Pune"
        ],
        "posted_on": "2024-11-15T02:23:08",
        "required_experiance": "0 to 4 Yrs",
        "required_skills": "Computer Vision, Machine Learning, Tracking, Tagging, Collaboration, Content Writing,Data Annotation, Labeling, Generating Prompts, AIML, Annotating Data, 2D3D Bounding Boxes, Image Labeling, Video Labeling, Fastpaced Environment",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "The role entitles tracking, annotation, labeling, and generating prompts & contents for datasets for training the machine learning algorithms. The Data Annotation Specialist has the responsibility to create & curate sets of data specifically created for computer vision & future technologies by using a combination of tracking, annotation, labeling, and generating prompts & content on images, videos, or audio. As a member of the Data Annotation team, you will help us Annotate data for use within a larger machine learning & AI/ML framework. You will be part of a great international team of scientists & professionals who bring cutting-edge technology in verticals like Autonomous Driving to the auto industry as well as working for industries like Retail, Medi-tech, Agri-tech, Gen AI, etc. that will all benefit from machine learning & ai in the near future. joining our team means playing an integral role in bettering the world with science & technology.\n\nSelected Intern's Day-to-day Responsibilities Include\n Accurately label and annotate data in all formats before it reaches the end customer.\n Annotate and label 2D/3D bounding boxes for various industries.\n Tag and track while working on sports annotation.\n Collaborate with teammates, label images, and provide feedback to clients\" engineers and data scientists to improve tools and algorithms.\n Write content while viewing images and videos to train the next level of ChatGPT.\n Work in a fast-paced environment that requires high accuracy, attention, and detail.\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Beep - Internship & Job Alerts",
        "job_title": "Finance Executive in Pune",
        "job_link": "https://www.shine.com/job-search/finance-executive-in-pune/beep-internship-job-alerts/16162633",
        "job_location": [
          "Other Maharashtra",
          "Pune"
        ],
        "posted_on": "2024-11-18T01:16:39",
        "required_experiance": "2 to 6 Yrs",
        "required_skills": "Finance, Auditing, GST, Financial planning, Budgeting, Billing, Investor relations, Team management,Accounts balance sheets, Compliances, Certifications, Tax filing, Bank reconciliations, Legal mediation",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Key Responsibilities\n Manage daily finances, auditing, and preparation of accounts balance sheets\n Manage compliances, certifications, & filing of taxes, GST\n Work on preparation of company's financial roadmap, tracking the expenses & allotting budgets\n Work on timely and accurate billing to clients\n Handle bank reconciliations\n Work & mediate between investors, accountants, shareholders, team members & lawyers\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "SIMPLYFYD SOLUTIONS",
        "job_title": "HR Interns",
        "job_link": "https://www.shine.com/job-search/hr-interns/simplyfyd-solutions/16287751",
        "job_location": [
          "Pune"
        ],
        "posted_on": "2024-12-16T13:48:20",
        "required_experiance": "0 Yrs",
        "required_skills": "hr,human resource, intern",
        "job_area": [
          "HR"
        ],
        "min_salary": "50000",
        "max_salary": "100000",
        "job_description": "[bold] Profile Profile :: HR Intern [bold] Location Location :: Hinjewadi, Pune [bold] Stipend Stipend :: No Stipend (IT Industry Certification Only) Looking for Immediate joiners. [bold] Time Time :: 9.00 AM -6.00 PM Interested candidates can share CV on Shilpa@simplyfydsolutions.com"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "AOSTA Overseas Careers",
        "job_title": "Interns (4 nos)",
        "job_link": "https://www.shine.com/job-search/interns-4-nos/aosta-overseas-careers/16400342",
        "job_location": [
          "Chennai",
          "Other Tamil Nadu"
        ],
        "posted_on": "2024-12-29T23:16:42",
        "required_experiance": "0 to 4 Yrs",
        "required_skills": "Good communication skills, Fluency in English , Hindi, Calling potential candidates, Counseling for Higher Education Overseas, Enrolling candidates in the right University, Handling documentation tasks, Intern experience in back office operations",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Min Qualification: Diploma / Graduation (Any stream)\n\nWe are looking for Interns to be part of our Operations including calling potential candidates, Counseling them for Higher Education Overseas, Enroll them for the right University, and handle documentation tasks. On the job training would be provided;\n\nInternship Duration: 3-6 months, upon successful reviews & consistent performance, the chances are that he/she will be part of our team as a regular staff.\n Candidate must have good communications skills. Fluency in English and Hindi, a big plus.\n Candidate must not have any hesitation calling candidates/clients over phone and convert them into Walk-ins.\n Any prior Intern experience in back office operations, would help.\n\nForward your job application to admin@aostacareers.com,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "ICELAND FROZEN FOODS",
        "job_title": "Engineering Intern",
        "job_link": "https://www.shine.com/job-search/engineering-intern/iceland-frozen-foods/16185886",
        "job_location": [
          "Mumbai City",
          "Bangalore",
          "Chennai",
          "Hyderabad",
          "Kolkata"
        ],
        "posted_on": "2024-11-25T11:36:04",
        "required_experiance": "15 to >25 Yrs",
        "required_skills": "engineering consultancy, engineering project management, engineering projects, engineering, engineering design services, engineering drawing, project engineering, engineering management,intern",
        "job_area": [
          "Oil & Gas Engineering",
          "Engineering Design / Construction"
        ],
        "min_salary": "3000000",
        "max_salary": "4200000",
        "job_description": "Engineering Interns learn how to do their job by completing tasks as assigned by supervisors. Typical functions highlighted on an Engineering Intern example resume are reviewing engineering plans, writing reports, researching engineering solutions, implementing company procedures, performing tests to determine construction quality, and offering assistance to non-technical staff. Those looking to work as Engineering Interns should showcase in their resumes technical skills, a willingness to learn, the ability to follow instructions, teamwork, flexibility, and computer competences. Most Engineering Interns are enrolled students pursuing a degree in an engineering field."
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "BAJAJ CAPITAL INSURANCE BROKING LTD",
        "job_title": "Urgent | Senior Sales Intern",
        "job_link": "https://www.shine.com/job-search/urgent-senior-sales-intern/bajaj-capital-insurance-broking-ltd/16304915",
        "job_location": [
          "Bangalore",
          "Hyderabad",
          "Delhi"
        ],
        "posted_on": "2024-12-19T00:00:00",
        "required_experiance": "0 Yrs",
        "required_skills": "cross selling, lead generation, upsell,",
        "job_area": [
          "Others"
        ],
        "min_salary": "50000",
        "max_salary": "200000",
        "job_description": "Job Title: Senior Sales Intern CTC: Non-Metro Locations: 12,000/month + Incentives \n Delhi, Bangalore, Hyderabad: 15,000/month + Incentives \n Eligibility Criteria: Device Requirement: Must have an Android mobile device. \n Skills Required:Strong communication skills. \n Smart, presentable, and self-motivated. \n \n Key Responsibilities: Lead Generation: Generate leads through outbound calls and self-references. \n Effectively manage leads and ensure that hot leads are passed on to the Venue Manager. \n Follow up regularly until leads are successfully converted. \n Client Engagement: Inform prospective clients about the company and its presentation programs. \n Meet incoming venue clients and assess their financial planning needs. \n Product Presentation: Present tailored financial products to clients based on their requirements. \n Recommend suitable products and convincingly explain their benefits to clients. \n Sales Documentation: Collect policy-related documents and cheques from clients. \n Submit collected documents to the venue in charge promptly. \n Client Relationship Management: Build and nurture long-term relationships with clients. \n Provide exceptional after-sales services, including assistance with claim settlements. \n Cross-Selling & Upselling: Proactively cross-sell and upsell financial products to existing customers. \n Reporting & MIS: Maintain records of leads, appointments, and conversions. \n Generate and share regular MIS reports to track performance. \n \n Why Join Us Gain hands-on experience in financial product sales. \n Attractive incentives to reward high performance. \n Opportunity to build a strong foundation in financial planning and client management."
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "BAJAJ CAPITAL INSURANCE BROKING LTD",
        "job_title": "Urgent | Senior Marketing Intern",
        "job_link": "https://www.shine.com/job-search/urgent-senior-marketing-intern/bajaj-capital-insurance-broking-ltd/16304924",
        "job_location": [
          "Bangalore",
          "Hyderabad",
          "Delhi"
        ],
        "posted_on": "2024-12-19T00:00:00",
        "required_experiance": "0 Yrs",
        "required_skills": "lead generation, below the line marketing, door to door, marketing,",
        "job_area": [
          "Others"
        ],
        "min_salary": "50000",
        "max_salary": "200000",
        "job_description": "Job Title: Senior Marketing Intern CTC: Non-Metro Locations: 12,000/month + Incentives \n Delhi, Bangalore, Hyderabad: 15,000/month + Incentives \n Device Requirement: Must have an Android mobile device. \n Key Responsibilities: Lead Generation Activities: Execute various below-the-line (BTL) marketing campaigns, such as:Petrol pump activities. \n School drawing competitions. \n Door-to-door outreach campaigns. \n Approach and engage potential clients to explain the companys offerings. \n Client Interaction: Convince clients to fill out company coupons following the companys pitch guidelines. \n Data Entry & Reporting: Accurately enter the generated leads into the companys online database. \n Submit daily MIS reports of the leads generated to the survey supervisor. \n \n Benefits: Attractive performance-based incentives. \n Gain hands-on marketing and client engagement experience. \n Develop skills in lead generation and campaign execution."
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "TWEAK AND TURN SOLUTIONS",
        "job_title": "Human resource intern",
        "job_link": "https://www.shine.com/job-search/human-resource-intern/tweak-and-turn-solutions/16241509",
        "job_location": [
          "Delhi"
        ],
        "posted_on": "2024-12-10T12:43:20",
        "required_experiance": "0 to 2 Yrs",
        "required_skills": "communication skills, management, analytical skills,",
        "job_area": [
          "Operations Management / Process Analysis"
        ],
        "min_salary": "50000",
        "max_salary": "350000",
        "job_description": "Job Title: HR Intern - Recruitment Location: Delhi Stipend: Upto 15,000/month Duration: 4 to 6 months Job Description: We are looking for an HR Intern to assist with recruitment efforts. The ideal candidate should have a basic understanding of recruitment processes and possess excellent communication skills. Responsibilities: Assist in sourcing and screening candidates Coordinate interviews and follow-up communication Maintain candidate databases and recruitment reports Support the HR team with administrative tasks related to recruitment Requirements: Good communication skills (both written and verbal) Positive attitude and eagerness to learn Basic knowledge of recruitment processes"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Seoczar IT Services Private Limited",
        "job_title": "Digital Marketing Intern",
        "job_link": "https://www.shine.com/job-search/digital-marketing-intern/seoczar-it-services-private-limited/16261324",
        "job_location": [
          "Bhubaneswar",
          "Noida"
        ],
        "posted_on": "2024-12-13T19:01:00",
        "required_experiance": "0 Yrs",
        "required_skills": "computer, internship,gratuit, fresher",
        "job_area": [
          "Web / Mobile Technologies"
        ],
        "min_salary": "50000",
        "max_salary": "150000",
        "job_description": "SEO TRAINEE / SEO INTERN WITH STIPEND Ground floor, Plot no-693/2056, Road no: 02, Bharat Villa, Near Puri Canal Road Bus Stop , Rudrapur, Hanspal Bhubaneswar-752101 Stipend: Rs 5000/- per month Email : hr@seoczar.com Contact: \n 6371 578 742 / 8260 958 187 SEO Internship: The company offers an excellent opportunity for people seeking an internship in SEO. Manage both on-page SEO and off-page SEO Activities content marketing to create high-quality content relevant terms Manage and improve organic search engine performance and goal-setting based on click throughrates, traffic, and conversions stay up-to-date with the latest trends and changes in SEO and major search engine responsibilities and Duties Knowledge of the Internet and the working of Search Engine Knowledgeof HTML and meta tags and descriptions basic knowledge of SEO methods and tools demonstrated the ability tolearn and subsequently execute search engine optimization activities. We will be posting daily articles on our website and optimizing for the best search results. Interlinking posts and articles and social sharing the daily post. Learn all the basic SEO strategies (keyword research, link acquisition, 301 redirects, social media best practices, and full on-site optimization) Develop a basic understanding of Google Analytics, Google Webmaster Tools, etc tools to identify and resolve 404 crawl errors and fix dead links improve metadata across main website pages and blog posts. _______________________________________________________________________ Internship Description: Candidate should be able to work on Search Engine Optimization (SEO). Candidate should be able to take all the responsibilities of SEO. Should have Positive, Creative and Analytical mindset. Candidates have to work On-Page as well as Off-Page Activities. On-Page includes: Title, Description, Image Optimization, Video Optimization, Content Writing etc. Off-Page includes Back Linking, Page loading Speed, Article Submission, Classifieds etc. Who can apply: Any Graduate can apply Fresher with Computer Knowledge Comfortable to work in office at Noida Six months duration Benefits: Working on Live Projects Certificate of Internship Job offer after Internship (Performance Based) No fees is charged for Internship Mentor to Guide and complete the tasks assigned to candidate Seoczar IT Services Pvt. Ltd. Ground floor, Plot no-693/2056, Road no: 02, Bharat Villa, Near Puri Canal Road Bus Stop , Rudrapur, Hanspal Bhubaneswar-752101 REGARDS \n HR department \n 6371 578 742 / 8260 958 187 \n SEOCZAR IT SERVICES PVT LTD, BHUBANESWAR"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Shine.com",
        "job_title": "Marketing Intern",
        "job_link": "https://www.shine.com/job-search/marketing-intern/shinecom/16293553",
        "job_location": [
          "Gurugram"
        ],
        "posted_on": "2024-12-18T16:19:32",
        "required_experiance": "0 to 1 Yr",
        "required_skills": "online lead generation, event management, lead generation, marketing,",
        "job_area": [
          "Marketing / Communication"
        ],
        "min_salary": "50000",
        "max_salary": "100000",
        "job_description": "[bold] ABOUT COMPANY! ABOUT COMPANY! [bold] Hindustan Times (Shine.com) Hindustan Times (Shine.com) is India's Leading Online Job and Recruitment Portal - Search & Apply for Latest Job Vacancies across Top Companies in India.\r\nShine.com is the most innovative and second largest online job portal in India. Founded in 2008, over the past decade, Shine.com has become a prominent name in the recruitment industry. The popularity of the portal is evident from the fact that it has crossed the 3.4 crore candidate landmark and has more than 3 lakh latest job vacancies from leading companies on the site. Shine.com connects jobseekers and recruiters by accurately matching candidate profiles to the relevant job openings through an advanced 2-way matching technology.\r\n \r\nWhile most job portals only focus on getting candidates the next job, Shine focuses on the entire career growth of candidates. To this end, Shine has launched Shine Learning- Indias largest career skills site for working professionals with over 500+ courses & certifications. As the industry shifts towards mobile, Shine.com is leading the transition and is the fastest growing job portal on mobile devices, witnessing a 100% YOY growth in mobile traffic and also offers on-the-go jobs through the Shine Job Search App. Shine works closely to bridge the gap between talent & opportunities and offers end-to-end recruitment solutions. \r\n \r\nShine Job Fair brings candidates and top employers under one roof. While Shine HR Conclave brings top HR leaders to share insights on latest trends, innovations & best practices in the HR industry. Shine also has a large reach through its print product, Shine Jobs the Tuesday Job supplement of Hindustan Times making it the only job portal with an integrated print and online offering. [bold] Internship Opportunity! Internship Opportunity! We're excited to announce an opportunity for 2 [bold] talented interns talented interns to join our team for a 6 [bold] -month internship -month internship program! If you're a [bold] 3rd-year student 3rd-year student with at least [bold] one previous internship experience one previous internship experience , wed love to hear from you! [bold] Duration: Duration: 6 months \n [bold] Stipend: Stipend: 10,000/month \n [bold] Requirements: Requirements: 3rd-year student with a minimum of 1 completed internship [bold] Why Join Us Why Join Us Step into a Market Research Internship where youll gain: Real-World Market Analysis: Work on projects that shape our business strategy. Skill-Building: Get hands-on experience in data collection, analysis, and research tools. Mentorship: Collaborate with industry experts and receive valuable guidance. Strategic Exposure: See how your insights drive decisions."
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "InfoObjects",
        "job_title": "HR Intern",
        "job_link": "https://www.shine.com/job-search/hr-intern/infoobjects/16192121",
        "job_location": [
          "Jaipur",
          "Other Rajasthan"
        ],
        "posted_on": "2024-11-27T01:29:13",
        "required_experiance": "0 to 4 Yrs",
        "required_skills": "Human Resource, HR Intern, BTech, IT Background",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "HR Intern\n\nRole Category: Human Resource Team\n\nRole: HR Intern\n\nJob Location: Jaipur\n\nExperience: Fresher\n\nQualifications\n B.Tech. (IT Background Preferred),"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Wehire Talent Solutions",
        "job_title": "Hr Intern     .",
        "job_link": "https://www.shine.com/job-search/hr-intern/wehire-talent-solutions/16216861",
        "job_location": [
          "Mumbai City"
        ],
        "posted_on": "2024-12-03T15:56:08",
        "required_experiance": "1 to 6 Yrs",
        "required_skills": "human resources, talent acquisition, human resource management,hr recruiter, recruiter, hr executive, hr intern",
        "job_area": [
          "HR"
        ],
        "min_salary": "50000",
        "max_salary": "300000",
        "job_description": "[bold] Position Position : HR Interns / HR Executive [bold] About Us About Us : We assist candidates in achieving their career goals by placing them in multinational companies (MNCs) based on their skills. Acting as a liaison between candidates and clients, we provide job opportunities to job seekers at no cost. [bold] Role Role : HR Interns / HR Executive \n [bold] Location Location : Mahavir Nagar, Kandivali, Mumbai \n [bold] Mode of Work Mode of Work : Work from Office only [bold] Job Description Job Description : Work on various recruitment-related projects. Fresh graduates/undergraduates are welcome to apply. Recruitment experience is a plus. Candidates looking to restart their careers are also encouraged to apply. 6 days a week, work from the office, with Sundays off. Full-time and part-time positions available. [bold] Job Roles and Responsibilities Job Roles and Responsibilities : Understand client hiring requirements. Post job openings on social media platforms. Screen CVs and short-list candidates. Conduct interviews and coordinate with the HR teams of client companies. Brief candidates about the interview process and rounds."
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Jobs Flash.",
        "job_title": "HR FRESHERS & HR INTERNS ( FEMALES ) REQUIRED",
        "job_link": "https://www.shine.com/job-search/hr-freshers-hr-interns-females-required/jobs-flash/15851639",
        "job_location": [
          "Gurugram"
        ],
        "posted_on": "2024-12-09T12:56:50",
        "required_experiance": "0 to 1 Yr",
        "required_skills": "recruitment, placement, hr,human resource, intern, recruiter",
        "job_area": [
          "HR",
          "Recruitment"
        ],
        "min_salary": "50000",
        "max_salary": "150000",
        "job_description": "Dear candidate We are one of the premium Job Consultants doing pan India recruitments , located in Gurgaon . We have over 2 decades of Track record in providing best Recruitment and HR Consulting services to our clients al across the Country , to know more about is log in to our website : www.jobsflash.in . We are looking for HR Freshers , HR Executives , HR Interns for our own organisation . [bold] FOR INSTANT INTERVIEW CALL OR WHATSAPP : 9313806538 !! FOR INSTANT INTERVIEW CALL OR WHATSAPP : 9313806538 !! [bold] POSITION : HR INTERNS , HR EXECUTIVES , GRADUATES  ( FEMALES ONLY ) POSITION : HR INTERNS , HR EXECUTIVES , GRADUATES  ( FEMALES ONLY ) [bold] LOCATION : SECTOR 15 PART-2 , GURGAON . PG FACILITY AVAILABLE !! LOCATION : SECTOR 15 PART-2 , GURGAON . PG FACILITY AVAILABLE !! \n SATURDAYS HALF DAY , SUNDAY OFF . NO PICK UP AND DROP , LIMITED VACANCIES . FOR INSTANT INTERVIEW CALL OR WHATSAPP : 9313806538 !! We are looking for HR Freshers ( Females only ) who are either pursuing MBA, BBA , Or are looking for a career in HR . [bold] We are based in Sector 15 part- 2, Gurgaon We are based in Sector 15 part- 2, Gurgaon . [bold] IT WILL BE A PAID INTERNSHIP !! WITH JOB OFFER AFTER COMPLETION OF INTERNSHIP !! IT WILL BE A PAID INTERNSHIP !! WITH JOB OFFER AFTER COMPLETION OF INTERNSHIP !! \n JOB PROFILE : JOB DESCRIPTION:- 1. Sourcing, screening, shortlisting & arranging interviews for the candidates . 2. Hands on experience in handling job portals and social media sites . 3. To maintain HR database , 4. JD preparation and Company research . 5. Prepare and issuing various letters , forwarding mails to various candidates . 6. Coordinating interviews with client company , lining up candidates , sending them the Job descriptions , Helping in onboard activities . 7. Undertake research activities of the client Company and preparing the job description of the job , coordination with the client company , handle the Data base , Excel sheets , prepare trackers etc . 8. Ability to work in Team REQUIRMENT:- 1.GOOD COMMUNICATION SKILL IN ENGLISH . 2.PLEASANT PERSNALITY. 3.STRONG CONVIENCING POWER. 4.HARD WORKING. FUNCTIONAL AREA HR Internship, Internship In HR, Human Resource Internship, Internship In Gurugram . \n RESPONSIBILITIES : The HR Manager position is for someone who has a lot of drive to make things happen both for the business and its employees; has excellent co-ordination and collaboration abilities and is someone who is open to learning. \n How to apply : \n Email your Latest resume by return mail with your response to points below to consider your candidature (PLEASE DO NOT CHANGE THE SUBJECT LINE , ATTACH YOUR PHOTOGRAPH IS POSSIBLE ): Present Salary with all Perks & Benefits : Expected Salary : Joining Time / Notice Period: Availability for Interview : Ready to Relocate : Present location : Thanks & Regards Jobs Flash Consulting Services www.jobsflash.in 0124-4102994 . info@jobsflash.in"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Hinduja Global Solutions Limited (HGS)",
        "job_title": " Opportunity Sales Executive Intern | IDFC Bank Payroll",
        "job_link": "https://www.shine.com/job-search/job-opportunity-sales-executive-intern-idfc-bank-payroll/hinduja-global-solutions-limited-hgs/16195658",
        "job_location": [
          "Thane"
        ],
        "posted_on": "2024-11-28T00:00:00",
        "required_experiance": "0 to 3 Yrs",
        "required_skills": "outbound sales, telemarketing sales, calling, sales,",
        "job_area": [
          "Pre-Sales",
          "Sales / BD"
        ],
        "min_salary": "50000",
        "max_salary": "300000",
        "job_description": "[bold] Job Opportunity: Sales Executive Intern | IDFC Bank Payroll Job Opportunity: Sales Executive Intern | IDFC Bank Payroll Are you ready to kickstart your career in sales  Join IDFC Bank on an exciting 6-month internship where you'll gain valuable experience, sharpen your communication skills, and achieve real growth! [heading] What You'll Do: [bold] What You'll Do: What You'll Do: [bold] Engage with Customers: Engage with Customers: Use provided scripts to connect with potential or existing customers, understand their needs, and present tailored solutions. [bold] Answer & Assist: Answer & Assist: Confidently answer questions about our products and services to ensure clarity and trust. [bold] Sales Mastery: Sales Mastery: Ask the right questions to understand customer requirements and close sales effectively. [bold] Achieve Targets: Achieve Targets: Work toward quarterly sales goals and earn attractive incentives. [bold] 6 months Internship. 6 months Internship. [heading] What We Offer: [bold] What We Offer: What We Offer: [bold] Work Hours: Work Hours: Day shift, 9:30 AM to 6:30 PM, Sunday off. [bold] Convenience: Convenience: Pick-up and drop-off facility provided. [bold] Supportive Environment: Supportive Environment: Be a part of a dynamic and energetic team. [heading] Candidate Requirements: [bold] Candidate Requirements: Candidate Requirements: Graduate in any discipline (Freshers are welcome!). Excellent English communication skills. Passion for sales and customer engagement. [heading] Key Details: [bold] Key Details: Key Details: [bold] Drive Date: Drive Date: 04-Dec-2024 [bold] Location: Location: Thane Dont miss this opportunity to grow your career with one of the leading financial institutions. Apply now and start your journey with IDFC Bank! Please share you CVs over [bold] sourcing02@hgsbs.com sourcing02@hgsbs.com or connect over [bold] 8928865044 8928865044"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "RadixVision Services",
        "job_title": "Business Development Intern",
        "job_link": "https://www.shine.com/job-search/business-development-intern/radixvision-services/16361061",
        "job_location": [
          "Other Madhya Pradesh",
          "Bhopal"
        ],
        "posted_on": "2024-12-23T22:14:45",
        "required_experiance": "0 to 4 Yrs",
        "required_skills": "Analytical Skills, Market Research, Communication, Customer Service, Lead Generation,Strong problemsolving abilities, Ability to work independently, Ability to work in a team, Experience with CRM software",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Company Description\n\nRadixVision Services is dedicated to transforming businesses with innovative service solutions in Bhopal. Our team specializes in delivering customized strategies that drive growth, streamline operations, and enhance customer experiences. With a focus on problem-solving and industry expertise, we help clients stay ahead in a competitive market by optimizing processes, leveraging technology, and implementing strategic initiatives.\n\nRole Description\n\nThis is a full-time hybrid role for a Business Development Intern at RadixVision Services. The intern will be responsible for tasks such as lead generation, market research, customer service, and communication. While the role is primarily located in Bhopal, there is flexibility for some remote work.\n\nQualifications\n Analytical Skills and Market Research\n Communication and Customer Service\n Lead Generation\n Strong problem-solving abilities\n Ability to work independently and in a team\n Experience with CRM software is a plus\n Pursuing or completed a degree in Business, Marketing, or related field,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Quinx Innovations Pvt Ltd",
        "job_title": "Backend Developer Intern",
        "job_link": "https://www.shine.com/job-search/backend-developer-intern/quinx-innovations-pvt-ltd/16361114",
        "job_location": [
          "Other Karnataka"
        ],
        "posted_on": "2024-12-23T22:16:55",
        "required_experiance": "0 to 4 Yrs",
        "required_skills": "Database Management, HTML5, CSS3, JavaScript,Nodejs, Nextjs, AWS Services, Typescript, Responsive Design, Code Quality, Best Practices",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "50000",
        "max_salary": "100000",
        "job_description": "At Quinx, we are dedicated to revolutionizing project-based learning by providing a solution that empowers students to explore, collaborate and create meaningful projects aligned with their interests. We are passionate about enabling students to develop skills through hands-on project experiences, fostering teamwork, and addressing challenges within the realm of project-based learning.\n\nPosition : Web Developer (Full stack) Intern / Full time\n\nLocation : Bengaluru\n\nDuration : 6 Months\n\nStipend : 6k - 10k per month (based on performance)\n\nExperience : Prior work experience and clean & scalable coding style is a plus\n\nSkills & Requirements:\n\n1. Node.js and Next.js (Back-End):\n\nProficiency in Node.js for server-side logic and API development.\n\nExtensive knowledge of Next.js for server-rendered React applications, including routing, data fetching, and static site generation.\n\n2. AWS Services:\n\nProficiency in AWS services relevant to DevOps, including but not limited to EC2, S3, Lambda, API Gateway, CloudFront, and IAM for infrastructure management.\n\n3. Database Management:\n\nKnowledge of database systems, especially with NoSQL databases like DynamoDB or MongoDB.\n\n4. HTML, CSS, JavaScript (ES6+), Typescript and Responsive Design:\n\nStrong foundation in HTML5 and CSS3, responsive design principles, and CSS frameworks like Bootstrap or Tailwind CSS.\n\nMastery in modern JavaScript features (ES6+) and its application in both front-end and back-end development.\n\n5.Code Quality & Best Practices:\n\nAdherence to clean code practices, code reviews, writing maintainable and scalable code, and implementing best practices for performance optimization. Should be able to Document the code properly and be familiar with Jira.\n\nResponsibilities:\n\nAs a backend web developer these are the primary tasks which you will be working on in phases.\n\nBack-End Development:\n\nDesign, develop, and maintain server-side logic using Node.js, handling requests and building APIs to support front-end functionalities.\n\nUtilize Next.js for server-rendered React applications, implementing routing, data fetching, and server-side rendering for optimized user experiences.\n\nCollaborate with the Machine Learning team to integrate the ML & DL models with the app.\n\nDatabase Management: Architect and manage databases, integrating them into the back-end using appropriate libraries and ensuring smooth data operations.\n\nCode Quality and Best Practices: Uphold coding standards and best practices, conduct code reviews, and contribute to creating scalable, maintainable, and efficient codebase. Should also maintain proper code documentation.\n\nMonitoring and Optimization: Deploy and manage infrastructure. Monitor system performance, troubleshoot issues and optimize application performance across the stack. Implement caching strategies, performance profiling, and scaling techniques for optimal performance.\n\nApart from the common perks of stipend, certificate and PPO chances, this opportunity opens you a door to contribute meaningfully under a startup environment to shape the future of project-based learning.\n\nJob Types: Fresher, Internship\nContract length: 6 months\n\nLocation Type:\n In-person\n\nAbility to commute/relocate:\n Bengaluru, Karnataka: Reliably commute or planning to relocate before starting work (Preferred)\n\nApplication Question(s):\n Declaration: I have read the Job description and would like to apply for 6 months onsite intern at Quinx (Bengaluru) with the provided stipend range of 6k-10k pm.\n\nEducation:\n Bachelor's (Preferred)\n\nWork Location: In person\n\nSpeak with the employer\n+91 7338033341,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "PP Consumer private limited",
        "job_title": "HR Intern",
        "job_link": "https://www.shine.com/job-search/hr-intern/pp-consumer-private-limited/16361119",
        "job_location": [
          "All India"
        ],
        "posted_on": "2024-12-23T22:17:07",
        "required_experiance": "0 to 4 Yrs",
        "required_skills": "Onboarding,Recruitment Support, Employee Records Management",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "Job Title: HR Intern\n\nJob Description:\n\nWe are looking for a proactive and enthusiastic HR Intern to join our Human Resources team. As an HR Intern, you will support the HR department in various tasks, gaining hands-on experience in a wide range of HR functions. This internship is a great opportunity for someone looking to start their career in Human Resources and develop a strong foundation in HR practices.\n\nKey Responsibilities:\n Recruitment Support: Assist in the recruitment process by posting job openings, screening resumes, conducting initial candidate outreach, and scheduling interviews. Help in maintaining the recruitment database and tracking applicant status.\n Onboarding: Assist in the onboarding process for new hires, including preparing onboarding materials, coordinating orientation sessions, and ensuring all necessary documentation is completed.\n Employee Records Management: Help in maintaining and organizing employee records, ensuring that all files are up-to-date and compliant with company policies and legal requirements.\n\nJob Type: Internship\n\nWork Location: In person,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Digiastic LLP",
        "job_title": "Customer Support Intern",
        "job_link": "https://www.shine.com/job-search/customer-support-intern/digiastic-llp/16361173",
        "job_location": [
          "All India"
        ],
        "posted_on": "2024-12-23T22:19:06",
        "required_experiance": "1 to 5 Yrs",
        "required_skills": "Data Collection, Data Management, Data Analysis, Database Maintenance, Reporting, Documentation, Written Communication,Outreach Strategies, Tool Utilization",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "",
        "max_salary": "",
        "job_description": "ViralChilly, a unit of Digiastic LLP, is recognized as one of the best startups to work for in Jaipur. We are a digital marketing agency with a people-centric approach, working with reputed clients like Canva, Adobe, Stillio, and more.We are seeking a motivated and enthusiastic Outreach Intern to assist with our outreach and engagement efforts. The ideal candidate should be eager to learn about outreach strategies and stakeholder engagement.\n\nKey Responsibilities:\n Data Collection & Management: Assist in collecting and maintaining outreach-related data from various sources.\n Data Analysis: Analyse outreach data to identify trends, patterns, and insights.\n Database Maintenance: Help ensure data accuracy and integrity within our databases.\n Reporting: Prepare regular reports on outreach activities and outcomes.\n Support Outreach Strategies: Collaborate with the team to provide data insights that inform and refine outreach strategies and tactics.\n Documentation: Document data collection processes and methodologies to ensure consistency and reliability in future data handling.\n Tool Utilization: Use data analysis tools and software (e.g., Excel, Google Sheets, data visualization tools) to manage and interpret data effectively.\n\nQualifications:\n Currently pursuing or recently graduated with a bachelor's degree\n Strong written communication skills.\n\nThings You Should Know\n Work hours: 9 AM to 6:30 PM, Monday to Friday.\n 30-minute lunch break + 15-minute tea break.\n Work from office.\n Stipend based on performance and interview.\n\nJob Type: Fresher\n\nSchedule:\n Day shift\n Monday to Friday\n\nEducation:\n Higher Secondary(12th Pass) (Preferred)\n\nExperience:\n total work: 1 year (Preferred)\n Customer service: 1 year (Preferred)\n\nLanguage:\n Hindi (Preferred)\n English (Preferred)\n\nWork Location: In person\n\nSpeak with the employer\n+91 9024407715,"
      },
      {
        "platform": "Shine",
        "platform_link": "https://www.shine.com/",
        "company_name": "Hastaakshar Design Studio",
        "job_title": "Creative Marketing and Multimedia Intern",
        "job_link": "https://www.shine.com/job-search/creative-marketing-and-multimedia-intern/hastaakshar-design-studio/16361197",
        "job_location": [
          "All India"
        ],
        "posted_on": "2024-12-23T22:19:59",
        "required_experiance": "0 to 4 Yrs",
        "required_skills": "social media, graphic design, video editing, Adobe Premiere Pro, communication,web management, video shooting, organizational skills, creative mindset, attention to detail",
        "job_area": [
          "General / Other Software"
        ],
        "min_salary": "150000",
        "max_salary": "200000",
        "job_description": "Job Title: Creative Marketing and Multimedia Intern\n\nLocation: Hastaakshar Design Studio, Mayapuri Phase 1\n\nStipend: 12K to 15K INR per month\n\nStart Date: ASAP\n\nAbout Us:\n\nPrimary Strokes and Jomacs are vibrant businesses led by Daksh Kalra, spanning digital art, music production, and educational content. Youll work in our 2000 sqft design studio, an environment crafted to stimulate creativity and innovation.\n\nWho Youll Work With:\n\nDirectly under the mentorship of Ar. Daksh Kalra, this role is ideal for creative individuals looking to engage deeply with entrepreneurial and artistic projects.\n\nKey Responsibilities:\n\n Content Management: Manage and schedule content across platforms like Instagram and YouTube.\n\n Web and Email Management: Update our Wix site and manage email campaigns.\n\n Graphic and Video Production: Create visual content and edit videos, including video shooting and editing skills, preferably with Adobe Premiere Pro.\n\n Lead Management: Handle inquiries and coordinate lead follow-ups.\n\n Networking and Promotion: Participate in pitches and represent our brands in various settings.\n\nWhat You Will Gain:\n\n In-depth learning and experimentation across multiple disciplines.\n\n Direct mentorship from an experienced entrepreneur and artist.\n\n The opportunity to impact diverse projects combining art, music, and education.\n\nSkills and Qualifications:\n\n Proficiency in social media, graphic design, and web management tools.\n\n Strong video shooting and editing skills, particularly in Adobe Premiere Pro.\n\n Excellent communication and organizational skills.\n\n A creative mindset with attention to detail.\n\nEducation:\n\n Open to current students or recent graduates in Marketing, Graphic Design, Media Studies, or related fields.\n\nHow to Apply:\n\nPlease send your resume, a cover letter, and any relevant work samples/portfolio to ar.dakshkalra@gmail.com . Ensure your application highlights your skills and experiences that align with the responsibilities of this role.,"
      }
    ]
  }
]