[{"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Internship_Finance", "job_title": "Finance Intern", "job_link": "https://www.shine.com/job-search/finance-intern/internship_finance/16396070", "location": "['Rudrapur', 'Other Uttarakhand']", "posted_on": "2024-12-28T05:53:19", "experiance": "0 to 4 Yrs", "skill_list": "Analytical Skills, Financial Statements, Accounting, Communication skills,Finance knowledge, Financial software, Detailoriented, Organized", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "Company Description\n\nWe suggest you enter details here.\n\nRole Description\n\nThis is a full-time on-site role for a Finance Intern at Internship_Finance located in Rudrapur. The Finance Intern will be involved in tasks related to finance, financial statements, accounting, and communication on a day-to-day basis.\n\nQualifications\n Analytical Skills and Finance knowledge\n Proficiency in Financial Statements and Accounting\n Strong Communication skills\n Ability to work with numbers and data\n Detail-oriented and organized\n Knowledge of financial software and tools\n Pursuing or completed a degree in Finance, Accounting, or related field,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Internship Studio", "job_title": "Support Intern", "job_link": "https://www.shine.com/job-search/support-intern/internship-studio/16332748", "location": "['Other Maharashtra', 'Pune']", "posted_on": "2024-12-22T02:10:53", "experiance": "0 to 4 Yrs", "skill_list": "Excellent communication skills, Customercentric approach, Verbal , written communication skills, Ability to convey technical information clearly, Customerfocused mindset, Multitasking, Prioritization, Proficiency in using computer applications", "job_type": "General / Other Software", "min_salary": "50000", "max_salary": "50000", "salary": "50000 50000", "job_description": "Role Description\n\nThis is a full-time on-site role for a\n\nSupportIntern at InternshipStudio located in Pune. We are seeking a motivated Support Intern to join our team and assist in providing outstanding customer support. The ideal candidate will have excellent communication skills, a strong customer-centric approach, and a willingness to learn and grow in a fast-paced environment.\n\nKey Responsibilities:\n Handle incoming customer calls and emails professionally and courteously.\n Provide timely and effective support to customers by troubleshooting issues and resolving inquiries promptly.\n Create and manage support tickets using our internal ticketing system, ensuring accurate documentation of customer interactions and resolutions.\n\nCollaborate with other team members to escalate complex issues and ensure timely resolution.\n Communicate effectively with customers to provide status updates, gather additional information, and ensure a positive support experience.\n\nQualifications:\n Currently pursuing or recently completed a degree in any field or equivalent practical experience.\n Excellent verbal and written communication skills, with the ability to convey technical information clearly and concisely.\n Customer-focused mindset with a passion for delivering exceptional service.\n Ability to multitask and prioritize tasks effectively in a fast-paced environment.\n Proficiency in using computer applications and familiarity with customer support software is a plus.\n Willingness to learn and adapt to new technologies and processes.\n\nExperience - Freshers\n\nLocation - Baner (Work From Office)\n\nStipend - 3000 to 5000 per month\n\nNotice Period- Immediate Joiner,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Coderwing Hiring For MERN Stack Intern (Fresher)", "job_title": "MERN Stack Intern (Fresher)", "job_link": "https://www.shine.com/job-search/mern-stack-intern-fresher/coderwing/16288926", "location": "['Indore']", "posted_on": "2024-12-17T12:58:03", "experiance": "0 Yrs", "skill_list": "node.js, react.js, express.js, mongodb,", "job_type": "General / Other Software, IT Operations / EDP / MIS", "min_salary": "100000", "max_salary": "150000", "salary": "100000 150000", "job_description": "[heading] Job description Job description [bold] Company: Company: CoderWing \n [bold] Location: Location: Indore, Madhya Pradesh \n [bold] Start Date: Start Date: Immediate At [bold] CoderWing CoderWing , we're a growing tech company with a focus on innovative software solutions. We are looking for a passionate and dedicated [bold] MERN Stack Intern MERN Stack Intern to join our dynamic team. If you're eager to learn, grow, and get hands-on experience with cutting-edge technologies, this is the perfect opportunity for you! [bold] What You'll Do: What You'll Do: Assist in the development of web applications using the MERN stack (MongoDB, Express.js, React, Node.js). Collaborate with senior developers to implement new features and functionality. Write clean, scalable, and efficient code. Debug and troubleshoot application issues. Participate in code reviews and learn best practices. Contribute to the improvement of our web applications. [bold] What We're Looking For: What We're Looking For: Basic understanding of web development concepts. Familiarity with the MERN stack (MongoDB, Express.js, React.js, Node.js). Knowledge of JavaScript, HTML, and CSS. Passion for coding and eagerness to learn. Good problem-solving skills. Strong communication skills and the ability to work collaboratively in a team. [bold] Preferred Qualifications: Preferred Qualifications: Previous experience or personal projects using the MERN stack. Understanding of version control systems (Git). Knowledge of RESTful APIs and backend development. [bold] Why CoderWing Why CoderWing Gain hands-on experience with the MERN stack and modern web technologies. Work in a collaborative and growth-oriented environment. Mentorship from experienced developers. Flexible working hours and a supportive work culture. [bold] How to Apply: How to Apply: Send your resume to [bold] inquiry.coderwing@gmail.com inquiry.coderwing@gmail.com or drop your CV at [bold] 9926640515 9926640515 via WhatsApp. Job Type: Internship Contract length: 3 months Schedule: Day shif Work Location: In person"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Human resources and marketing internship", "job_title": "Human resources and marketing internship", "job_link": "https://www.shine.com/job-search/human-resources-and-marketing-internship/human-resources-and-marketing-internship/16271306", "location": "['All India']", "posted_on": "2024-12-14T05:25:59", "experiance": "0 to 4 Yrs", "skill_list": "HR,Sales  Marketing", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "*Internship Opportunity at Lernx*\n\nLernx, a leading digital learning platform, is offering a 2-month remote internship program for students interested in Sales & Marketing and HR roles.\n About Lernx:*\nLernx provides affordable online courses, industrial training programs, certification programs, one-to-one mentorships, and placement preparations, empowering learners to achieve their goals.\n Eligibility Criteria:*\n- Undergraduates, Graduates, and Freshers are eligible to apply\n Internship Details:*\n- Duration: 2 months (remote)\n- Areas of focus: HR and Sales & Marketing.\n Benefits:*\n- Upon completion, interns will receive:\n- Various Certificates\n- Performance-based Stipend\n- Letter of Recommendation\n- Potential for Pre-Placement Offer (PPO) based on outstanding performance\n\nThis internship offers a valuable opportunity to gain hands-on experience and build a strong foundation in your chosen field.\nApply now to kickstart your career!,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Coderwing Hiring For Frontend Development Intern", "job_title": "Frontend Development Intern", "job_link": "https://www.shine.com/job-search/frontend-development-intern/coderwing/16135825", "location": "['Indore']", "posted_on": "2024-11-12T18:07:45", "experiance": "0 Yrs", "skill_list": "javascript, react.js,react.js development intern, react.js internship, react developer intern, javascript/react intern, intern, frontend development intern", "job_type": "General / Other Software", "min_salary": "50000", "max_salary": "100000", "salary": "50000 100000", "job_description": "[bold] Job Summary Job Summary As a Frontend React.js Developer, you will be in charge of developing compelling user interfaces and interactive online applications with React.js. You'll collaborate with designers and backend engineers to create responsive designs, integrate APIs, and improve application performance. [bold] Key Responsibilities Key Responsibilities Convert UI/UX designs to high-quality code using React.js and other frontend technologies. Create reusable React components and frameworks to expedite development and ensure consistency across the application. Use Redux, Context API, or other state management tools to effectively manage application state and data flow. Integrate with backend APIs and services to access and manipulate data. Optimize frontend performance by identifying bottlenecks in rendering, network queries, and overall application performance. Write clean, maintainable code that adheres to best practices and coding standards. Conduct unit and integration testing to verify code quality and dependability. [bold] Experience and Qualifications Experience and Qualifications Bachelors degree in Computer Science, Engineering, or a related discipline. \n Experienced Frontend Developer specializing on React.js development. \n Proficient in JavaScript, HTML5, CSS3, and other frontend technologies. \n Extensive knowledge of React.js and its fundamental principles, including virtual DOM, JSX, and component-based architecture. \n Experience with state management libraries/frameworks, such as Redux or Context API. \n Experience using frontend build technologies like Webpack, Babel, and npm/yarn. \n Expertise in responsive design and CSS preprocessors such as Sass or LESS. \n Experience with RESTful APIs and AJAX. . \n \n [bold] Job Type: Full-time Job Type: Full-time"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Beep - Internship & Job Alerts", "job_title": "Customer Service/Customer Support Internship in Pune", "job_link": "https://www.shine.com/job-search/customer-service-customer-support-internship-in-pune/beep-internship-job-alerts/16254819", "location": "['Other Maharashtra', 'Pune']", "posted_on": "2024-12-13T00:21:31", "experiance": "0 to 4 Yrs", "skill_list": "Data Management, Customer interaction, Analytical skills,Customer Onboarding, Feedback Collection, CRM database management, Educational content creation", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "Responsibilities\n Customer Onboarding: Assist the Customer Success managers in the onboarding process for new clients ,ensuring they are fully integrated and comfortable using our services. Prepare onboarding materials and help conduct introductory sessions for new users.\n Create assessments, sending invites, answering queries on emails.\n Data Management: Update and maintain customer records in the CRM database to ensure all customer interactions and details are logged accurately. Analyze customer usage data to identify patterns and insights that can be used to improve our services.\n Feedback Collection: Assist in the development and implementation of feedback mechanisms to gather meaningful insights from customers. Compile and report feedback to the Customer Success team to help refine strategies and improve customer experiences.\n Contribute to the creation of educational content and resources that help customers maximize the value of our services. Educational Requirements\n Currently enrolled in or a recent graduate of a bachelors degree program in Business Administration, Communications, Marketing, or a related field. About Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Beep - Internship & Job Alerts", "job_title": "Data Entry Internship in Pune", "job_link": "https://www.shine.com/job-search/data-entry-internship-in-pune/beep-internship-job-alerts/16273484", "location": "['Other Maharashtra', 'Pune']", "posted_on": "2024-12-14T07:05:15", "experiance": "0 to 4 Yrs", "skill_list": "Database Management, Data Entry, Data Processing,Attention to Detail", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "Maintain the database by entering new and updated candidate information\n Prepare source data for computer entry by compiling and sorting information\n Establish entry priorities\n Process documents by reviewing data for deficiencies\n Resolve deficiencies by using standard procedures or returning incomplete documents to the team leader for resolution\n Maintain data entry requirements by following data program techniques and procedures\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Beep - Internship & Job Alerts", "job_title": "Junior Teacher in Gujarat", "job_link": "https://www.shine.com/job-search/junior-teacher-in-gujarat/beep-internship-job-alerts/16279108", "location": "['All India']", "posted_on": "2024-12-15T00:43:19", "experiance": "2 to 6 Yrs", "skill_list": "Curriculum implementation, Teacher development, Student assessment, Parental involvement, Classroom environment, Administrative responsibilities", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "To lead the planning and execution of the Cambridge Early Years curriculum, supporting and guiding pre-primary teachers to create a nurturing, developmentally appropriate learning environment that fosters the physical, emotional, cognitive, and social development of young children.\n\nKey Responsibilities\n Curriculum implementation:\n\nEnsure the effective delivery of the Cambridge Early Years curriculum across all pre-primary classrooms.\n\nCollaborate with teachers to plan and implement lessons that align with the Cambridge Early Years framework, emphasizing holistic child development.\n\nRegularly review and update curriculum materials and teaching resources to ensure they meet Cambridge standards.\n Teacher development and support:\n\nProvide coaching, mentoring, and professional development opportunities for pre-primary teachers to ensure they are well-prepared to deliver the Cambridge curriculum.\n\nConduct regular classroom observations to provide constructive feedback and support to teachers.\n Student assessment and development:\n\nGuide teachers in assessing young children's progress using developmentally appropriate tools and Cambridge Early Years assessment methods.\n\nEnsure that assessments reflect a child's development in key areas, including communication, physical development, personal-social development, and early literacy and numeracy.\n Parental involvement:\n\nOrganize and lead parent-teacher meetings to discuss the progress and development of pre-primary students.\n\nProvide parents with regular updates on their childs development and ways they can support learning at home.\n\nAddress any parental concerns related to the pre-primary program and Cambridge curriculum implementation.\n Classroom environment:\n\nEnsure that classrooms are set up in a manner that fosters exploration, creativity, and learning in a safe and nurturing environment.\n\nAssist teachers in creating developmentally appropriate activities and experiences that support all areas of a childs development.\n\nEnsure compliance with health and safety standards in all pre-primary classrooms.\n Administrative responsibilities:\n\nMaintain records of student progress, attendance, and teacher performance.\n\nDevelop and oversee the implementation of policies related to early childhood education.\n\nCoordinate with school administration on scheduling, resource allocation, and reporting requirements.\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Beep - Internship & Job Alerts", "job_title": "Business Development Associate in Pune, Surat, Bhopal, Lucknow", "job_link": "https://www.shine.com/job-search/business-development-associate-in-pune-surat-bhopal-lucknow/beep-internship-job-alerts/16255085", "location": "['Other Maharashtra', 'Pune']", "posted_on": "2024-12-13T00:33:55", "experiance": "2 to 6 Yrs", "skill_list": "Direct sales, Negotiation, Client management,Building relationships, Ecommerce services", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "Key Responsibilities\n Engaging in direct sales activities for e-commerce services\n Building and maintaining relationships with potential clients\n Demonstrating the value and benefits of eCommerce services\n Negotiating contracts and closing sales deals\n Assisting new sellers in launching their shop on an eCommerce platform\n Helping sellers set up their seller accounts and profiles\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Beep - Internship & Job Alerts", "job_title": "Senior Teacher in Gujarat", "job_link": "https://www.shine.com/job-search/senior-teacher-in-gujarat/beep-internship-job-alerts/16290435", "location": "['All India']", "posted_on": "2024-12-17T22:57:12", "experiance": "3 to 7 Yrs", "skill_list": "Curriculum management, Teacher support, Student assessment, Parental engagement, Administrative duties", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "Job Purpose\n\nTo oversee the implementation of the Cambridge International curriculum, ensuring high academic standards, supporting teachers with lesson planning, and maintaining an effective and well-organized learning environment.\n\nKey Responsibilities\n Curriculum management:\n Ensure that the Cambridge curriculum is delivered effectively across all grades.\n Collaborate with teachers to develop lesson plans that align with Cambridge standards and objectives.\n Review and update curriculum materials as required, ensuring they meet Cambridge guidelines.\n Teacher support:\n Assist in the recruitment and onboarding of qualified Cambridge teachers.\n Provide ongoing support, coaching, and training to teaching staff.\n Monitor and evaluate teacher performance, providing feedback for continuous improvement.\n Student assessment:\n Oversee the implementation of Cambridge assessments and examinations.\n Analyze student performance data to identify areas for improvement.\n Collaborate with teachers to create intervention plans for students who need additional support.\n Parental engagement:\n Organize parent-teacher meetings to discuss student progress.\n Act as a liaison between parents and the school administration on academic matters.\n Address parental concerns regarding the Cambridge curriculum and student performance.\n Administrative duties:\n Maintain accurate academic records, including grades, attendance, and student progress reports.\n Coordinate and participate in Cambridge training sessions, workshops, and seminars.\n Assist in the development of school policies related to academics and student conduct.\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Beep - Internship & Job Alerts", "job_title": "Voice Process Associate in Delhi", "job_link": "https://www.shine.com/job-search/voice-process-associate-in-delhi/beep-internship-job-alerts/16277366", "location": "['Delhi']", "posted_on": "2024-12-14T23:25:28", "experiance": "1 to 5 Yrs", "skill_list": "Lead generation, Sales, Voice process,Performance goals", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "Key Responsibilities\n Outbound and inbound calls for lead generation and sales\n Handle voice process tasks efficiently\n Maintain a professional and positive attitude\n Meet performance goals in a dynamic environment\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Nurturing Interns Private Limited", "job_title": "Relationship Manager", "job_link": "https://www.shine.com/job-search/relationship-manager/nurturing-interns-private-limited/16359219", "location": "['Other Madhya Pradesh', 'Ratlam']", "posted_on": "2024-12-23T12:34:37", "experiance": "2 to 6 Yrs", "skill_list": "Client Relationship Management, Business Development, Product Promotion, Customer Service, Market Analysis, Documentation, Compliance, Reporting,Sales Targets, CrossSelling", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "Client Relationship Management: Develop and maintain strong relationships with existing and potential clients in the assigned territory or market segment.  Business Development: Identify new business opportunities and proactively market financial products (loans and related services) to potential customers.  Product Promotion: Effectively communicate and promote various financial products offered by the organization to prospective clients.  Sales Targets: Achieve sales targets by effectively managing leads, conversions, and client retention strategies.  Customer Service: Provide excellent customer service to clients, addressing their queries and resolving any issues promptly and professionally.  Market Analysis: Stay updated with market trends, competitor activities, and changes in regulations to identify opportunities and potential risks.  Cross-Selling: Identify cross-selling opportunities and recommend appropriate financial products to clients to meet their needs.  Documentation: Ensure accurate and timely documentation of all client interactions, transactions, and sales related activities.  Compliance: Adhere to the company's policies, procedures, and regulatory guidelines to maintain compliance at all times.  Reporting: Provide regular reports on sales activities, market insights, and customer feedback to the management team.\n\nJob Type: Full-time\n\nBenefits:\n Health insurance\n Paid sick time\n Provident Fund\n\nSchedule:\n Day shift\n Weekend availability\n\nEducation:\n Bachelor's (Preferred)\n\nExperience:\n total work: 2 years (Preferred)\n Sales: 2 years (Preferred)\n Financial services: 2 years (Preferred)\n\nLanguage:\n English (Preferred)\n\nWork Location: In person,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Beep - Internship & Job Alerts", "job_title": "Event Management Specialist in Mumbai, Pune", "job_link": "https://www.shine.com/job-search/event-management-specialist-in-mumbai-pune/beep-internship-job-alerts/16303226", "location": "['Other Maharashtra', 'Pune']", "posted_on": "2024-12-19T06:46:25", "experiance": "2 to 6 Yrs", "skill_list": "Budget Management, Event Management, Vendor Management, Relationship Management, Marketing, Collateral Management, Reporting,Profit , Loss Analysis", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "Key Responsibilities\n Coordinate and work on budget management for the event\n Manage the event execution team\n Manage key relationships with third-party vendors and contractors from Pune, Maharashtra\n Coordinate event communications including branding, online and offline marketing\n Handle event collaterals, event evaluation and reporting, and profit and loss analysis\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Applying internship", "job_title": "Multidisciplinary designer", "job_link": "https://www.shine.com/job-search/multidisciplinary-designer/applying-internship/16314501", "location": "['Chandigarh']", "posted_on": "2024-12-20T05:29:02", "experiance": "0 to 4 Yrs", "skill_list": "Adobe Creative Cloud, Communication Skills,Design Elements, Design Principles, Design Techniques, Collaboration Skills, User Experience UX Design", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "Company Description\n\nwe suggest you enter details here\n\nRole Description\n\nThis is a full-time hybrid role for a Multidisciplinary Designer at Applying Internship in Chandigarh, with flexibility for remote work. The Multidisciplinary Designer will be responsible for collaborating with cross-functional teams to create innovative design solutions, develop visual concepts, and produce high-quality design work across various mediums.\n\nQualifications\n Proficiency in design software such as Adobe Creative cloud\n Strong understanding of design elements, Principles and techniques.\n Excellent communication and collaboration skills\n Ability to work on multiple projects simultaneously\n Experience in user experience (UX) design is a plus\n Bachelor's degree in Design Field.,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Beep - Internship & Job Alerts", "job_title": "UI/UX Design Internship in Mumbai, Bangalore, Pune", "job_link": "https://www.shine.com/job-search/ui-ux-design-internship-in-mumbai-bangalore-pune/beep-internship-job-alerts/16316192", "location": "['Other Maharashtra', 'Pune']", "posted_on": "2024-12-20T07:21:02", "experiance": "0 to 4 Yrs", "skill_list": "User research, Wireframes, Usability testing,UI designs, Prototypes, Figma, Interactive prototypes, Analyzing user feedback, UIUX design, Design trends", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "Selected Intern's Day-to-day Responsibilities Include\n Collaborate with the design team to create intuitive and visually appealing user interface designs for our digital products\n Assist in conducting user research and gathering feedback to inform design decisions and improve the user experience\n Translate wireframes and prototypes into polished UI designs using Figma, ensuring consistency and adherence to brand guidelines\n Create interactive prototypes to demonstrate the flow and functionality of the design concepts\n Support in building and maintaining UI components and style guides to facilitate efficient design workflows\n Assist in conducting usability testing and analyzing user feedback to identify areas of improvement and propose design enhancements\n Stay updated with the latest UI/UX design trends and best practices, and actively contribute innovative ideas to enhance our products\" user experience\n\nJoin our dynamic team and gain valuable industry experience while making a significant impact on the design of our cutting-edge digital products. Apply now and unleash your creativity in an exciting and collaborative environment at MentorBoxx!\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Coderwing Hiring For Recruitment and Engagement Intern", "job_title": "Recruitment and Engagement Intern", "job_link": "https://www.shine.com/job-search/recruitment-and-engagement-intern/coderwing/16130818", "location": "['Indore']", "posted_on": "2024-11-12T08:06:11", "experiance": "0 Yrs", "skill_list": "talent acquisition, hr generalist activities,recruitment process, candidate sourcing", "job_type": "General / Other Software", "min_salary": "100000", "max_salary": "300000", "salary": "100000 300000", "job_description": "[heading] Job description Job description [bold] Job Summary Job Summary The person should be responsible for maintaining basic HR functions in the company, and also extending support to other departments. [bold] Responsibilities and Duties Responsibilities and Duties Screening of candidates, recruitment, and selection of candidates Timely facilitation of hiring & selections as per open positions Documentation/Completion of joining formalities Counselling of new joiners and mentoring them Office operations, admin and record-keeping Attendance management, performance appraisal Department coordination, and handling reporting management [bold] Required Experience and Qualifications Required Experience and Qualifications Qualification Graduation/Post Graduation Go-getter approach Good English communication Leadership skills, and can performance with multi-streaming efforts"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Beep - Internship & Job Alerts", "job_title": "Graphic Designer in Pune", "job_link": "https://www.shine.com/job-search/graphic-designer-in-pune/beep-internship-job-alerts/16226449", "location": "['Other Maharashtra', 'Pune']", "posted_on": "2024-12-05T23:22:28", "experiance": "2 to 6 Yrs", "skill_list": "Digital media, Graphics, Web design, Social media, Analytical skills,Brand assets, Creative tasks, Marketing activities, Email campaigns", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "Key Responsibilities\n Think, act, and design for digital media\n Develop and strengthen brand assets, including style and brand guidelines\n Deliver high-quality & on-brand graphics (still & motion) to support superior digital & performance marketing\n Perform mid-to-high complexity creative tasks independently that are cohesive, simple, intuitive, and customer-centric\n Produce creative assets, including graphics, templates, layouts, and visual standards for marketing activities across multiple channels (these include web, social media, events, email campaigns, and other activities)\n Refine other peoples ideas and come up with new ones to create high-quality creative outcomes\n Analyze, report, and improve your designs iteratively with each initiative\n\nSkills & Requirements\n Should have previous work samples\n Someone who lives breathes and expresses oneself through design in its many manifestations in and across a digital-first ecosystem\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Nurturing Interns Private Limited", "job_title": "TMS Manager (POS Operations)", "job_link": "https://www.shine.com/job-search/tms-manager-pos-operations/nurturing-interns-private-limited/16240435", "location": "['Chennai', 'Other Tamil Nadu']", "posted_on": "2024-12-09T00:03:52", "experiance": "8 to 12 Yrs", "skill_list": "SIM,POS business process  terminal functionality knowledge, POS terminal configuration APN,  IPport,  key injection, UATProduction testing coordination, Troubleshooting  problemsolving for POS terminals, Team  stakeholder management, TMS Terminal Management System expertise, Compliance  audit adherence, Technical expertise in POS terminal functionalities , software", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "-POS business process & terminal functionality knowledge\n\n-POS terminal configuration (APN, IP/port, SIM, key injection)\n\n-UAT/Production testing coordination\n\n-Troubleshooting & problem-solving for POS terminals\n\n-Team & stakeholder management\n\n-TMS (Terminal Management System) expertise\n\n-Compliance & audit adherence\n\n-Technical expertise in POS terminal functionalities and software\n\n-8-12 years, with at least 5 years in POS services.\n\n-Target Companies: Any organization with a PoS business focus like- Square, Toast, -Lightspeed, Clover etc.\n\nJob Type: Full-time\n\nEducation:\n Bachelor's (Preferred)\n\nExperience:\n Operations: 8 years (Preferred)\n total work: 8 years (Preferred)\n\nWork Location: In person,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Beep - Internship & Job Alerts", "job_title": "Data Annotation Internship in Pune", "job_link": "https://www.shine.com/job-search/data-annotation-internship-in-pune/beep-internship-job-alerts/16147225", "location": "['Other Maharashtra', 'Pune']", "posted_on": "2024-11-15T02:23:08", "experiance": "0 to 4 Yrs", "skill_list": "Computer Vision, Machine Learning, Tracking, Tagging, Collaboration, Content Writing,Data Annotation, Labeling, Generating Prompts, AIML, Annotating Data, 2D3D Bounding Boxes, Image Labeling, Video Labeling, Fastpaced Environment", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "The role entitles tracking, annotation, labeling, and generating prompts & contents for datasets for training the machine learning algorithms. The Data Annotation Specialist has the responsibility to create & curate sets of data specifically created for computer vision & future technologies by using a combination of tracking, annotation, labeling, and generating prompts & content on images, videos, or audio. As a member of the Data Annotation team, you will help us Annotate data for use within a larger machine learning & AI/ML framework. You will be part of a great international team of scientists & professionals who bring cutting-edge technology in verticals like Autonomous Driving to the auto industry as well as working for industries like Retail, Medi-tech, Agri-tech, Gen AI, etc. that will all benefit from machine learning & ai in the near future. joining our team means playing an integral role in bettering the world with science & technology.\n\nSelected Intern's Day-to-day Responsibilities Include\n Accurately label and annotate data in all formats before it reaches the end customer.\n Annotate and label 2D/3D bounding boxes for various industries.\n Tag and track while working on sports annotation.\n Collaborate with teammates, label images, and provide feedback to clients\" engineers and data scientists to improve tools and algorithms.\n Write content while viewing images and videos to train the next level of ChatGPT.\n Work in a fast-paced environment that requires high accuracy, attention, and detail.\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"}, {"platform": "Shine", "platform_link": "https://www.shine.com/", "company": "Beep - Internship & Job Alerts", "job_title": "Business Development Associate in Lucknow, Pune, Surat, Bhopal", "job_link": "https://www.shine.com/job-search/business-development-associate-in-lucknow-pune-surat-bhopal/beep-internship-job-alerts/16174366", "location": "['Other Maharashtra', 'Pune']", "posted_on": "2024-11-21T01:59:13", "experiance": "2 to 6 Yrs", "skill_list": "Direct sales, Negotiation, Client management,Building relationships, Ecommerce services", "job_type": "General / Other Software", "min_salary": "", "max_salary": "", "salary": " ", "job_description": "Key Responsibilities\n Engaging in direct sales activities for e-commerce services\n Building and maintaining relationships with potential clients\n Demonstrating the value and benefits of eCommerce services\n Negotiating contracts and closing sales deals\n Assisting new sellers in launching their shop on an eCommerce platform\n Helping sellers set up their seller accounts and profiles\n\nAbout Company: Our sole aim at MentorBoxx is to bridge the gap between universities & industries. We select 30 students every month to regularly interact with the right industry experts, work on live industry projects, and grasp as much industry knowledge as possible.,"}]