[{"company": "Aspect Solution", "company_link": "https://www.linkedin.com/company/aspect-solution/life", "job_title": "E-Book Typing, Data Entry Executive work / Part-full time work", "job_href": "/jobs/view/4111901364/?alternateChannel=search&refId=CtNXeCHvxGS3hoB5ppAYbA%3D%3D&trackingId=z7XuRdHuZQCNMp88KhR2Jw%3D%3D&trk=d_flagship3_search_srp_jobs", "location": "Greater Kolkata Area", "posted_on": "20 hours ago as per the 2025-01-01 09:50:43", "applicant": "53 applicants", "job_type": "Not Found", "experience_level": "Not Found", "job_description": "About the job This job is sourced from a job board. Learn More Providing Part time/full time/home based jobs to all candidates who are willing to work for 2 to 3 hours. Skills Requirement :No predefined skills necessary Employment Type:  Freelance/ Home based Job, Part Time Gender Preference : Both male and female can apply Skills Requirement : No predefined skills necessary Hardworking personality and go-getter attitude.... Mobile/Desktop/Laptop Is Mandatory to do this work ..... Job Locality: All India/Any location (work from home) ........................... Job Responsibilities is that you have to submit your work on time. Thankyou This job is provided by Shine.com", "platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "job_link": "https://www.linkedin.com/jobs//jobs/view/4111901364/?alternateChannel=search&refId=CtNXeCHvxGS3hoB5ppAYbA%3D%3D&trackingId=z7XuRdHuZQCNMp88KhR2Jw%3D%3D&trk=d_flagship3_search_srp_jobs"}, {"company": "UNDP Careers", "company_link": "https://www.linkedin.com/company/undpcareers/life", "job_title": "Intern (Research Support) TEPP-II [5 Positions]", "job_href": "/jobs/view/4112588694/?alternateChannel=search&refId=CtNXeCHvxGS3hoB5ppAYbA%3D%3D&trackingId=fo%2BU5b3h0bOydXoMIgPxXw%3D%3D&trk=d_flagship3_search_srp_jobs", "location": "Dhaka, Dhaka, Bangladesh", "posted_on": "1 day ago as per the 2025-01-01 09:50:47", "applicant": "Over 100 applicants", "job_type": "Not Found", "experience_level": "Not Found", "job_description": "About the job Job Description Background Diversity, Equity and Inclusion are core principles at UNDP: we value diversity as an expression of the multiplicity of nations and cultures where we operate, we foster inclusion as a way of ensuring all personnel are empowered to contribute to our mission, and we ensure equity and fairness in all our actions. Taking a ‘leave no one behind’ approach to our diversity efforts means increasing representation of underserved populations. People who identify as belonging to marginalized or excluded populations are strongly encouraged to apply. Learn more about working at UNDP including our values and  inspiring stories. UNDP does not tolerate sexual exploitation and abuse, any kind of harassment, including sexual harassment, and discrimination. All selected candidates will, therefore, undergo rigorous reference and background checks. UNDP Bangladesh is seeking enthusiastic and skilled individuals to join as Intern (Research Support) within the UNDP-supported Research and Analytics Unit (RAU), IP Transformative Economic Policy Programme (TEPP)-II anchored at the Bangladesh Investment Development Authority (BIDA). This initiative aims to foster inclusive economic growth and attract investment in Bangladesh. The program is aligned with UNDP’s mission of promoting sustainable development and enhancing national economic resilience. The Intern (Research Support) will have the opportunity to work closely with experienced professionals across various departments, gaining hands-on experience in research and analytics. This role supports data-driven decision-making to improve investment strategies and contributes to national policy development efforts that align with sustainable and equitable economic practices. This position is designed to cultivate young talent while bolstering the analytical capacity of the RAU and Futurenation programs, ultimately contributing to a more competitive and investment-friendly environment in Bangladesh. Duties And Responsibilities Under the guidance and direct supervision of the Coordinator and Economist, Intern (Research Support) will assist in delivering the following tasks: Conduct research and analyze data on economic trends, market conditions, and investment opportunities in Bangladesh. Prepare clear and concise reports summarizing findings, investment ideas, and policy recommendations. Collect, organize and analyze data from diverse sources to support informed decision-making. Prepare clear and concise reports on research findings, investment proposals, and policy recommendations. Produce quick briefing notes and write-ups on sectoral investment. Prepare presentations to effectively communicate research findings, recommendations, and project updates to stakeholders. Contribute to ongoing project’s activities related to investment promotion, policy development, or economic analysis. Provide administrative assistance as needed, including scheduling, document management, and event coordination. Any other relevant task assigned by the supervisor. Reports covering the delivery of the responsibilities listed above. Competencies Functional Competencies Strong sense of collaborative work, excellent communication, and interpersonal skills. Keen attention to detail. Excellent analytical and research skills. Interest in contemporary development issues in Bangladesh with some background in researching the region. Communication Speaks and writes clearly, concisely and effectively; Listens to others, correctly interprets messages from others and responds appropriately; Asks questions to clarify, and exhibits interest in having two-way communication; Tailors’ language, tone, style and format to match audience. Demonstrates openness in sharing information and keeping people informed. Teamwork Works collaboratively with colleagues to achieve organizational goals; solicits input by genuinely valuing others’ ideas and expertise. Is willing to learn from others, places team agenda before personal agenda. Supports and acts in accordance with final group decision, even when such decisions may not entirely reflect own position. Planning & Organizing Develops clear goals that are consistent with agreed strategies. Identifies priority activities and assignments; adjusts priorities as required. Allocates appropriate amount of time and resource for completing work. Creativity Promotes and persuades others to consider new ideas. Takes an interest in new ideas and new ways of doing things. Not bound by current thinking or traditional approaches. Qualification Requirements Required Skills and Experience Be enrolled in the final academic year or graduated of/from a degree programme (minimum Bachelor’s or equivalent) in Economics, Business Administration, International Business, and Development Studies. Ability to analyze economic data and draw meaningful conclusions. Proficiency in conducting research using various sources and methodologies. Strong written and verbal communication skills, including the ability to present findings effectively. Familiarity with Microsoft Word, Excel, PowerPoint, and other relevant software. Fluency in English and Bengali is required. Prior work experience is not mandatory. Application Procedure The application should contain: Brief Cover Letter (in English) stating interest in and qualifications for the post. Current and complete CV in English. Please group all your documents into one (1) single PDF document as the system only allows to upload a maximum of one document. Candidates Who Are Selected Must Submit The Following Documents Official letter from the University confirming enrollment in a graduate-level degree programme. Proof of medical and life/accident insurance valid for the location in which the internship will be carried out. Selected interns must have medical and life insurance. UNDP only accepts interns for a minimum of 6 weeks and a maximum of 6 months. Working Arrangements Interns may be given a stipend according to UNDP Internship Policy, if it is not financially supported by any institution or programme, such as a university, government foundation or scholarship programme. A stipend intended to help cover basic daily expenses related to the internship, such as meals and transportation at the duty station. The stipend will be paid on a monthly basis and part-time internship arrangements are prorated accordingly. Interns are responsible for securing adequate medical insurance for the duration of the internship. UNDP accepts no responsibility for costs arising from accidents and/or illness or death incurred during the internship. Interns must provide proof of enrollment in health insurance plan. Interns are expected to work full time, but flexibility is allowed for education programmes. The intern is responsible for obtaining necessary visas and arranging travel to and from the duty station where the internship will be performed. Interns are not eligible to apply for, or be appointed to, any post in UNDP during the period of the internship. Interns are not staff members and may not represent UNDP in any official capacity. The purpose of the internship is not to lead to further employment with UNDP, but to complement an intern’s studies. Therefore, there should be no expectation of employment at the end of an internship. The intern will be evaluated at the end of the contract. Disclaimer Important information for US Permanent Residents ('Green Card' holders) Under US immigration law, acceptance of a staff position with UNDP, an international organization, may have significant implications for US Permanent Residents. UNDP advises applicants for all professional level posts that they must relinquish their US Permanent Resident status and accept a G-4 visa, or have submitted a valid application for US citizenship prior to commencement of employment. UNDP is not in a position to provide advice or assistance on applying for US citizenship and therefore applicants are advised to seek the advice of competent immigration lawyers regarding any applications. Applicant Information About UNDP Rosters Note: UNDP reserves the right to select one or more candidates from this vacancy announcement. We may also retain applications and consider candidates applying to this post for other similar positions with UNDP at the same grade level and with similar job description, experience and educational requirements. Non-discrimination UNDP has a zero-tolerance policy towards sexual exploitation and misconduct, sexual harassment, and abuse of authority. All selected candidates will, therefore, undergo rigorous reference and background checks, and will be expected to adhere to these standards and principles. UNDP is an equal opportunity and inclusive employer that does not discriminate based on race, sex, gender identity, religion, nationality, ethnic origin, sexual orientation, disability, pregnancy, age, language, social origin or other status. Scam warning The United Nations does not charge any application, processing, training, interviewing, testing or other fee in connection with the application or recruitment process. Should you receive a solicitation for the payment of a fee, please disregard it. Furthermore, please note that emblems, logos, names and addresses are easily copied and reproduced. Therefore, you are advised to apply particular care when submitting personal information on the web. Note: UNDP is committed to achieving workforce diversity in terms of gender, ethnicity and culture. Individuals from minority groups, indigenous groups and people living with disabilities are equally encouraged to apply. All applications will be treated with the strictest confidence.", "platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "job_link": "https://www.linkedin.com/jobs//jobs/view/4112588694/?alternateChannel=search&refId=CtNXeCHvxGS3hoB5ppAYbA%3D%3D&trackingId=fo%2BU5b3h0bOydXoMIgPxXw%3D%3D&trk=d_flagship3_search_srp_jobs"}, {"company": "i2e Consulting", "company_link": "https://www.linkedin.com/company/i2e-consulting/life", "job_title": "Graphic Design Intern", "job_href": "/jobs/view/4111812632/?alternateChannel=search&refId=CtNXeCHvxGS3hoB5ppAYbA%3D%3D&trackingId=I05bTcjBn3Le1cPkVW8Nng%3D%3D&trk=d_flagship3_search_srp_jobs", "location": "Bengaluru East, Karnataka, India", "posted_on": "2 days ago as per the 2025-01-01 09:50:51", "applicant": "26 applicants", "job_type": "Not Found", "experience_level": "Not Found", "job_description": "About the job Skills: Adobe Creative Suite, Typography, Color Theory, Layout Design, Visual Communication, Illustration, Photo Editing, Microsoft Office Suite, Company Overview I2E Consulting Pvt Ltd, a Microsoft gold partner and a Great Place to Work certified company, was recognized as one of the fastest-growing companies in the US in 2018 by Inc 5000. With a strong presence in the Life Sciences domain, we cater to notable clients such as Pfizer, Merck, and others. Our focus on cutting-edge technologies and work-life balance makes us an ideal place to advance your career. Job Overview We are seeking a Graphic Design Intern to join our team at I2E Consulting Pvt Ltd. This is an excellent opportunity for a fresher looking to apply their design skills in a professional environment. The position is remote. This internship will provide you with hands-on experience in the IT Services and IT Consulting industry. Qualifications And Skills Adobe Creative Suite including Photoshop, Illustrator, and InDesign to create visually compelling graphics. Strong grasp of color theory to create aesthetically pleasing and effective color schemes in design work. Ability to communicate visually, translating complex ideas into clear and engaging graphical content. Familiarity with Microsoft Office Suite to create supporting documents and presentations as needed. Roles And Responsibilities Collaborate with the design and marketing teams to produce engaging and on-brand graphics for a variety of media. Assist in the design and development of digital and print materials, ensuring visual consistency and brand alignment. Support the creation of visual content for social media platforms, enhancing our digital presence and engagement. Desired Skills and Experience Adobe Creative Suite, Typography, Color Theory, Layout Design, Visual Communication, Illustration, Photo Editing, Microsoft Office Suite", "platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "job_link": "https://www.linkedin.com/jobs//jobs/view/4111812632/?alternateChannel=search&refId=CtNXeCHvxGS3hoB5ppAYbA%3D%3D&trackingId=I05bTcjBn3Le1cPkVW8Nng%3D%3D&trk=d_flagship3_search_srp_jobs"}, {"company": "Axpo Group", "company_link": "https://www.linkedin.com/company/axpo-group/life", "job_title": "Intern Data Science (f/m/d)", "job_href": "/jobs/view/4098191238/?alternateChannel=search&refId=CtNXeCHvxGS3hoB5ppAYbA%3D%3D&trackingId=04p4UVIB7ZBvYFoG1QPzKw%3D%3D&trk=d_flagship3_search_srp_jobs", "location": "Baden, Aargau, Switzerland", "posted_on": "2 weeks ago as per the 2025-01-01 09:50:57", "applicant": "Over 100 applicants", "job_type": "Not Found", "experience_level": "Not Found", "job_description": "About the job Workload: 100% Dive into the world of data-driven innovation with Axpo! As a Data Science Intern, you'll play a key role in analyzing markets and developing advanced solutions. This is your chance to gain hands-on experience and make an impact in the energy sector. What you will do: Conduct exploratory data analysis to uncover insights. Develop benchmarking frameworks and operationalize data pipelines. Create detailed reports and participate in code reviews. Contribute to the analysis of ancillary service markets. What you bring & who you are: A bachelor’s degree in a quantitative field. Proficiency in Python, data analysis, and strong analytical thinking. Knowledge of energy markets is a plus. Collaborative mindset, effective communication skills, curiosity, and resilience. Fluency in English (German is a plus). About the team: Join a passionate team focused on innovation and collaboration. Together, we explore cutting-edge solutions and tackle challenges to drive success in a dynamic, supportive environment.", "platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "job_link": "https://www.linkedin.com/jobs//jobs/view/4098191238/?alternateChannel=search&refId=CtNXeCHvxGS3hoB5ppAYbA%3D%3D&trackingId=04p4UVIB7ZBvYFoG1QPzKw%3D%3D&trk=d_flagship3_search_srp_jobs"}, {"company": "Refonte Learning", "company_link": "https://www.linkedin.com/company/refonte-learning/life", "job_title": "Data Science Intern", "job_href": "/jobs/view/4105579341/?alternateChannel=search&refId=CtNXeCHvxGS3hoB5ppAYbA%3D%3D&trackingId=QgAnrJoGF64DCovejtSnjQ%3D%3D&trk=d_flagship3_search_srp_jobs", "location": "Dubai, United Arab Emirates", "posted_on": "1 week ago as per the 2025-01-01 09:51:01", "applicant": "Over 100 applicants", "job_type": "Not Found", "experience_level": "Not Found", "job_description": "About the job Launch Your Career in AI, Data Science, and Cloud Computing with Refonte AI! Position: AI, Data Science, DevOps, and Cloud Internship About Refonte AI Refonte AI is a global leader in IT and Ed-Tech, renowned for delivering exceptional solutions in Artificial Intelligence (AI), Data Science, Digital Marketing, UI/UX Design, Web Development, and App Development. We are committed to fostering innovation, excellence, and the growth of talent across the globe. Discover More: https://refontelearning.com Why Choose This Internship? Are you passionate about the latest technology trends and eager to gain hands-on experience in AI, Data Science, DevOps, and Cloud Computing? Our internship program offers the chance to work on high-impact projects, learn from industry experts, and build a foundation for a successful career. If you are enthusiastic about technology and excited to learn, we encourage you to apply and join our team. Program Overview Refonte is inviting proactive individuals to join our highly respected AI & Data Science Study and Internship Program. As part of RIGTIP (Refonte Infini Global Training & Internship Program), you will gain comprehensive skills, from beginner to advanced, in AI and Data Science, collaborating with our global team across Oceania, Asia, Europe, and the Americas. What You’ll Gain: This role provides hands-on experience in AI, Data Science, DevOps, and Cloud Technology, where you’ll: Engage in real-world projects that drive innovative solutions. Learn and apply cutting-edge technology in a supportive team environment. Enhance your technical skills and industry knowledge through hands-on practice and collaboration. Key Responsibilities: Collaborate with cross-functional teams to design, deploy, and maintain AI solutions. Collect, clean, and analyze data from various sources to develop actionable insights. Develop and maintain scalable data pipelines for AI model training and deployment. Use DevOps practices to integrate machine learning models into production systems. Optimize CI/CD pipelines for streamlined deployment of AI applications on cloud platforms. Set up and manage cloud infrastructure with platforms like AWS, Azure, or Google Cloud. Work closely with data scientists and engineers to translate business goals into technical solutions. Conduct research on the latest tools in AI, Data Science, DevOps, and Cloud, ensuring projects stay at the cutting edge. Document workflows to facilitate knowledge sharing and reinforce best practices across the team. Exciting Projects You’ll Be Part Of: Multi-Cloud AI Infrastructure: Configure, automate, and deploy AI solutions across multiple cloud platforms. Full-Stack AI DevOps: Apply DevOps practices in end-to-end AI development. Generative AI & Large Language Models: Transform diverse inputs—text, images, audio, and video—into various outputs. Fraud Detection in Finance: Develop advanced algorithms for detecting financial fraud. Recommendation Systems: Build recommendation engines to enhance user experiences. Sentiment Analysis: Analyze text data to understand user sentiment and improve user engagement. Chatbot Development: Create intelligent chatbots to enhance customer interactions. Multimedia Classification: Engage in projects involving classification of images, audio, and video. Text Analysis: Use sophisticated techniques to reveal insights and patterns within textual data. Ideal Candidate Qualifications: Currently pursuing a degree and committed to professional growth in tech. Excellent communication skills for effective collaboration and conveying complex ideas. Demonstrated ability to work independently and as part of a team, with a focus on adaptability and teamwork. Why Join Refonte AI? Gain hands-on experience with in-demand skills in AI, Data Science, DevOps, and Cloud Computing. Work on impactful projects that make a difference, while building a professional network in a global setting. Learn in a dynamic, fast-paced environment that values innovation and continuous learning. Discover More: https://refontelearning.com Location: Remote – Dubai, United Arab Emirates Additional Information: This position is part of our unpaid AI & Data Science Study and Internship Program. Our team will guide you through the application and onboarding process upon acceptance. Thank you for considering Refonte Infini as your professional development partner. We look forward to welcoming you to our innovative, forward-thinking team!", "platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "job_link": "https://www.linkedin.com/jobs//jobs/view/4105579341/?alternateChannel=search&refId=CtNXeCHvxGS3hoB5ppAYbA%3D%3D&trackingId=QgAnrJoGF64DCovejtSnjQ%3D%3D&trk=d_flagship3_search_srp_jobs"}]