[{"page_1": [{"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Tetra Pak", "company_link": "https://www.linkedin.com/company/tetra-pak/life", "job_title": "Technical Service Intern", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:24:54", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4106485862/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=cNauA%2Ft%2FZE2fQJPI81jqjg%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job At Tetra Pak we commit to making food safe and available, everywhere; and we protect what's good – protecting food, protecting people, and protecting the planet. By doing so we touch millions of people's lives every day. And we need people like you to make it happen. We empower you to reach your potential with opportunities to make an impact to be proud of – for food, people and the planet. Job Summary We are looking for a Intern with a responsibility of providing a wide range of support to Services Department, which may include providing support to different projects in collaboration with Services Sales Team as well as administrative support. This position is based in Lahore, Pakistan. What You Will Do Supporting the Services Team with developing business cases for customers. Contribute to the Services upgrades category by supporting ongoing inquiries and projects Other tasks assigned from line-manager on need basis We believe you have Bachelor’s in engineering from a well reputed university Thorough and high attention to detail Ability to work well within a team. Good verbal and written communication skills Strong interpersonal skills We Offer You A variety of exciting challenges with ample opportunities for development and training in a truly global landscape A culture that pioneers a spirit of innovation where our industry experts drive visible results An equal opportunity employment experience that values diversity and inclusion Market competitive compensation and benefits with flexible working arrangements Apply Now If you are inspired to be part of our promise to protect what’s good; for food, people, and the planet, apply through our careers page at https://jobs.tetrapak.com/. This job posting expires on 3rd January 2025. If you have any questions about your application, please contact Fizza Ikram. Diversity, equity, and inclusion is an everyday part of how we work. We give people a place to belong and support to thrive, an environment where everyone can be comfortable being themselves and has equal opportunities to grow and succeed. We embrace difference, celebrate people for who they are, and for the diversity they bring that helps us better understand and connect with our customers and communities worldwide."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Bharat Business Innovations Pvt Ltd", "company_link": "https://www.linkedin.com/company/bharat-business-innovations-pvt-ltd/life", "job_title": "Trainee/Intern (Remote)", "location": "Not Found", "posted_on": "1 day ago as per the 2024-12-31 10:24:59", "applicant": "5 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4111802012/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=USuL0Dpp%2FzS23Qk3WB1VSA%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Skills: Communication Skills, Time Management, Problem Solving, Adaptability, Teamwork, Attention to Detail, Learning Agility, Tech Savvy, Job Title: Trainee/Intern (Remote) Location: Remote Employment Type: Internship (Full-time/Part-time) Duration: 3 or 6 months About Us We are a dynamic and innovative startup ([Insert brief company description]). We are looking for passionate individuals eager to kickstart their careers with hands-on learning in a collaborative remote environment. Key Responsibilities Learning & Development: Actively participate in training sessions and gain proficiency in tools and processes relevant to the role. Complete assigned learning modules within set deadlines. Task Execution: Assist with day-to-day operations specific to your role/department. Work on assigned projects under the guidance of senior team members. Collaboration: Coordinate with various teams to understand cross-functional workflows. Provide input or feedback to improve existing processes. Reporting: Maintain logs, records, and task updates regularly. Report progress to your mentor/manager periodically. Support: Address ad hoc requests or tasks from your mentor/manager. Troubleshoot minor challenges and escalate larger issues when needed. Preferred Qualifications Currently pursuing or recently completed a Bachelor's in Business, IT, Marketing, etc Basic knowledge of [Lead Generations, LinkedIn knowledge]. Strong communication skills (written and verbal). Eagerness to learn and a proactive attitude. Skills & Competencies Ability to work independently and remotely with minimal supervision. Time management and organizational skills. Familiarity with remote collaboration tools (e.g., Zoom, Slack, Google Workspace). What We Offer Flexible working hours. Mentorship and hands-on learning opportunities. A certificate of completion and recommendation (based on performance). Potential for a full-time role upon successful completion of the internship. How To Apply Submit your updated resume along with a cover letter explaining why you're interested in this role. Desired Skills and Experience Communication Skills, Time Management, Problem Solving, Adaptability, Teamwork, Attention to Detail, Learning Agility, Tech Savvy"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Alstom", "company_link": "https://www.linkedin.com/company/alstom/life", "job_title": "Maintenance Engineer Intern 2", "location": "Not Found", "posted_on": "4 days ago as per the 2024-12-31 10:25:02", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4109625119/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=qVdhZnQl%2FnZn6v1MjUAHGw%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job At Alstom, we understand transport networks and what moves people. From high-speed trains, metros, monorails, and trams, to turnkey systems, services, infrastructure, signalling and digital mobility, we offer our diverse customers the broadest portfolio in the industry. Every day, 80,000 colleagues lead the way to greener and smarter mobility worldwide, connecting cities as we reduce carbon and replace cars. Could you be the full-time RST/DEQ Maintenance Engineer in Saudi Arabia we’re looking for? Your future role Take on a new challenge and apply your Engineering expertise in a new cutting-edge field. You’ll be work alongside passionate, motivated and dedicated teammates. You'll contribute . Day-to-day, you’ll work closely with teams across the Operation & Maintanence of the Riyadh Metro Project. You’ll specifically take care of Process & Tools for Rolling Stock & Depot Equiment, but is not limited to the below. We’ll look to you for: Maintain and keep updated the list of deliverables for the production of corrective and preventive maintenance documentation Support operations during the review and update of the maintenance corrective and preventive maintenance documentation Participate in defining the Obsolescence management plan for the components at risk of going obsolete during the contract period Analyse reccurent failures and propose solutions. Conduct field technical survey and monitoring in order to enhance O&M overall performance. Conduct trial and validate performance and effectiveness of new products, modification or change. Propose changes to the D&B manuals to optimize the maintenance activities during the maintenance execution All About You We value passion and attitude over experience. That’s why we don’t expect you to have every single skill. Instead, we’ve listed some that we think will help you succeed and grow in this role: University Degree in Engineering Experience related to the maintenance of Rolling Stock & Depot Equipment Technical knowledge and understanding of rolling stock maintenance and design Effective investigatory skills into technical investigations Highly self-motivated individual, able to work under your own initiative Fluent in English Knowledge of the rail environment and engineering practices Good co-ordination and communication Things you’ll enjoy Join us on a life-long transformative journey – the rail industry is here to stay, so you can grow and develop new skills and experiences throughout your career. You’ll also: Enjoy stability, challenges and a long-term career free from boring daily routines Collaborate with transverse teams and helpful colleagues Contribute to innovative projects Steer your career in whatever direction you choose across functions and countries Benefit from our investment in your development, through award-winning learning You don’t need to be a train enthusiast to thrive with us. We guarantee that when you step onto one of our trains with your friends or family, you’ll be proud. If you’re up for the challenge, we’d love to hear from you! As a global business, we’re an equal-opportunity employer that celebrates diversity across the 70+ countries we operate in. We’re committed to creating an inclusive workplace for everyone."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "SGS", "company_link": "https://www.linkedin.com/company/sgs/life", "job_title": "Health and Safety Intern", "location": "Not Found", "posted_on": "2 weeks ago as per the 2024-12-31 10:25:06", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4096059369/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=G71j9l%2FEQFV%2FQb1SJkMhUA%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Company Description SGS is the world’s leading inspection, verification, testing and certification company. SGS is recognized as the global benchmark for quality and integrity. With more than 97,000 employees, SGS operates a network of over 2,600 offices and laboratories around the world. Job Description Provide timeous reporting Adhere to all quality management systems Must be able to work at Somerset West ( Cape Town) Assist in preparation of audits Adhere to all necessary HSE standards Perform any other reasonable tasks as assigned by direct line manager Qualifications Safety Management and/or SAMTRAC Grade 12 / Matric Must be currently unemployed Additional Information Be a South African citizen (be able to produce a valid South African ID document) Be between the ages of 18-30 Must be currently unemployed Must have no criminal record Must be willing to relocate to Somerset West(Cape Town) Exceptional Computer Literacy (use of MS Office suite – Outlook, Word, Excel, PowerPoint) An affinity for data analysis Strong research skills High attention to detail, accuracy, and efficiency in completing tasks. Exceptional organizational skills Self-motivated and high level of initiative NB: If you do not receive any response in 2 weeks consider your application unsuccessful."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Corsair", "company_link": "https://www.linkedin.com/company/corsair/life", "job_title": "Electrical Engineer Intern", "location": "Not Found", "posted_on": "6 days ago as per the 2024-12-31 10:25:11", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4108994742/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=gPgPJMl4a4p5h5WoeqCJmw%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job You Will JOB DESCRIPTION Learn how to test a concept. Develop debug skills in labs Evaluation of product performance Learn to write test documents and process Organize and plan development work You Are Curious about how things are made Find problems/issues with everyday items Interested in building products Interested in gaming or an avid gamer Self motivated and organized Qualifications Must be at least 18+ years of age Must be enrolled as a full-time student in any accredited institution Pursuing an Associate's, Bachelor's, Master's, or Doctorate Degree, and returning for at least a final term following the internship All Interns must be able to commit to one of the two cohort tracks that span 12-weeks CORSAIR (NASDAQ: CRSR) is a leading global developer and manufacturer of high-performance gear and technology for gamers, content creators, and PC enthusiasts. From award-winning PC components and peripherals, to premium streaming equipment and smart ambient lighting, CORSAIR delivers a full ecosystem of products that work together to enable everyone, from casual gamers to committed professionals, to perform at their very best. CORSAIR also includes subsidiary brands Elgato, which provides premium studio equipment and accessories for content creators, SCUF Gaming, which builds custom-designed controllers for competitive gamers, and ORIGIN PC, a builder of custom gaming and workstation desktop PCs and laptops We will have two cohort tracks that you may choose from that span a 12-week period: COHO1 – May 21 st , 2025 – August 8 th , 2025 COHO2 – June 17 th , 2025 – September 5 th , 2025 Internship Requirements You are actively enrolled as a full-time student in an accredited institution and have completed at least one year of education. You are pursuing either an Associate’s, Bachelor’s, Master’s, or Doctorate Degree, and returning for at least a final term following the summer internship. You are able to fully commit to one of the two 12-week (40 hours per week) internship cohort tracks. You must be at least 18+ years of age at the start of the internship. We have many intern openings in a variety of departments, check them all out to see which suits your interests and professional development the best at corsair.com/careers. For roles that are based at our headquarters in Milpitas, CA: The starting base pay for this position is as shown below. The actual base pay is dependent upon a variety of job-related factors such as professional background, training, work experience, location, business needs and market demand. Therefore, in some circumstances, the actual salary could fall outside of this expected range. This pay range is subject to change and may be modified in the future. Hourly pay range $25"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Western Digital", "company_link": "https://www.linkedin.com/company/western-digital/life", "job_title": "Intern - Technician Assistant (Maintenance)", "location": "Not Found", "posted_on": "5 days ago as per the 2024-12-31 10:25:16", "applicant": "1 applicant", "job_link": "https://www.linkedin.com/jobs//jobs/view/4109580894/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=knjWwFxAARbCbXCTIuRmeA%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Company Description At Western Digital, our vision is to power global innovation and push the boundaries of technology to make what you thought was once impossible, possible. At our core, Western Digital is a company of problem solvers. People achieve extraordinary things given the right technology. For decades, we’ve been doing just that. Our technology helped people put a man on the moon. We are a key partner to some of the largest and highest growth organizations in the world. From energizing the most competitive gaming platforms, to enabling systems to make cities safer and cars smarter and more connected, to powering the data centers behind many of the world’s biggest companies and public cloud, Western Digital is fueling a brighter, smarter future. Binge-watch any shows, use social media or shop online lately? You’ll find Western Digital supporting the storage infrastructure behind many of these platforms. And, that flash memory card that captures and preserves your most precious moments? That’s us, too. We offer an expansive portfolio of technologies, storage devices and platforms for business and consumers alike. Our data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk® and WD® brands. Today’s exceptional challenges require your unique skills. It’s You & Western Digital. Together, we’re the next BIG thing in data. Job Description ESSENTIAL DUTIES AND RESPONSIBILITIES: Support performs technical support activities related to operation approaches to achieve the organization's goal Support performance report and perform related work as assigned Support Check machine according to assigned check sheet Support daily/weekly checks of tooling and equipment for production Support Maintains machines and per with corrective procedures and technical guidance หน้าที่ และความรับผิดชอบ: ช่วงเวลาเริ่มเข้าฝึกงาน:  พฤษภาคม 2568 ฝึกทักษะงานกิจกรรมช่าง ที่เกี่ยวข้องกับแนวทางการดําเนินงาน เพื่อให้บรรลุเป้าหมายขององค์กร ฝึกทักษะการสนับสนุน จัดทำรายงานผลการดําเนินงานที่เกี่ยวข้องกับการปฏิบัติงานตามที่ได้รับมอบหมาย ฝึกทักษะการสนับสนุนตรวจสอบเครื่องจักรตามเอกสารกำหนด ฝึกทักษะการสนับสนุนการตรวจสอบเครื่องจักรการผลิต รายวัน/รายสัปดาห์ ฝึกทักษะงานบํารุงรักษา การแก้ไขเครื่องจักร และแนะนําขั้นตอนทางเทคนิค Qualifications REQUIRED: Pursuing a High Vocational in Electronics Knowledge in electronic power or a related field Skills Skills in computer techniques Skills in Microsoft Office applications Basic English communication คุณสมบัติ: กำลังศึกษาอยู่ระดับประกาศนียบัตรวิชาชีพชั้นสูง (ปวส.) สาขาอิเล็กทรอนิกส์ ความรู้ด้านไฟฟ้า อิเล็กทรอนิกส์หรือสาขาที่เกี่ยวข้อง มีทักษะเทคนิคการใช้งานคอมพิวเตอร์ เช่น การใช้งานMicrosoft Office การสื่อสารภาษาอังกฤษขั้นพื้นฐาน Additional Information Western Digital thrives on the power and potential of diversity. As a global company, we believe the most effective way to embrace the diversity of our customers and communities is to mirror it from within. We believe the fusion of various perspectives results in the best outcomes for our employees, our company, our customers, and the world around us. We are committed to an inclusive environment where every individual can thrive through a sense of belonging, respect and contribution. Western Digital is committed to offering opportunities to applicants with disabilities and ensuring all candidates can successfully navigate our careers website and our hiring process. Please contact us at jobs.accommodations@wdc.com to advise us of your accommodation request. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Refonte Learning", "company_link": "https://www.linkedin.com/company/refonte-learning/life", "job_title": "Data Science Intern", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:25:19", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4105579341/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=n%2BxS9I%2BM1em4qBD8nAvYyw%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Launch Your Career in AI, Data Science, and Cloud Computing with Refonte AI! Position: AI, Data Science, DevOps, and Cloud Internship About Refonte AI Refonte AI is a global leader in IT and Ed-Tech, renowned for delivering exceptional solutions in Artificial Intelligence (AI), Data Science, Digital Marketing, UI/UX Design, Web Development, and App Development. We are committed to fostering innovation, excellence, and the growth of talent across the globe. Discover More: https://refontelearning.com Why Choose This Internship? Are you passionate about the latest technology trends and eager to gain hands-on experience in AI, Data Science, DevOps, and Cloud Computing? Our internship program offers the chance to work on high-impact projects, learn from industry experts, and build a foundation for a successful career. If you are enthusiastic about technology and excited to learn, we encourage you to apply and join our team. Program Overview Refonte is inviting proactive individuals to join our highly respected AI & Data Science Study and Internship Program. As part of RIGTIP (Refonte Infini Global Training & Internship Program), you will gain comprehensive skills, from beginner to advanced, in AI and Data Science, collaborating with our global team across Oceania, Asia, Europe, and the Americas. What You’ll Gain: This role provides hands-on experience in AI, Data Science, DevOps, and Cloud Technology, where you’ll: Engage in real-world projects that drive innovative solutions. Learn and apply cutting-edge technology in a supportive team environment. Enhance your technical skills and industry knowledge through hands-on practice and collaboration. Key Responsibilities: Collaborate with cross-functional teams to design, deploy, and maintain AI solutions. Collect, clean, and analyze data from various sources to develop actionable insights. Develop and maintain scalable data pipelines for AI model training and deployment. Use DevOps practices to integrate machine learning models into production systems. Optimize CI/CD pipelines for streamlined deployment of AI applications on cloud platforms. Set up and manage cloud infrastructure with platforms like AWS, Azure, or Google Cloud. Work closely with data scientists and engineers to translate business goals into technical solutions. Conduct research on the latest tools in AI, Data Science, DevOps, and Cloud, ensuring projects stay at the cutting edge. Document workflows to facilitate knowledge sharing and reinforce best practices across the team. Exciting Projects You’ll Be Part Of: Multi-Cloud AI Infrastructure: Configure, automate, and deploy AI solutions across multiple cloud platforms. Full-Stack AI DevOps: Apply DevOps practices in end-to-end AI development. Generative AI & Large Language Models: Transform diverse inputs—text, images, audio, and video—into various outputs. Fraud Detection in Finance: Develop advanced algorithms for detecting financial fraud. Recommendation Systems: Build recommendation engines to enhance user experiences. Sentiment Analysis: Analyze text data to understand user sentiment and improve user engagement. Chatbot Development: Create intelligent chatbots to enhance customer interactions. Multimedia Classification: Engage in projects involving classification of images, audio, and video. Text Analysis: Use sophisticated techniques to reveal insights and patterns within textual data. Ideal Candidate Qualifications: Currently pursuing a degree and committed to professional growth in tech. Excellent communication skills for effective collaboration and conveying complex ideas. Demonstrated ability to work independently and as part of a team, with a focus on adaptability and teamwork. Why Join Refonte AI? Gain hands-on experience with in-demand skills in AI, Data Science, DevOps, and Cloud Computing. Work on impactful projects that make a difference, while building a professional network in a global setting. Learn in a dynamic, fast-paced environment that values innovation and continuous learning. Discover More: https://refontelearning.com Location: Remote – Dubai, United Arab Emirates Additional Information: This position is part of our unpaid AI & Data Science Study and Internship Program. Our team will guide you through the application and onboarding process upon acceptance. Thank you for considering Refonte Infini as your professional development partner. We look forward to welcoming you to our innovative, forward-thinking team!"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Kreativstorm", "company_link": "https://www.linkedin.com/company/kreativstorm/life", "job_title": "Software Engineer - Intern (Remote Internship - IT)", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:25:23", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4105794212/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=dclxVrbJ9MRDFXJsTyND%2Bw%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Embark on an exciting journey into software engineering with an exclusive internship opportunity offered by Kreativstorm, a dynamic and innovative management-consulting firm based in Berlin, Germany. Work remotely with our multinational team and advance your career in software engineering! If you're passionate about software development and have strong problem-solving skills, this internship is perfect for you. Under the mentorship of industry experts, you'll work on diverse software engineering projects, exploring concepts like system design, algorithm development, coding, and debugging. Gain hands-on experience in building robust and scalable software solutions, all from the comfort of your home. Internship Overview and Details: Location: Fully Remote Schedule: Part-Time Internship Duration: 3 months with the possibility of permanent employment after the internship period Requirements Ideal Candidates: Students pursuing a degree or recent graduates in Computer Science, Information Technology, or a related field. Aspiring software engineers with a strong interest in software development. Analytical thinkers adept at solving complex programming challenges. Effective communicators who thrive in collaborative team environments. Detail-oriented individuals excelling in fast-paced, technical settings. Enthusiastic learners committed to refining their software engineering skills. Proficiency in programming languages such as Java, C++, Python, or JavaScript is highly valued. Familiarity with software development lifecycle and best practices advantageous. Some initial industry experience is a big plus. Your Role: Contribute to software engineering projects, writing clean and efficient code. Collaborate with the development team to design and implement software solutions. Assist in debugging, testing, and optimizing software applications. Bring innovative solutions to software development challenges. Foster a collaborative team environment focused on excellence in software engineering. Support in documenting and presenting software design and solutions. Benefits Why Join Us? Kreativstorm is a dynamic and innovative management-consulting firm headquartered in Berlin, Germany. Our team of experienced consultants brings a diverse range of talents and backgrounds, allowing us to provide tailored solutions to businesses of all sizes and industries. As part of the Yes Network Group, LLC, a reputable US holding company, we have access to extensive resources and expertise. Join us and start your journey in software engineering today! Apply now and pave the way for your future in software engineering!"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Innophos", "company_link": "https://www.linkedin.com/company/innophos/life", "job_title": "Process/Production Engineer Intern - Summer 2025", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:25:26", "applicant": "77 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4103545511/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=W5hqHPrKbiUv7GQvWopaRw%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job As an Intern or Co-op student in this role, you will gain hands-on experience in a dynamic manufacturing environment, contributing to various stages of the production process. You will have the opportunity to work on real-world projects that focus on process troubleshooting, optimization, root cause analysis, and safety improvements. In addition to technical learning, you will develop project management skills and learn how to meet deadlines while collaborating with cross-functional teams. This position provides an excellent opportunity to grow your knowledge of process chemistry, operational safety, and quality assurance in a manufacturing setting. Key Responsibilities Plant Safety Learning/documenting processes Learn about SPC and variation Process optimization techniques Learn lab test methods/procedures Compile a presentation for completed projects and present to management Required Education Completion of sophomore college year in Chemical Engineering or Mechanical Engineering Required Knowledge, Skills And Abilities Proficiency in Microsoft Office (Word, Excel, PowerPoint); familiarity with MS Access is a plus. Basic understanding of chemistry and hands-on experience in a lab setting. Strong ability to work effectively in teams and collaborate with various departments. Demonstrated leadership potential and a proactive approach to problem-solving. Assignment Duration Intern:8-12 weeks Compensation & Benefits Market-competitive hourly rate. Overtime eligible. Paid holidays (observed). Please note that this position does not offer housing, health, welfare, or vacation benefits. Expectations Punctual and regular attendance throughout the internship/co-op term. Adherence to all site policies and training requirements. Active participation in Intern/Co-op events and activities hosted by the company. Deliver a final presentation summarizing key learnings and contributions during your internship/co-op. About Innophos Innophos is a leading international producer of specialty ingredient solutions that deliver far-reaching, versatile benefits for the food, health, nutrition and industrial markets. We leverage our expertise in the science and technology of blending and formulating phosphate, mineral and botanical based ingredients for our customers. Our people are the heart of our organization and the foundation of our success. We are driven by our core values of safety, diversity, integrity and collaboration. Headquartered in Cranbury, New Jersey, Innophos has manufacturing operations across the United States, in Canada, Mexico and China and sells into over 70 countries. Innophos is proud to be an Equal Opportunity employer, seeking to create a welcoming and diverse environment. We do not discriminate based on race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state, and local law. Innophos is committed to providing reasonable accommodations for candidates in our recruiting process, as required by applicable federal, state and local laws."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Wissen Technology", "company_link": "https://www.linkedin.com/company/wissen-technology/life", "job_title": "Talent Acquisition Intern", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:25:31", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4104052831/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=wcFii1TQYw0JtT5hQvH15g%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job We are looking for a motivated and detail-oriented Talent Acquisition Intern to join our HR team. In this role, you will assist in sourcing, screening, and engaging with potential candidates to support the recruitment process. This internship offers hands-on experience in talent acquisition and an opportunity to gain valuable insights into the hiring process within a dynamic work environment. Key Responsibilities - Sourcing and Screening - Assist in identifying potential candidates through job boards, LinkedIn, and other sourcing channels. - Review resumes and applications to shortlist qualified candidates for various roles. - Coordinate and schedule interviews between candidates and hiring managers. - Communicate interview details and provide necessary follow-ups to candidates. - Candidate Engagement & Update and maintain candidate records in the Applicant Tracking System (ATS). - Ensure all recruitment data is accurate and up to date. - Assist in creating job postings and promoting open roles on various platforms. - Contribute to recruitment campaigns and initiatives to attract top talent. RequirementsQualifications and Skills Education: Currently pursuing or recently completed UG/PG course from 2023/2024 batch. Technical Skills: Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint). Familiarity with ATS tools or job boards (preferred but not mandatory). Soft Skills: Strong communication and interpersonal skills. Attention to detail and ability to multitask in a fast-paced environment. Proactive and willing to learn new processes. BenefitsBenefits- Paid Internship Desired Skills and Experience Qualifications and Skills Education: Currently pursuing or recently completed UG/PG course from 2023/2024 batch. Technical Skills: Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint). Familiarity with ATS tools or job boards (preferred but not mandatory). Soft Skills: Strong communication and interpersonal skills. Attention to detail and ability to multitask in a fast-paced environment. Proactive and willing to learn new processes."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Abbott", "company_link": "https://www.linkedin.com/company/abbott-/life", "job_title": "Intern Warehouse Improvement", "location": "Not Found", "posted_on": "3 days ago as per the 2024-12-31 10:25:35", "applicant": "25 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4111200394/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=aDpZK5552IJrTHvXnobqfw%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job About Abbott At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 135 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, more than 114,000 of us are working to help people live not just longer, but better, in the more than 160 countries we serve. MAIN PURPOSE OF ROLE Performs entry-level professional business support/administrative work, gradually increasing in level of difficulty and responsibility as on-the-job/formal training is received. Main Responsibilities Performs a variety of entry-level duties and assists higher-level personnel in research and analysis related to areas such as administrative regulations, policies, processes, procedures, systems, methods, reports, and forms, while learning the fundamental structure, and operations associated with an administrative office in administrative services, academic affairs, or student services. Participates in analytic studies by conducting routine research, identifying samples, assembling and compiling data in well-defined areas related to administrative regulations, policies, procedures, systems, methods, reports, and forms. Applies basic statistical analysis techniques or, with detailed instructions, more advanced statistical techniques in analyzing data. Assists in writing instructions, procedures, and manuals to describe and improve administrative, technology, and operational methods and systems. Assists in providing technical support and training to departmental staff on business, technology, and operational activities. Fully utilizes the capabilities and functions of standard office software applications such as data management, spreadsheet, presentation, and word processing in completing assigned projects. Prepares reports, presentations, operational documents and correspondence containing descriptive, analytical, and evaluative content related to business and operational activities subject to review and editing by higher-level staff members. What can we offer you? Abbott provides a varied, challenging, and international position in a dynamic and pleasant working environment. In our organization, you can count on excellent primary and secondary benefits, a positive working atmosphere, a personal growth plan, extensive training opportunities, and a good career perspective. We are in the business of advancement, both in health solutions and in the lives and careers of our employees. Our work across the world and in many areas of healthcare provides a rich environment for our employees to explore career paths, interests, and opportunities."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Dott", "company_link": "https://www.linkedin.com/company/ridedott/life", "job_title": "Mechanical Engineer Intern - m/f/d", "location": "Not Found", "posted_on": "2 days ago as per the 2024-12-31 10:25:39", "applicant": "32 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4111779327/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=yM%2BHO0L1CyWIorFCryI7LQ%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Here at Dott, we believe in a future where our cities are free from cars and pollution. With our on-demand e-bikes and e-scooters, we want to help co-create liveable cities where space is given back to people. We dream of cities where it is easy to move from one place to another with less congestion and more socialisation. All work we do is to continue reaching for our mission, to free our cities with clean rides for everyone. We have recently closed a financial transaction to merge with TIER. Together we create the European champion of shared micro-mobility, with revenues of €250m, supporting over 125M trips a year in more than 20 countries. TIER-Dott is the leading shared micro-mobility operator in Europe, operating over 250.000 e-scooter and e-bikes across Europe and the Middle East. Within TIER-Dott the Vehicle Product team is constantly busy keeping vehicles up and running and improving the user experience, quality and safety of our fleet. During your internship you will be working on mechanical quality issues on several different vehicles as well as feature improvements. You will be working in cross-functional teams to solve issues quickly and adequately. What you will do: Inspect and perform root cause analysis on broken parts sent by our local markets. Provide evidence for mechanical failures to support claims against our suppliers. Review test reports. Write test specifications. Validate upgraded/new parts through testing. Create and validate Standard Operating Procedures (SOPs). Evaluate current vehicle components and manage/support on feature improvements. What you will need: Enrolled in a Mechanical Engineering/Automotive (or similar) course (Bachelors). Passed all first year classes. Proficient in English, verbal and written. Hands-on experience (working in a workshop). Hobby and/or professional. Affinity with bikes/scooter/motorcycles is a plus. THIS MAY INSPIRE YOU We embrace change in our cities, our work, and ourselves. We empower each other to make a lasting impact. We spark meaningful connections by fostering a supportive community. We succeed by adapting the way we work. Unlock the Change Check out our EVP Video Here Benefits & Policies*: 🚀 Employee Stock/Equity plan 💰 A fair, mid-market salary package 🧑‍💻 Weekly All-hands meetings 🧘 Mental health support with Open-up 🫂 Employee Resource Groups 🪹 Pension scheme 👶 Parental policies 🏡 Hybrid or Remote Work Policy (depending on location) 🌎 Short-term Remote Work Policy 🏞️ Sabbatical Policy 🪑 Work from home budget (* benefits will vary based on the country and position) (* benefits will vary based on the country and position) Sustainability Statement We continuously measure and improve our environmental and social impact. We're not claiming we'll save the world, but we're relentlessly striving to do the right thing for people, cities, and the planet. We're constantly putting the environment and our social impact at the heart of every business decision. For more information on our sustainability, check out our Sustainability Report & Manifesto (bit.ly/3KB9dwq). Equity, Diversity, and Inclusion (ED&I) Statement Dott is an equal-opportunity employer and aims to be intentional in our ED&I strategy. We operate throughout Europe in the hometowns of countless people, including our employees. To truly free OUR cities, we must have a workforce that not only understands the unique needs of our cities but also represents the diversity within them. To support all our employees to be their authentic selves, we have a zero-tolerance policy for discrimination and harassment in any regard. Data Privacy At TIER-Dott, we respect fundamental privacy rights. We process your personal data in accordance with the requirements of the General Data Protection Regulation (\"GDPR\"). For a clear explanation of how we handle and process your personal data, please read our Candidate Privacy Statement."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Dott", "company_link": "https://www.linkedin.com/company/ridedott/life", "job_title": "Mechanical Engineer Intern", "location": "Not Found", "posted_on": "2 days ago as per the 2024-12-31 10:25:43", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4110667593/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=AEmWb4w3aDTOFWWldmqSXQ%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Here at Dott, we believe in a future where our cities are free from cars and pollution. With our on-demand e-bikes and e-scooters, we want to help co-create liveable cities where space is given back to people. We dream of cities where it is easy to move from one place to another with less congestion and more socialisation. All work we do is to continue reaching for our mission, to free our cities with clean rides for everyone. We have recently closed a financial transaction to merge with TIER. Together we create the European champion of shared micro-mobility, with revenues of €250m, supporting over 125M trips a year in more than 20 countries. TIER-Dott is the leading shared micro-mobility operator in Europe, operating over 250.000 e-scooter and e-bikes across Europe and the Middle East. Within TIER-Dott the Vehicle Product team is constantly busy keeping vehicles up and running and improving the user experience, quality and safety of our fleet. During your internship you will be working on mechanical quality issues on several different vehicles as well as feature improvements. You will be working in cross-functional teams to solve issues quickly and adequately. What you will do: Inspect and perform root cause analysis on broken parts sent by our local markets. Provide evidence for mechanical failures to support claims against our suppliers. Review test reports. Write test specifications. Validate upgraded/new parts through testing. Create and validate Standard Operating Procedures (SOPs). Evaluate current vehicle components and manage/support on feature improvements. What you will need: Enrolled in a Mechanical Engineering/Automotive (or similar) course (Bachelors). Passed all first year classes. Proficient in English, verbal and written. Hands-on experience (working in a workshop). Hobby and/or professional. Affinity with bikes/scooter/motorcycles is a plus. THIS MAY INSPIRE YOU We embrace change in our cities, our work, and ourselves. We empower each other to make a lasting impact. We spark meaningful connections by fostering a supportive community. We succeed by adapting the way we work. Unlock the Change Check out our EVP Video Here Benefits & Policies*: 🚀 Employee Stock/Equity plan 💰 A fair, mid-market salary package 🧑‍💻 Weekly All-hands meetings 🧘 Mental health support with Open-up 🫂 Employee Resource Groups 🪹 Pension scheme 👶 Parental policies 🏡 Hybrid or Remote Work Policy (depending on location) 🌎 Short-term Remote Work Policy 🏞️ Sabbatical Policy 🪑 Work from home budget (* benefits will vary based on the country and position) (* benefits will vary based on the country and position) Sustainability Statement We continuously measure and improve our environmental and social impact. We’re not claiming we’ll save the world, but we’re relentlessly striving to do the right thing for people, cities, and the planet. We’re constantly putting the environment and our social impact at the heart of every business decision. For more information on our sustainability, check out our Sustainability Report & Manifesto (bit.ly/3KB9dwq). Equity, Diversity, and Inclusion (ED&I) Statement Dott is an equal-opportunity employer and aims to be intentional in our ED&I strategy. We operate throughout Europe in the hometowns of countless people, including our employees. To truly free OUR cities, we must have a workforce that not only understands the unique needs of our cities but also represents the diversity within them. To support all our employees to be their authentic selves, we have a zero-tolerance policy for discrimination and harassment in any regard. Data Privacy At TIER-Dott, we respect fundamental privacy rights. We process your personal data in accordance with the requirements of the General Data Protection Regulation (“GDPR”). For a clear explanation of how we handle and process your personal data, please read our Candidate Privacy Statement."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Axpo Group", "company_link": "https://www.linkedin.com/company/axpo-group/life", "job_title": "Intern Data Science (f/m/d)", "location": "Not Found", "posted_on": "2 weeks ago as per the 2024-12-31 10:25:48", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4098191238/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=UyuU5INrP0sc26aa1rfIyA%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Workload: 100% Dive into the world of data-driven innovation with Axpo! As a Data Science Intern, you'll play a key role in analyzing markets and developing advanced solutions. This is your chance to gain hands-on experience and make an impact in the energy sector. What you will do: Conduct exploratory data analysis to uncover insights. Develop benchmarking frameworks and operationalize data pipelines. Create detailed reports and participate in code reviews. Contribute to the analysis of ancillary service markets. What you bring & who you are: A bachelor’s degree in a quantitative field. Proficiency in Python, data analysis, and strong analytical thinking. Knowledge of energy markets is a plus. Collaborative mindset, effective communication skills, curiosity, and resilience. Fluency in English (German is a plus). About the team: Join a passionate team focused on innovation and collaboration. Together, we explore cutting-edge solutions and tackle challenges to drive success in a dynamic, supportive environment."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "General Atomics", "company_link": "https://www.linkedin.com/company/general-atomics/life", "job_title": "Intern - Mechanical Engineer", "location": "Not Found", "posted_on": "2 weeks ago as per the 2024-12-31 10:25:52", "applicant": "88 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4096912788/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=%2B1Lnf%2BHffOu7PfFsFkbwUQ%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job General Atomics Aeronautical Systems, Inc. (GA-ASI), an affiliate of General Atomics, is a world leader in proven, reliable remotely piloted aircraft and tactical reconnaissance radars, as well as advanced high-resolution surveillance systems. We have an exciting opportunity for an Undergraduate Intern with a field of study in Mechanical Engineering to join our ASI Engineering team in Poway, California! DUTIES AND RESPONSIBILITIES: Under general supervision, participates in the day-to-day activities of assigned functional area assisting in the completion of routine and non-routine tasks. Assists in applying knowledge to analyze, investigate and resolve problems. Assists in developing electronic and hard copy reports, records, diagrams and charts. Responsible for observing all laws, regulations and other applicable obligations wherever and whenever business is conducted on behalf of the Company. Expected to work in a safe manner in accordance with established operating procedures and practices. We recognize and appreciate the value and contributions of individuals with diverse backgrounds and experiences and welcome all qualified individuals to apply. Base Salary: $44,590 - 66,295 Job Type: Full-Time Hourly The General Atomics(GA) group of companies is a world renowned leader in developing high - technology systems ranging from the nuclear fuel cycle to electromagnetic systems; remotely operated surveillance aircraft; airborne sensors; advanced electronic, wireless, and laser technologies; and biofuels. We offer an excellent opportunity to realize your full potential and fulfill your career aspirations.Join the GA Team where you can make a difference! Equal Opportunity / Affirmative Action Employer"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Howmet Aerospace", "company_link": "https://www.linkedin.com/company/howmet-aerospace/life", "job_title": "Intern - Manufacturing Engineer", "location": "Not Found", "posted_on": "2 weeks ago as per the 2024-12-31 10:25:56", "applicant": "34 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4094019016/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=sJfi2diy%2FLJJQsuf01tyaQ%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Responsibilities Howmet Aerospace is a leading global provider of advanced engineered solutions for the aerospace and transportation industries. The Company’s primary businesses focus on jet engine components, aerospace fastening systems and titanium structural parts necessary for mission-critical performance and efficiency in aerospace and defense applications, as well as forged wheels for commercial transportation. Howmet Aerospace is transforming the next phase of more fuel-efficient, quieter aerospace engines and sustainable ground transportation. For more information, visit www.howmet.com . Follow @howmet: Twitter, Instagram, Facebook, LinkedIn and YouTube. The Process Engineer Intern position will be located in our HOWMET MEXICO/HOWMET DEL RIO, TX We are seeking a highly motivated and energetic student to join our Plant HOWMET MEXICO/HOWMET DEL RIO, TX team as a Process Engineer Summer Intern. This position will assist engineering and manufacturing in driving improvements in quality and delivery performance through process control and improvement initiatives. The 2024 Summer Internship Program also includes: lunch & learns presented by senior leaders, tours of our manufacturing plants & processes, networking opportunities, volunteering in the local community, and fun social activities to connect with fellow interns. Howmet is proud to be an Equal Employment Opportunity and Affirmative Action employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We do not discriminate based upon race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. If you need assistance to complete your application due to a disability, please email  TalentAcquisitionCoE_Howmet@howmet.com Qualifications QUALIFICATIONS Basic Qualifications: Candidate must be pursuing a Bachelor’s degree from an accredited institution. Minimum completion of Sophomore level coursework from an accredited institution. Employee must have a current US Passport to commute every day to our Mexican plant Employees must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position. Preferred Qualifications: Currently enrolled in a Bachelor’s degree program in Engineering (Mechanical, aerospace,etc) from an accredited institution. Knowledge of Six Sigma and Lean Manufacturing Strong verbal and written communication skills Excellent analytical skills Ability to work in a self-directed or team environment Strong organizational skills Relevant internship/work/research experience a plus About Us About Howmet Aerospace Howmet Aerospace Inc. (NYSE: HWM), headquartered in Pittsburgh, Pennsylvania, is a leading global provider of advanced engineered solutions for the aerospace and transportation industries. Our primary businesses focus on jet engine components, aerospace fastening systems, titanium structural parts and forged wheels. With $6.6 billion in revenue in 2023, our products play a crucial role in enabling fuel efficiency and lightweighting, contributing to our customers’ success and making a positive impact on the world. To learn more about the way Howmet Aerospace Inc. is advancing the sustainability of our customers, markets, and communities where we operate, review the 2023 Environmental Social and Governance report at www.howmet.com/esg-report . Follow: LinkedIn , Twitter , Instagram , Facebook , and YouTube . Howmet is proud to be an Equal Employment Opportunity and Affirmative Action employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or other applicable legally protected characteristics. If you need assistance to complete your application due to a disability, please email TalentAcquisitionCoE_Howmet@howmet.com"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Amazon", "company_link": "https://www.linkedin.com/company/amazon/life", "job_title": "Reliability Engineer Intern", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:26:00", "applicant": "28 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4108553169/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=AussbSFtFn93sXQQV7peJg%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Description Amazon develops innovative consumer-centric product solutions. As a reliability engineer intern, you will be part of an exciting team to assist developing and testing products. You will assist a senior reliability engineer for the development and implementation of methodologies /techniques to enhance product reliability. You will work closely with cross-functional teams located in both the US, China and Vietnam throughout the design cycle to assist driving and executing product qualification. You must be responsive, flexible and able to succeed within an open collaborative peer environment. Key job responsibilities Participate in creating reliability test plans including resource allocations, validation schedule assumptions, and validation items scope. Participate in implementing specific validation items in reliability test plans with schedule. Work closely with Senior reliability engineer in reporting reliability execution progress and issues. Participate in evaluating and developing reliability test methodologies to reduce test time and increase test coverage. Travel domestically to supplier sites as projects require. Basic Qualifications Bachelor's degree or above in electrical engineering, material engineering, mechanical engineering or related fields. Strong organizational and problem-solving skills Clear oral and written communication skills (Vietnamese and English, Chinese is preferred) Demonstrated critical thinking capability Self-motivated and proactive Preferred Qualifications Previous work or internship experience Understanding of the principles and basic structures of measuring instruments such as HALT, chambers, oscilloscopes, and multimeters etc. Past experience or coursework with reliability knowledge, statistical knowledge and be able to use reliability and statistical method to do data analysis. Past experience with failure analysis techniques to isolate failure for test issues. Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner. Company - Amazon Corporate Services Vietnam Company Limited - K62 Job ID: A2861084"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "GSK", "company_link": "https://www.linkedin.com/company/gsk/life", "job_title": "Intern, Quality, 2024", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:26:04", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4103503382/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=zWREv3DniHT9PF0dTGMsVg%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Site Name: Costa Rica - Cartago - Tres Rios Posted Date: Dec 17 2024 Intern, Quality, 2024 Modelo híbrido: 1-2 días en sitio por semana Ayúdanos a adelantarnos a la enfermedad junto con nuestra Área de Calidad. Formación requerida: Actualmente cursando los últimos años de la carrera de Ciencias / Salud. Mínimo 1 año para graduarse. Otros requisitos: Estar matriculado en una universidad durante la duración de su pasantía (al menos 12 meses). Disponibilidad de 6-8 horas de lunes a viernes (flexibles) Requisito de idioma: Inglés intermedio Fecha prevista de inicio: Enero - Febrero 2025 Fecha límite de solicitud: Cerraremos ésta vacante cuando tengamos suficientes solicitudes, así que solicite tan pronto como pueda para ser considerado. ¿Quieres obtener una valiosa experiencia laboral en el mundo real y ayudar a impactar positivamente la salud de miles de millones de personas? Una pasantía de GSK le ofrece la oportunidad de comenzar su carrera, ¡asumir un papel real con un impacto genuino! Asumirá un trabajo desafiante y serio en proyectos en vivo o tareas. También aprenderá de nosotros, desarrollará sus habilidades y obtendrá una valiosa experiencia para donde sea que lo lleve el futuro. ¿Quiénes somos? GSK es una compañía biofarmacéutica global con un propósito especial: unir ciencia, tecnología y talento para adelantarse juntos a las enfermedades. Salir adelante significa prevenir enfermedades y tratarlas, y nuestro objetivo es impactar la salud de 2.500 millones de personas en todo el mundo en los próximos 10 años. Nuestro éxito depende absolutamente de nuestra gente. Queremos que GSK sea un lugar donde las personas se sientan inspiradas, alentadas y desafiadas a ser lo mejor que puedan ser. Un lugar donde pueden ser ellos mismos, sintiéndose bienvenidos, valorados e incluidos. Donde puedan seguir creciendo y velar por su bienestar. Entonces, si compartes nuestra ambición, únete a nosotros en este emocionante momento en nuestro viaje para salir adelante juntos. ¿Qué harás? Apoyar el mantenimiento del Sistema de gestión de la calidad para garantizar que las operaciones locales cumplan con las políticas y procedimientos de GSK y regulación aplicable, las buenas prácticas de documentación, y los objetivos comerciales del negocio: Identificación y almacenamiento adecuado de documentos. Actualización de la matriz de entrenamiento del personal, con base en los avances en la implementación del plan de entrenamiento anual. Generación, actualización y/o seguimiento de indicadores clave de proceso (KPIs). Preparación de materiales de entrenamiento. Recopilación de información para diferentes propósitos: reuniones, informes periódicos de KPIs, solicitudes de información de otras áreas, etc. Difusión de los principios del sistema de gestión de calidad (por ejemplo: campaña de la semana de la calidad). Quejas Técnicas: seguimiento a las distintas etapas del proceso hasta el cierre. Verificación de temperaturas durante la distribución de productos: registro/actualización de información en eventos de incidentes de transporte (TILs) asociados a excursiones de temperatura con potencial impacto en la calidad de los productos. Validación de hojas de Excel. Incorporación/desarrollo de nuevas herramientas (Power BI). Mejora continua: Compartir/ difundir/ implementar buenas prácticas, lecciones aprendidas, casos de éxito, proyectos de simplificación. ¿Qué buscamos? Manejo de datos en Excel (Tablas dinámicas, macros, reportes) Adaptabilidad y proactividad Un vivo interés en la industria biofarmacéutica Excelentes habilidades de comunicación Fuertes habilidades para resolver problemas impulsadas por la curiosidad Disposición para trabajar en equipo Nivel de inglés intermedio ¿Qué te ofrecemos? Soporte económico Aprendizaje continuo de las herramientas técnicas Experiencia con áreas de Calidad GSK Interacción con personas dentro de LATAM Equipo abierto y amigable ¡Hagamos esto! Encontrará sugerencias, consejos y orientación sobre nuestro proceso de reclutamiento en nuestro sitio web: Inscríbete ahora en nuestros programas Early Talent | GSK Le recomendamos que presente su solicitud lo antes posible, porque aceptamos solicitudes en curso y ofrecemos puestos por orden de llegada. Hemos cambiado la forma en que reclutamos a la luz de la pandemia de COVID-19, puede obtener más información sobre cómo se han adaptado nuestras prácticas aquí. ¡Aplica ahora! Estamos 100% abiertos a todo el talento Estamos 100% abiertos a todos los talentos, independientemente de su género, estado civil, religión, edad, color, raza, orientación sexual, nacionalidad o discapacidad. Queremos reclutar a las personas adecuadas para GSK de la mayor experiencia posible, para que podamos servir mejor a la diversidad de nuestros pacientes.  Y también porque es lo correcto. Puede obtener más información sobre la inclusión y la diversidad en GSK aquí. ¿Necesita ayuda con su solicitud? Por favor, envíenos un correo electrónico a  AM.EarlyTalentRecruitment@gsk.com Why GSK? Uniting science, technology and talent to get ahead of disease together. GSK is a global biopharma company with a special purpose – to unite science, technology and talent to get ahead of disease together – so we can positively impact the health of billions of people and deliver stronger, more sustainable shareholder returns – as an organisation where people can thrive. We prevent and treat disease with vaccines, specialty and general medicines. We focus on the science of the immune system and the use of new platform and data technologies, investing in four core therapeutic areas (infectious diseases, HIV, respiratory/ immunology and oncology). Our success absolutely depends on our people. While getting ahead of disease together is about our ambition for patients and shareholders, it’s also about making GSK a place where people can thrive. We want GSK to be a place where people feel inspired, encouraged and challenged to be the best they can be. A place where they can be themselves – feeling welcome, valued, and included. Where they can keep growing and look after their wellbeing. So, if you share our ambition, join us at this exciting moment in our journey to get Ahead Together. Important notice to Employment businesses/ Agencies GSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site. Our inclusive workplace makes our employees feel engaged by the contribution they make, by affording them equal treatment regardless of actual or perceived characteristics. As so, when you apply for a job at GSK, it is not necessary to include on your resume information such as: race, color, ethnicity, age, gender, sexual orientation, marital status, religion, origin, photographs or any other personal characteristics. Find out what life at GSK is really like www.gsk.com"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "ispace, inc.", "company_link": "https://www.linkedin.com/company/ispace-inc/life", "job_title": "Intern Warehouse Management", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:26:09", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4103779361/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=eBF6%2FC4HomVyktX7eVNHkA%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job ispace Europe is seeking a highly motivated and talented  Intern Warehouse Management  to join our team. Our vision is to expand and sustain humanity’s presence in space by developing a lunar economy based on the resources available on the Moon. As the regional office of ispace in Luxembourg, we are creating the first lunar resource exploration service by developing ispace’s next generation rovers for prospecting lunar water and other resources. We are a small, international team motivated by the challenges of the Lunar Frontier and committed to achieving the company’s vision. This is a unique opportunity to join a truly fascinating project exploring resources on the Moon. We are seeking a dynamic and motivated intern to join our Operations team. This internship offers hands-on experience in optimizing warehouse and manufacturing processes within a fast-paced, high-tech environment. The position is based in Luxembourg and reports to the Group Manager (CTO Group), working closely with the team members of ispace Europe. Key Responsibilities Warehouse Management Optimization: Analyze the current physical layout of the warehouse and propose improvements to enhance space utilization, workflow, and accessibility. Organize the initial setup of shelves, bins, or other storage solutions to prepare for incoming materials. Carry out an inventory and update the information in the ERP Develop a standard operating procedure for warehouse management to ensure consistency and scalability. Support procurement by participating in the reception of products both electronically and physically. 5S Implementation in an Existing Manufacturing Area: Conduct an initial assessment of the current manufacturing area to identify inefficiencies and opportunities for improvement. Implement the 5S methodology: Sort: Remove unnecessary items from the workspace. Set in Order: Organize tools and equipment for easy accessibility. Shine: Clean and maintain work areas for improved safety and productivity. Standardize: Create visual cues, checklists, and guidelines to maintain organization. Sustain: Train employees and set up a routine audit system to ensure lasting results. What You Will Bring A background in Industrial Engineering, Operations Management, Supply Chain, or a related field. Basic understanding of ERP systems and process improvement methodologies (e.g., Lean, 5S). Strong organizational and analytical skills with a hands-on approach. Excellent communication and teamwork abilities. A proactive mindset and eagerness to learn in a high-tech environment. WHAT WE OFFER: Hands-on experience with real-world challenges and tangible impact on operations. Mentorship from experienced professionals in a supportive and collaborative environment. Access to a vibrant team and exclusive insights into the aerospace industry. To apply, please submit your English resume and mandatory cover letter. You can read more about our recent activities here: https://ispace-inc.com/news-en ."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Klein Tools", "company_link": "https://www.linkedin.com/company/klein-tools/life", "job_title": "Product Engineer Intern", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:26:13", "applicant": "61 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4104730294/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=ychEYlQNWliq59q05HAppQ%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Klein Tools is a dynamic, fast-paced and results driven company dedicated to launching hundreds of innovative products each year. Are you ready to make an impact? Perks for you include: Paid Vacations & Holidays Profit Sharing & Matching 401(k) Health Insurance (Medical, Vision, & Dental) Discounts on Klein Tools products Education and Professional Development Assistance The Product Engineer Intern position is responsible for assisting the new product development team by providing feedback and project support to meet deadlines. This position may assist with 3D printing, work with the quality team to test products in the test lab, create basic level modeling, and design prototypes. In addition, this position may recommend improvements in the manufacturing process by working with the manufacturing management team. This position will gain valuable engineering experience within a team environment that students can apply in their coursework. Create 3D and post process prints for the new product development team to review. Work with the engineering team to identify and submit products to the test lab. Create or modify basic models or prints. Design and build prototypes and test fixtures to make recommendations for improvement. Work in the Engineering test lab to test products and report results. Analyze and make recommendations based on engineering test lab results. Partner with the manufacturing team to make recommendations to improve the manufacturing process. Perform other duties as assigned within then nature and level of work. Qualifications High School Diploma or equivalent is required. Qualified candidates must currently be enrolled in an accredited undergraduate program to be considered. Basic knowledge of computers and the Microsoft Office Suite (i.e. Word, Excel, Outlook, PowerPoint, etc). Demonstrate excellent verbal and written communication skills. Ability to work well in a team environment and communicate with all levels of the organization. Ability to handle confidential information. Ability to prioritize projects and tasks in a fast‐paced environment. Must have excellent follow-up skills. Must be organized and detail‐oriented in order to be successful. Your main focus: Quality Customer Obsession Innovation Ownership Teamwork Klein Tools is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status. For candidates with disabilities and needing assistance, please email us at hr@kleintools.com. Apply Now"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Lavazza Group", "company_link": "https://www.linkedin.com/company/lavazza-group/life", "job_title": "Coffee Machines Quality Intern", "location": "Not Found", "posted_on": "2 weeks ago as per the 2024-12-31 10:26:16", "applicant": "97 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4096790342/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=Lzg8QApWD33KsltajEOl%2FA%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Hi 👋 We are the Lavazza HR Talent Acquisition Team and we’re looking for a Coffee Machines Quality Intern. You will join the Machines Quality team, supporting colleagues in the daily activities of analyzing coffee machine performance and contributing to the continuous improvement of the products. 📊 Your Day-to-day Activities Data analysis from the network, complaints, and machine trends to identify potential deviations and priority issues to address Participation in analysis and testing of returns together with the R&D/Technical Service/Supplier Quality departments Reporting activities and periodic analysis of machine KPIs Participation and contribution to coordinating activities aimed at the continuous improvement of products 💡 Who We’re Looking For You’re available for a 6-month full time internship. Starting date: January 2025 You’ll be fluent in Italian and English - you’ll probably have an international experience? Way to go! You have a Degree in Engineering You have good Excel and Power-Point skills and you’re ready to learn how to master them! You share our aim to awaken a better world every morning and have an affinity with our company Values: authenticity, passion for excellence, responsibility, and inventiveness (PS: check them out before the interview may be a good idea!) (And if you’re a coffee lover....that helps!) ✨ In Return We Offer Internship allowance Flexible way of working Free company canteen Access to our corporate gym A dynamic work experience in an international context Free coffee (of course!) 💬 What next? Our Talent Acquisition Team will assess your application and if you have what we’re looking for, you'll be contacted for an initial interview If you make it to the short list, you’ll be interviewed by your future Manager! In some cases, you may be required to show us your skills via technical challenge ☕ Who We Are Our Group was founded in Turin in 1895, has been owned by the Lavazza family for four generations. As one of the world’s most important coffee roasters, we operate in more than 140 countries through our brands, subsidiaries and distributors, with a total of over 5,500 employees. Awakening a better world every morning: the commitment we make every single day. Location: Innovation Center (Str. di Settimo 390, TO) #Turin"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Syska Hennessy Group", "company_link": "https://www.linkedin.com/company/syska-hennessy-group/life", "job_title": "Mechanical Engineer Summer Intern", "location": "Not Found", "posted_on": "2 weeks ago as per the 2024-12-31 10:26:20", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4099127872/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=yhSFjl7jMQFC%2BYGggWittQ%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Watch your work come to life in landmark projects around the world when you partner with Syska Hennessy Group! As a global leader in consulting, engineering, and commissioning services, we specialize in MEP, information and communication technology, architectural lighting, vertical transportation, and commissioning. We currently have an opportunity for a Mechanical Engineering Summer Intern. Our dynamic work environment provides the optimal setting for a positive learning experience as an intern. From our supportive culture, diverse workforce, and competitive compensation, to our flexible work schedules and fun social events, it is everything you will need for an exciting, challenging, and rewarding internship. Internship Responsibilities: As an intern, you will support our engineering teams working towards our designs that are inspiring, demanding and highly collaborative. You will learn from others, and they will expect to learn from you. You will share in the responsibility, rewards, and recognition of producing truly innovative solutions and complete client satisfaction. The pace is fast, and the camaraderie is close. Some Responsibilities Include: Assist engineers in preparing design documentation Prepare AutoCAD and Revit drawings of Electrical systems Assist engineers with design calculations and sizing building Electrical systems Assist engineers with field investigations and construction site visits to observe Attend intern education program lunch-and-learn sessions Internship Requirements: The ideal candidate will enjoy a team environment and also flexible enough to work independently where needed. Candidates for this role will be eager to expand their knowledge by challenging themselves and using the highly technical resources around them. Additional Job Requirements: Pursing a bachelor’s Degree from accredited university in Mechanical engineering Must be at a minimum in your second year Previous engineering internship or co-op experience a plus Knowledge in the latest version of MEP AutoCAD and REVIT is a plus Basic knowledge in design and calculation software; MS Office Suite Benefits: Join us this summer to prepare for your career as an Engineer through our Intern Education Program. This program consists of lunch- and- learn sessions covering various aspects of our business while gaining “hands-on” experience working with our engineers and visiting project sites. Once you graduate, jump start your career by joining Syska Hennessy Group and our EDT program. About The EDT Program Our Company is committed to developing engineers into respected technical experts and versatile business leaders. In keeping with that aim, interns that are hired for full time employment upon graduation can take advantage of our Engineering Development Training (EDT) program; an accelerated, but thorough training curriculum. This curriculum will teach not only the technical aspects of our profession, but industry specific business aspects as well. Our senior engineers will work closely with each participant to foster a strong mentor/apprentice relationship. EIT/FE required. As a Member Of Our Highly Collaborative Team, We Also Provide Our Full-time Employees With a Flexible Benefits Package That Reflects Our Respect For Your Workplace Contributions, Professional Goals, And Personal Priorities. The Personal Benefits Program At Syska Hennessy Group Includes: Medical, Dental, Vision insurance 401(k) retirement plan with employer matching Individual and Dependent Life Insurance Short- and Long-Term Disability Health Wellness Programs including flu shots and biometric screenings Tuition Reimbursement Training and professional development courses Professional development incentive bonuses Opportunities for community outreach through internal networks Personal Time Off Program (PTO) Transit/parking program Monthly business phone stipend Work from home Fridays At Syska, we have cultivated a community that supports learning and provides guidance for professional development and further our culture of excellence. We promote an environment that is committed to embedding diversity and equality into the core of our business and culture. We empower our employees so they can take ownership for their work and development and strive to continually improve themselves and our firm. We rely on the talent, drive, enthusiasm, and the total job satisfaction of the great people who work here for our success! Syska is a place where you can build an exceptional career and have a lasting impact on the world. Syska Hennessy Group Integrating the best minds and technology to help clients create exceptional environments The salary range listed below is for this particular job posting. Actual pay range for candidates will be commensurate with candidate’s experience, skillsets and competencies and may differ based on the cost of labor in their particular location. California Pay range $22—$25 USD"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Syska Hennessy Group", "company_link": "https://www.linkedin.com/company/syska-hennessy-group/life", "job_title": "Mechanical Engineer Summer Intern", "location": "Not Found", "posted_on": "2 weeks ago as per the 2024-12-31 10:26:23", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4099127872/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=yhSFjl7jMQFC%2BYGggWittQ%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Watch your work come to life in landmark projects around the world when you partner with Syska Hennessy Group! As a global leader in consulting, engineering, and commissioning services, we specialize in MEP, information and communication technology, architectural lighting, vertical transportation, and commissioning. We currently have an opportunity for a Mechanical Engineering Summer Intern. Our dynamic work environment provides the optimal setting for a positive learning experience as an intern. From our supportive culture, diverse workforce, and competitive compensation, to our flexible work schedules and fun social events, it is everything you will need for an exciting, challenging, and rewarding internship. Internship Responsibilities: As an intern, you will support our engineering teams working towards our designs that are inspiring, demanding and highly collaborative. You will learn from others, and they will expect to learn from you. You will share in the responsibility, rewards, and recognition of producing truly innovative solutions and complete client satisfaction. The pace is fast, and the camaraderie is close. Some Responsibilities Include: Assist engineers in preparing design documentation Prepare AutoCAD and Revit drawings of Electrical systems Assist engineers with design calculations and sizing building Electrical systems Assist engineers with field investigations and construction site visits to observe Attend intern education program lunch-and-learn sessions Internship Requirements: The ideal candidate will enjoy a team environment and also flexible enough to work independently where needed. Candidates for this role will be eager to expand their knowledge by challenging themselves and using the highly technical resources around them. Additional Job Requirements: Pursing a bachelor’s Degree from accredited university in Mechanical engineering Must be at a minimum in your second year Previous engineering internship or co-op experience a plus Knowledge in the latest version of MEP AutoCAD and REVIT is a plus Basic knowledge in design and calculation software; MS Office Suite Benefits: Join us this summer to prepare for your career as an Engineer through our Intern Education Program. This program consists of lunch- and- learn sessions covering various aspects of our business while gaining “hands-on” experience working with our engineers and visiting project sites. Once you graduate, jump start your career by joining Syska Hennessy Group and our EDT program. About The EDT Program Our Company is committed to developing engineers into respected technical experts and versatile business leaders. In keeping with that aim, interns that are hired for full time employment upon graduation can take advantage of our Engineering Development Training (EDT) program; an accelerated, but thorough training curriculum. This curriculum will teach not only the technical aspects of our profession, but industry specific business aspects as well. Our senior engineers will work closely with each participant to foster a strong mentor/apprentice relationship. EIT/FE required. As a Member Of Our Highly Collaborative Team, We Also Provide Our Full-time Employees With a Flexible Benefits Package That Reflects Our Respect For Your Workplace Contributions, Professional Goals, And Personal Priorities. The Personal Benefits Program At Syska Hennessy Group Includes: Medical, Dental, Vision insurance 401(k) retirement plan with employer matching Individual and Dependent Life Insurance Short- and Long-Term Disability Health Wellness Programs including flu shots and biometric screenings Tuition Reimbursement Training and professional development courses Professional development incentive bonuses Opportunities for community outreach through internal networks Personal Time Off Program (PTO) Transit/parking program Monthly business phone stipend Work from home Fridays At Syska, we have cultivated a community that supports learning and provides guidance for professional development and further our culture of excellence. We promote an environment that is committed to embedding diversity and equality into the core of our business and culture. We empower our employees so they can take ownership for their work and development and strive to continually improve themselves and our firm. We rely on the talent, drive, enthusiasm, and the total job satisfaction of the great people who work here for our success! Syska is a place where you can build an exceptional career and have a lasting impact on the world. Syska Hennessy Group Integrating the best minds and technology to help clients create exceptional environments The salary range listed below is for this particular job posting. Actual pay range for candidates will be commensurate with candidate’s experience, skillsets and competencies and may differ based on the cost of labor in their particular location. California Pay range $22—$25 USD"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Analog Devices", "company_link": "https://www.linkedin.com/company/analog-devices/life", "job_title": "Product Application Intern FY25", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:26:26", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4104375778/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=jWEOyxqPa0pDqKjRm3aG%2Bg%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Are you a problem solver looking for a hands-on internship position with a market-leading company that will help develop your career and reward you intellectually and professionally? Analog Devices, Inc. (NASDAQ: ADI) is a global semiconductor leader that bridges the physical and digital worlds to enable breakthroughs at the Intelligent Edge. ADI combines analog, digital, and software technologies into solutions that help drive advancements in digitized factories, mobility, and digital healthcare, combat climate change, and reliably connect humans and the world. With revenue of more than $12 billion in FY23 and approximately 26,000 people globally working alongside 125,000 global customers, ADI ensures today’s innovators stay Ahead of What’s Possible. Learn more at www.analog.com and on LinkedIn. At ADI, you will learn from the brightest minds who are here to help you grow and succeed. During your internship, you will make an impact through work on meaningful projects alongside a team of experts. Collaborating with colleagues in an environment of respect and responsibility, you will create connections that will become a part of your professional network. ADI’s culture values aligned goals, work-life balance, continuous and life-long learning opportunities, and shared rewards. The internship program features various lunch-and-learn topics and social events with other interns and full-time employees. At ADI, our goal is to develop our interns so they are the first to be considered for full-time roles. Apply now for the opportunity to grow your career and help innovate ahead of what’s possible. TO BE UPDATED For positions requiring access to technical data, Analog Devices, Inc. may have to obtain export licensing approval from the U.S. Department of Commerce - Bureau of Industry and Security and/or the U.S. Department of State - Directorate of Defense Trade Controls. As such, applicants for this position – except US Citizens, US Permanent Residents, and protected individuals as defined by 8 U.S.C. 1324b(a)(3) – may have to go through an export licensing review process. Analog Devices is an equal opportunity employer. We foster a culture where everyone has an opportunity to succeed regardless of their race, color, religion, age, ancestry, national origin, social or ethnic origin, sex, sexual orientation, gender, gender identity, gender expression, marital status, pregnancy, parental status, disability, medical condition, genetic information, military or veteran status, union membership, and political affiliation, or any other legally protected group. Job Req Type: Internship/Cooperative Required Travel: No"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "General Atomics", "company_link": "https://www.linkedin.com/company/general-atomics/life", "job_title": "Intern - Mechanical Engineer", "location": "Not Found", "posted_on": "3 weeks ago as per the 2024-12-31 10:26:30", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4094750476/?alternateChannel=search&refId=VElzXFlwKRHiRL0RfxYhig%3D%3D&trackingId=L4%2BoQSnhPN%2FAqveBBbSDTQ%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Job Summary General Atomics Aeronautical Systems, Inc. (GA-ASI), an affiliate of General Atomics, is a world leader in proven, reliable remotely piloted aircraft and tactical reconnaissance radars, as well as advanced high-resolution surveillance systems. We have an exciting opportunity for an Undergraduate Intern with a field of study in Mechanical Engineering, to join our Production Operations team in Adelanto, California! DUTIES AND RESPONSIBILITIES: Under general supervision, participates in the day-to-day activities of assigned functional area assisting in the completion of routine and non-routine tasks. Assists in applying knowledge to analyze, investigate and resolve problems. Assists in developing electronic and hard copy reports, records, diagrams and charts. Responsible for observing all laws, regulations and other applicable obligations wherever and whenever business is conducted on behalf of the Company. Expected to work in a safe manner in accordance with established operating procedures and practices. We recognize and appreciate the value and contributions of individuals with diverse backgrounds and experiences and welcome all qualified individuals to apply. Job Qualifications Desired Skills: Structures, Composite, Propulsion, Understanding of engineering concepts, principles, and theory. Requires active enrollment and currently attending as an undergraduate student at a recognized college or university. Applicants who will have completed their undergraduate degree by the time the internship program would begin, must be planning to continue in a graduate program immediately following the conclusion of the internship program. 3.0 cumulative GPA preferred Ability to understand new concepts and apply them accurately. Ability to follow general and detailed instructions as well as organizational policies and procedures. Basic communication and interpersonal skills to enable effective interface with internal professionals. Ability to work independently or in a team environment. Basic computer skills. This position pays at an hourly rate of $29.00 - $31.00/hr., depending on your specific field of study and the number of college years completed. Job Type: Full-Time Hourly Salary range: 44,590 - 66,295"}]}, {"page_2": [{"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Western Digital", "company_link": "https://www.linkedin.com/company/western-digital/life", "job_title": "Intern - Technician Assistant (Maintenance)", "location": "Not Found", "posted_on": "5 days ago as per the 2024-12-31 10:26:34", "applicant": "2 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4109586457/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=dEkFYiVkIkr9faB0aTITyw%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Company Description At Western Digital, our vision is to power global innovation and push the boundaries of technology to make what you thought was once impossible, possible. At our core, Western Digital is a company of problem solvers. People achieve extraordinary things given the right technology. For decades, we’ve been doing just that. Our technology helped people put a man on the moon. We are a key partner to some of the largest and highest growth organizations in the world. From energizing the most competitive gaming platforms, to enabling systems to make cities safer and cars smarter and more connected, to powering the data centers behind many of the world’s biggest companies and public cloud, Western Digital is fueling a brighter, smarter future. Binge-watch any shows, use social media or shop online lately? You’ll find Western Digital supporting the storage infrastructure behind many of these platforms. And, that flash memory card that captures and preserves your most precious moments? That’s us, too. We offer an expansive portfolio of technologies, storage devices and platforms for business and consumers alike. Our data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk® and WD® brands. Today’s exceptional challenges require your unique skills. It’s You & Western Digital. Together, we’re the next BIG thing in data. Job Description ESSENTIAL DUTIES AND RESPONSIBILITIES: Support performs technical support activities related to operation approaches to achieve the organization's goal Support performance report and perform related work as assigned Support Check machine according to assigned check sheet Support daily/weekly checks of tooling and equipment for production Support Maintains machines and per with corrective procedures and technical guidance หน้าที่ และความรับผิดชอบ: ช่วงเวลาเริ่มเข้าฝึกงาน:  พฤษภาคม 2568 ฝึกทักษะงานกิจกรรมช่าง ที่เกี่ยวข้องกับแนวทางการดําเนินงาน เพื่อให้บรรลุเป้าหมายขององค์กร ฝึกทักษะการสนับสนุน จัดทำรายงานผลการดําเนินงานที่เกี่ยวข้องกับการปฏิบัติงานตามที่ได้รับมอบหมาย ฝึกทักษะการสนับสนุนตรวจสอบเครื่องจักรตามเอกสารกำหนด ฝึกทักษะการสนับสนุนการตรวจสอบเครื่องจักรการผลิต รายวัน/รายสัปดาห์ ฝึกทักษะงานบํารุงรักษา การแก้ไขเครื่องจักร และแนะนําขั้นตอนทางเทคนิค Qualifications REQUIRED: Pursuing a High Vocational in Electronics Knowledge in electronic power or a related field Skills Skills in computer techniques Skills in Microsoft Office applications Basic English communication คุณสมบัติ: กำลังศึกษาอยู่ระดับประกาศนียบัตรวิชาชีพชั้นสูง (ปวส.) สาขาอิเล็กทรอนิกส์ ความรู้ด้านไฟฟ้า อิเล็กทรอนิกส์หรือสาขาที่เกี่ยวข้อง มีทักษะเทคนิคการใช้งานคอมพิวเตอร์ เช่น การใช้งานMicrosoft Office การสื่อสารภาษาอังกฤษขั้นพื้นฐาน Additional Information Western Digital thrives on the power and potential of diversity. As a global company, we believe the most effective way to embrace the diversity of our customers and communities is to mirror it from within. We believe the fusion of various perspectives results in the best outcomes for our employees, our company, our customers, and the world around us. We are committed to an inclusive environment where every individual can thrive through a sense of belonging, respect and contribution. Western Digital is committed to offering opportunities to applicants with disabilities and ensuring all candidates can successfully navigate our careers website and our hiring process. Please contact us at jobs.accommodations@wdc.com to advise us of your accommodation request. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Khichad Technologies", "company_link": "https://www.linkedin.com/company/khichadtechnologies/life", "job_title": "Graphic Designer intern & Video Editor Intern", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:26:38", "applicant": "6 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/3914549621/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=vrAANCtMYYvhPoWMt%2Ff7EQ%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Are you a creative enthusiast looking to sharpen your skills in graphic design and video editing? Join Khichad Technologies Pvt. Ltd. as an Intern and gain hands-on experience in a dynamic and innovative environment. What You’ll Do: Collaborate with the marketing team to create compelling graphics for digital campaigns, social media, and websites. Edit engaging videos for promotional materials, advertisements, and client projects. Assist in brainstorming and developing creative content ideas. Ensure all visuals align with the company’s brand guidelines and objectives. Stay updated with the latest trends in design and video editing. Who We’re Looking For: Proficiency in graphic design tools like Adobe Photoshop, Adobe Illustrator, CorelDRAW, and InDesign. Expertise in video editing software such as Adobe Premiere Pro, Final Cut Pro, DaVinci Resolve, After Effects, or similar tools. Familiarity with prototyping tools like Figma, Sketch, or Adobe XD is a plus. Strong creativity, attention to detail, and a keen eye for aesthetics. Excellent communication and teamwork skills. A passion for design and storytelling through visuals. Why Join Us? Gain real-world experience in the tech industry. Work on exciting projects with a talented team. Build a portfolio that showcases your skills. Opportunity to learn and grow with industry experts. Duration: 5-6 months Stipend: Competitive stipend offered based on skills and performance."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "UNDP Careers", "company_link": "https://www.linkedin.com/company/undpcareers/life", "job_title": "Intern (Research Support) TEPP-II [5 Positions]", "location": "Not Found", "posted_on": "5 hours ago as per the 2024-12-31 10:26:41", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4112588694/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=RBjgfevomXdc7K1Rwia3oA%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Job Description Background Diversity, Equity and Inclusion are core principles at UNDP: we value diversity as an expression of the multiplicity of nations and cultures where we operate, we foster inclusion as a way of ensuring all personnel are empowered to contribute to our mission, and we ensure equity and fairness in all our actions. Taking a ‘leave no one behind’ approach to our diversity efforts means increasing representation of underserved populations. People who identify as belonging to marginalized or excluded populations are strongly encouraged to apply. Learn more about working at UNDP including our values and  inspiring stories. UNDP does not tolerate sexual exploitation and abuse, any kind of harassment, including sexual harassment, and discrimination. All selected candidates will, therefore, undergo rigorous reference and background checks. UNDP Bangladesh is seeking enthusiastic and skilled individuals to join as Intern (Research Support) within the UNDP-supported Research and Analytics Unit (RAU), IP Transformative Economic Policy Programme (TEPP)-II anchored at the Bangladesh Investment Development Authority (BIDA). This initiative aims to foster inclusive economic growth and attract investment in Bangladesh. The program is aligned with UNDP’s mission of promoting sustainable development and enhancing national economic resilience. The Intern (Research Support) will have the opportunity to work closely with experienced professionals across various departments, gaining hands-on experience in research and analytics. This role supports data-driven decision-making to improve investment strategies and contributes to national policy development efforts that align with sustainable and equitable economic practices. This position is designed to cultivate young talent while bolstering the analytical capacity of the RAU and Futurenation programs, ultimately contributing to a more competitive and investment-friendly environment in Bangladesh. Duties And Responsibilities Under the guidance and direct supervision of the Coordinator and Economist, Intern (Research Support) will assist in delivering the following tasks: Conduct research and analyze data on economic trends, market conditions, and investment opportunities in Bangladesh. Prepare clear and concise reports summarizing findings, investment ideas, and policy recommendations. Collect, organize and analyze data from diverse sources to support informed decision-making. Prepare clear and concise reports on research findings, investment proposals, and policy recommendations. Produce quick briefing notes and write-ups on sectoral investment. Prepare presentations to effectively communicate research findings, recommendations, and project updates to stakeholders. Contribute to ongoing project’s activities related to investment promotion, policy development, or economic analysis. Provide administrative assistance as needed, including scheduling, document management, and event coordination. Any other relevant task assigned by the supervisor. Reports covering the delivery of the responsibilities listed above. Competencies Functional Competencies Strong sense of collaborative work, excellent communication, and interpersonal skills. Keen attention to detail. Excellent analytical and research skills. Interest in contemporary development issues in Bangladesh with some background in researching the region. Communication Speaks and writes clearly, concisely and effectively; Listens to others, correctly interprets messages from others and responds appropriately; Asks questions to clarify, and exhibits interest in having two-way communication; Tailors’ language, tone, style and format to match audience. Demonstrates openness in sharing information and keeping people informed. Teamwork Works collaboratively with colleagues to achieve organizational goals; solicits input by genuinely valuing others’ ideas and expertise. Is willing to learn from others, places team agenda before personal agenda. Supports and acts in accordance with final group decision, even when such decisions may not entirely reflect own position. Planning & Organizing Develops clear goals that are consistent with agreed strategies. Identifies priority activities and assignments; adjusts priorities as required. Allocates appropriate amount of time and resource for completing work. Creativity Promotes and persuades others to consider new ideas. Takes an interest in new ideas and new ways of doing things. Not bound by current thinking or traditional approaches. Qualification Requirements Required Skills and Experience Be enrolled in the final academic year or graduated of/from a degree programme (minimum Bachelor’s or equivalent) in Economics, Business Administration, International Business, and Development Studies. Ability to analyze economic data and draw meaningful conclusions. Proficiency in conducting research using various sources and methodologies. Strong written and verbal communication skills, including the ability to present findings effectively. Familiarity with Microsoft Word, Excel, PowerPoint, and other relevant software. Fluency in English and Bengali is required. Prior work experience is not mandatory. Application Procedure The application should contain: Brief Cover Letter (in English) stating interest in and qualifications for the post. Current and complete CV in English. Please group all your documents into one (1) single PDF document as the system only allows to upload a maximum of one document. Candidates Who Are Selected Must Submit The Following Documents Official letter from the University confirming enrollment in a graduate-level degree programme. Proof of medical and life/accident insurance valid for the location in which the internship will be carried out. Selected interns must have medical and life insurance. UNDP only accepts interns for a minimum of 6 weeks and a maximum of 6 months. Working Arrangements Interns may be given a stipend according to UNDP Internship Policy, if it is not financially supported by any institution or programme, such as a university, government foundation or scholarship programme. A stipend intended to help cover basic daily expenses related to the internship, such as meals and transportation at the duty station. The stipend will be paid on a monthly basis and part-time internship arrangements are prorated accordingly. Interns are responsible for securing adequate medical insurance for the duration of the internship. UNDP accepts no responsibility for costs arising from accidents and/or illness or death incurred during the internship. Interns must provide proof of enrollment in health insurance plan. Interns are expected to work full time, but flexibility is allowed for education programmes. The intern is responsible for obtaining necessary visas and arranging travel to and from the duty station where the internship will be performed. Interns are not eligible to apply for, or be appointed to, any post in UNDP during the period of the internship. Interns are not staff members and may not represent UNDP in any official capacity. The purpose of the internship is not to lead to further employment with UNDP, but to complement an intern’s studies. Therefore, there should be no expectation of employment at the end of an internship. The intern will be evaluated at the end of the contract. Disclaimer Important information for US Permanent Residents ('Green Card' holders) Under US immigration law, acceptance of a staff position with UNDP, an international organization, may have significant implications for US Permanent Residents. UNDP advises applicants for all professional level posts that they must relinquish their US Permanent Resident status and accept a G-4 visa, or have submitted a valid application for US citizenship prior to commencement of employment. UNDP is not in a position to provide advice or assistance on applying for US citizenship and therefore applicants are advised to seek the advice of competent immigration lawyers regarding any applications. Applicant Information About UNDP Rosters Note: UNDP reserves the right to select one or more candidates from this vacancy announcement. We may also retain applications and consider candidates applying to this post for other similar positions with UNDP at the same grade level and with similar job description, experience and educational requirements. Non-discrimination UNDP has a zero-tolerance policy towards sexual exploitation and misconduct, sexual harassment, and abuse of authority. All selected candidates will, therefore, undergo rigorous reference and background checks, and will be expected to adhere to these standards and principles. UNDP is an equal opportunity and inclusive employer that does not discriminate based on race, sex, gender identity, religion, nationality, ethnic origin, sexual orientation, disability, pregnancy, age, language, social origin or other status. Scam warning The United Nations does not charge any application, processing, training, interviewing, testing or other fee in connection with the application or recruitment process. Should you receive a solicitation for the payment of a fee, please disregard it. Furthermore, please note that emblems, logos, names and addresses are easily copied and reproduced. Therefore, you are advised to apply particular care when submitting personal information on the web. Note: UNDP is committed to achieving workforce diversity in terms of gender, ethnicity and culture. Individuals from minority groups, indigenous groups and people living with disabilities are equally encouraged to apply. All applications will be treated with the strictest confidence."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Electra", "company_link": "https://www.linkedin.com/company/electra-earth/life", "job_title": "Mechanical Engineer Intern (Summer 2025)", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:26:45", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4105023334/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=xLKf5y3l6656MFZ2l9DsBw%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Who We Are Electra is reinventing iron production to tackle the nearly 10% of global carbon dioxide emissions produced from iron and steelmaking. Its patented process uses chemistry and renewable energy to transform a variety of grades of iron ore into environmentally responsible pure iron at scale. By maximizing the value of Earth’s resources and minimizing our environmental footprint and carbon emissions, Electra is forging a green future from the ground up. With a collaborative culture and passion for disrupting the status quo, careers at Electra offer challenge, reward, and the opportunity to bring to market solutions that dramatically improve the health of the planet. Internship Program Summary The 2025 Summer Internship Program is open to current undergraduate and graduate students pursuing majors in related fields. The goal of the Program is to provide students with hands-on, industry experience while offering the opportunity to make valuable contributions at Team Electra. In This You Will Assist with the buildout, operation, and maintenance of manufacturing lines Assist with prototyping efforts to “fast-fail” design concepts Assist with the design and assembly of mechanical fixtures for manufacturing, testing, and machining Assist with the mechanical drafting and GD&T of Electra components and assemblies. Assist with technical documentation of build processes, testing procedures, test results, and lessons-learned Qualifications Must be actively enrolled in an accredited college or university and pursuing an undergraduate or graduate degree in mechanical engineering or related degree 3D modeling software experience (SolidWorks preferred) Ability to safely use hand tools, power tools, and other shop equipment (wrenches, saws, drills, etc.) Strong written and oral technical communication skills Preferred Qualifications Ability to create and interpret engineering drawings Experience operating machine tools (lathe, mill, laser cutter, welder, etc.) Familiarity with GD&T (Geometric Dimensioning and Tolerancing) (Geometric Dimensioning and Tolerancing), manufacturing, and common material properties Knowledge of electrochemical cell components and fundamentals Experience developing and executing experiments What’s In It For You Hands-on experience in an industry environment Opportunity to work on novel technologies Opportunity to collaborate with other teams Compensation The pay rate for this position is $29.00 per hour for undergraduate students and $32.00 per hour for graduate students. Interns are responsible for finding and paying for their housing solutions for the summer. Electra will provide suggestions for housing and will assist with connecting you with other interns after an accepted offer."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Howmet Aerospace", "company_link": "https://www.linkedin.com/company/howmet-aerospace/life", "job_title": "Intern - Manufacturing Engineer", "location": "Not Found", "posted_on": "2 weeks ago as per the 2024-12-31 10:26:48", "applicant": "38 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4093657900/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=BhjXlklCfoR8688phyv29w%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Responsibilities Howmet Fastening Systems is the premier manufacturer of industrial fasteners and is committed to bringing users the strongest, most reliable fastening solution available. Our uncompromising approach to engineering, manufacturing quality, and the breadth and depth of products is unmatched - resulting in a range of structurally superior fasteners and ergonomically designed installed tools. Become a part of our diverse culture of learning, development, and mentorship as a Manufacturing Engineer Intern in Summer 2025. This position will be located in Waco, Texas. We are seeking a highly motivated and energetic student to join our team as an Manufacturing Engineer Intern. You will play a crucial role in supporting the day-to-day functions of our business. The intern contributes to the efficiency and effectiveness of operations by identifying areas for improvement, implementing solutions, and actively participating in various projects. The role provides valuable learning opportunities and exposure to different aspects of the business. Your education is just the beginning - you'll become an active member of our Operations team, reporting to our Advanced Manufacturing Engineering Manager. During our 12-week internship program, you'll tackle real-world challenges through impactful assignments, and work alongside our industry changemakers. Intern Impact Project:  Identifying Plating Process Improvements The Manufacturing Engineer Intern will be paired with an area supervisor/external chemical support group to identify specific improvements for the Plating factory. This project will include reviewing the following: chemical dosing, addman chromate conversion charts, Geomet conversion from water based to solvent based solutions and BL Chromate formulation and traits and the plating process. This assignment will require hands-on management of the project to identify, plan, track, and complete projects. The process will be documented and presented to commercial leadership at the end of the 12-week program. A Day In The Life At Howmet… In addition to your impact project work, you’ll have the opportunity to: Review and update plating processes Opportunity to connect with leadership on the opportunities and improvement ideas Recommend any necessary changes to the Plating process Qualifications QUALIFICATIONS Currently enrolled in an accredited Bachelor's degree in Materials Science & Engineering, Business, or Chemistry with an expected graduation date in Fall 2025 or Spring 2026. Minimum cumulative GPA of 3.0 or equivalent Demonstrated internship, work, research, or extracurricular participation Must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position. This position is subject to the International Traffic in Arms Regulations (ITAR) which requires U.S. person status. Compensation for this internship opportunity ranges between $23-$25 per hour. (Actual compensation is subject to variation due to factors such as education, experience, skillset, and/or location). About Us About Howmet Aerospace Howmet Aerospace Inc. (NYSE: HWM), headquartered in Pittsburgh, Pennsylvania, is a leading global provider of advanced engineered solutions for the aerospace and transportation industries. Our primary businesses focus on jet engine components, aerospace fastening systems, titanium structural parts and forged wheels. With $6.6 billion in revenue in 2023, our products play a crucial role in enabling fuel efficiency and lightweighting, contributing to our customers’ success and making a positive impact on the world. To learn more about the way Howmet Aerospace Inc. is advancing the sustainability of our customers, markets, and communities where we operate, review the 2023 Environmental Social and Governance report at www.howmet.com/esg-report . Follow: LinkedIn , Twitter , Instagram , Facebook , and YouTube . Howmet is proud to be an Equal Employment Opportunity and Affirmative Action employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or other applicable legally protected characteristics. If you need assistance to complete your application due to a disability, please email TalentAcquisitionCoE_Howmet@howmet.com"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Western Digital", "company_link": "https://www.linkedin.com/company/western-digital/life", "job_title": "Summer 2025 Intern, Chemical Integration Engineer", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:26:52", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4106444797/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=qcmy3K7XIXSTHEZCOdTJ%2FQ%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Salary Range: 0.00-0.00 Company Description At Western Digital, our vision is to power global innovation and push the boundaries of technology to make what you thought was once impossible, possible. At our core, Western Digital is a company of problem solvers. People achieve extraordinary things given the right technology. For decades, we’ve been doing just that. Our technology helped people put a man on the moon. We are a key partner to some of the largest and highest growth organizations in the world. From energizing the most competitive gaming platforms, to enabling systems to make cities safer and cars smarter and more connected, to powering the data centers behind many of the world’s biggest companies and public cloud, Western Digital is fueling a brighter, smarter future. Binge-watch any shows, use social media or shop online lately? You’ll find Western Digital supporting the storage infrastructure behind many of these platforms. And, that flash memory card that captures and preserves your most precious moments? That’s us, too. We offer an expansive portfolio of technologies, storage devices and platforms for business and consumers alike. Our data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk® and WD® brands. Today’s exceptional challenges require your unique skills. It’s You & Western Digital. Together, we’re the next BIG thing in data. Job Description Hard Disk drives are remarkable devices in which the reader/writer “flies” approximately 1nm above a disk at speeds up to 80 miles per hour in a sealed enclosure. Reliable long-term drive operation does not happen by accident. Chemical Integration is responsible for ensuring the materials in the drive are chemically compatible over the life of the drive, which requires selecting materials that produce minimal amounts of outgassing and particle generation, engineering the ability to filter out chemicals and particles before they cause trouble, and developing strategies to maintain gas and humidity content of the drive environment within specified limits for several years. WD is hiring an engineering intern for Chemical Integration activities in our HDD Product Development Engineering team. Ideal candidates will have recently earned or are pursuing a BS or advanced degrees in related scientific fields. The Chemical Integration Internship Responsibilities Include Learn and understand disk drives and components. Measure gas composition in sealed disk drives and in test containers. Perform analytical measurements on particle and organic filtration inside the drives. Interact with the mechanical team to optimize the design for best filtration performance. Qualifications Applicants should have three or more years in college toward a degree in Material Science, Chemical Engineering, Chemistry or related scientific fields. Candidates for an advanced degree in the related fields are preferred. Applicant should have had exposure to concepts of absorption, adsorption, and equilibrium versus rate-dependent phenomena, and should have strong hands-on laboratory experience. Exposure to particle size and particle counting measurement equipment is a plus. Experience in programming and mathematical tools will be helpful. Additional Information Western Digital is committed to providing equal opportunities to all applicants and employees and will not discriminate based on their race, color, ancestry, religion (including religious dress and grooming standards), sex (including pregnancy, childbirth or related medical conditions, breastfeeding or related medical conditions), gender (including a person’s gender identity, gender expression, and gender-related appearance and behavior, whether or not stereotypically associated with the person’s assigned sex at birth), age, national origin, sexual orientation, medical condition, marital status (including domestic partnership status), physical disability, mental disability, medical condition, genetic information, protected medical and family care leave, Civil Air Patrol status, military and veteran status, or other legally protected characteristics. We also prohibit harassment of any individual on any of the characteristics listed above. Our non-discrimination policy applies to all aspects of employment. We comply with the laws and regulations set forth in the Equal Employment Opportunity is the Law poster. Western Digital thrives on the power and potential of diversity. As a global company, we believe the most effective way to embrace the diversity of our customers and communities is to mirror it from within. We believe the fusion of various perspectives results in the best outcomes for our employees, our company, our customers, and the world around us. We are committed to an inclusive environment where every individual can thrive through a sense of belonging, respect and contribution. Western Digital is committed to offering opportunities to applicants with disabilities and ensuring all candidates can successfully navigate our careers website and our hiring process. Please contact us at staffingsupport@wdc.com to advise us of your accommodation request. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying. Compensation & Benefits Details An employee’s pay position within the salary range may be based on several factors including but not limited to (1) relevant education; qualifications; certifications; and experience; (2) skills, ability, knowledge of the job; (3) performance, contribution and results; (4) geographic location; (5) shift; (6) internal and external equity; and (7) business and organizational needs. The salary range is what we believe to be the range of possible compensation for this role at the time of this posting. We may ultimately pay more or less than the posted range and this range is only applicable for jobs to be performed in California, Colorado, New York or remote jobs that can be performed in California, Colorado and New York. This range may be modified in the future. If your position is non-exempt, you are eligible for overtime pay pursuant to company policy and applicable laws. You may also be eligible for shift differential pay, depending on the shift to which you are assigned. You will be eligible to participate in Western Digital’s Short-Term Incentive (STI) Plan, which provides incentive awards based on Company and individual performance. Depending on your role and your performance, you may be eligible to participate in our annual Long-Term Incentive (LTI) program, which consists of restricted stock units (RSUs) or cash equivalents, pursuant to the terms of the LTI plan. Please note that not all roles are eligible to participate in the LTI program, and not all roles are eligible for equity under the LTI plan. RSU awards are also available to eligible new hires, subject to Western Digital’s Standard Terms and Conditions for Restricted Stock Unit Awards. We offer a comprehensive package of benefits including paid vacation time; paid sick leave; medical/dental/vision insurance; life, accident and disability insurance; tax-advantaged flexible spending and health savings accounts; employee assistance program; other voluntary benefit programs such as supplemental life and AD&D, legal plan, pet insurance, critical illness, accident and hospital indemnity; tuition reimbursement; transit; the Applause Program; employee stock purchase plan; and the Western Digital Savings 401(k) Plan. Note: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, commission, benefits, or any other form of compensation and benefits that are allocable to a particular employee remains in the Company's sole discretion unless and until paid and may be modified at the Company’s sole discretion, consistent with the law."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "General Atomics", "company_link": "https://www.linkedin.com/company/general-atomics/life", "job_title": "Intern - Assembly, Integration, and Test Engineering", "location": "Not Found", "posted_on": "11 hours ago as per the 2024-12-31 10:26:57", "applicant": "18 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4112970346/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=wR%2BbLSzSTkJAKC6V3u7DYA%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Job Summary General Atomics Aeronautical Systems, Inc. (GA-ASI), an affiliate of General Atomics, is a world leader in proven, reliable remotely piloted aircraft and tactical reconnaissance radars, as well as advanced high-resolution surveillance systems. We have an exciting opportunity for an Undergraduate Intern with a field of study in Mechanical Engineering to join our Electromagnetic Systems team in Huntsville, Alabama! DUTIES AND RESPONSIBILITIES: Under general supervision, participates in the day-to-day activities of assigned functional area assisting in the completion of routine and non-routine tasks. Assists in applying knowledge to analyze, investigate and resolve problems. Assists in developing electronic and hard copy reports, records, diagrams and charts. Responsible for observing all laws, regulations and other applicable obligations wherever and whenever business is conducted on behalf of the Company. Expected to work in a safe manner in accordance with established operating procedures and practices. We recognize and appreciate the value and contributions of individuals with diverse backgrounds and experiences and welcome all qualified individuals to apply. Job Qualifications Desired Skills: Mechanical Engineering. Requires active enrollment and currently attending as an undergraduate student at a recognized college or university. Applicants who will have completed their undergraduate degree by the time the internship program would begin, must be planning to continue in a graduate program immediately following the conclusion of the internship program. 3.0 cumulative GPA preferred Ability to understand new concepts and apply them accurately. Ability to follow general and detailed instructions as well as organizational policies and procedures. Basic communication and interpersonal skills to enable effective interface with internal professionals. Ability to work independently or in a team environment. Basic computer skills. This position pays at an hourly rate of $29.00 - $31.00/hr., depending on your specific field of study and the number of college years completed. Job Type: Full-Time Hourly Salary range: 44,590 - 66,295"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "ZEISS Group", "company_link": "https://www.linkedin.com/company/zeiss/life", "job_title": "Summer Intern: Field Service Engineer (Texas)", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:27:02", "applicant": "49 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4104838355/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=XVhmcq3deR%2Bs7RNL%2FCDvyQ%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job About Us: How many companies can say they’ve been in business for over 177 years?! Here at ZEISS, we certainly can! As the pioneers of science, ZEISS handles the everchanging environments in a fast-paced world, meeting it with cutting edge of technologies and continuous advancements. ZEISS believes that innovation and technology are the key to a sustainable future and solutions for global change. We have a diverse range of portfolios throughout the ZEISS family in segments like, Industrial Quality & Research, Medical Technology, Consumer Markets and Semiconductor Manufacturing Technology. We are a global company with over 42,000 employees and have over 4,000 in the US and Canada alone! Make a difference, come join the team! Location/Region: This position is located in Texas. What’s the role? As a Field Service Engineer Intern, you’ll undergo technical training and on-the-job experiences designed to prepare you for success. Sound Interesting? Here’s what you’ll do: Successfully completing technical training to acquire foundational knowledge of ZEISS microscopy equipment. Demonstrating technical proficiency by applying classroom concepts in real-world settings. Participating actively in on-the-job training (OJT), assisting experienced FSEs, and working in customer environments. Caring for ZEISS tools and equipment with a commitment to safety and operational excellence. Delivering a presentation at the end of the program to showcase your learning and contributions. Do you qualify? Must be local to Texas. Passion for electronics, mechanics, and problem-solving. Interest or experience in technical repair and troubleshooting. Strong interpersonal and communication skills for customer interactions. Dedication to learning and the ability to adapt to a fast-paced environment. Currently enrolled in a 4-year undergraduate or graduate degree program in a technical or scientific discipline, or possess equivalent experience. Demonstrated eagerness to learn and troubleshoot across multiple domains, including software, electronics, optics, electron optics, high voltage, high vacuum, mechanical, and electro-mechanical systems. Proven ability to work effectively both as an individual contributor and as part of a collaborative team. Additional Details This is a customer-facing role that involves travel to various lab and institutional locations. Adherence to ZEISS Corporate Travel Policy and safety standards is required. The internship culminates with a presentation to peers and management, highlighting your growth and achievements. The hourly pay range for this position is $20.00 The pay offered for this role may be influenced by factors such as job location, scope of role, qualifications, education, experience, & complexity/specialization/scarcity of talent. Your ZEISS Recruiting Team: Maria Khalil Zeiss provides Equal Employment Opportunity without unlawful regard to an Applicants race, color, religion, creed, sex, gender, marital status, age, national origin or ancestry, physical or mental disability, medical condition, military or veteran status, citizen status, sexual orientation, pregnancy (includes childbirth, breastfeeding or related medical condition), genetic predisposition, carrier status, gender expression or identity, including transgender identity, or any other class or characteristic protected by federal, state, or local law of the employee (or the people with whom the employee associates, including relatives and friends)."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Sungrow Europe", "company_link": "https://www.linkedin.com/company/sungroweurope/life", "job_title": "Product Operation Intern - Germany", "location": "Not Found", "posted_on": "2 weeks ago as per the 2024-12-31 10:27:07", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4095512528/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=MbdGHbNBbPmDuKR4Q0QMkQ%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Your mission Hey there and welcome to your new Opportunity with us. Being a Product Operation Intern Is An Exciting Task, Since You Are The Superhero Our Clients Need. You Know What Setup Of Our Solutions Will Satisfy Their Needs, Therefore, These Here Are Your Most Important Tasks Support for app and web product launches, including communication between HQ and EU (planning, testing, training, and promoting). User database collection and maintenance. Collaborate with UXUI designers to support user research and testing. Increase and maintain user satisfaction rates. Operational Data Analysis. Your profile About All right, all right, so I hope you are now aware of what is up for you, what background should you have in order to feel comfortable with this role? Keep in mind it`s all about electrical equipment, that`s why it is essential for you to have: Need to be careful, patient and responsible to do daily operation tasks and paper work. Basic Knowledge for Microsoft office or similar software like PowerBI. Strong communication skills, and comfortable for intercultural communication. Business/Marketing/Technical experience and background is preferred. Why us? We are Smart Energy team! A multinational team awaits You with lots of European and International exchange. Flexible working hours, Height-adjustable desks, Free snacks, drinks & team lunch. Professional onboarding, Individual trainings, Inspiration on events. Sunrise industry, Attractive salary, Startup atmosphere. Modern office near Ostbahnhof & Werksviertel - Close to a lot of restaurants & bars. About Us We are a green tech company with young creative minds. We are fighting every day to make our mission happen – Clean Power for All! With 500+GW of clean power presently installed worldwide, we are on the road to success! Welcome at Sungrow Founded in 1997 by University Professor Cao Renxian, Sungrow is a leader in the research and development of solar inverters with the largest dedicated R&D team in the industry and a broad product portfolio offering PV inverter solutions and energy storage systems for utility-scale, commercial & industrial, and residential applications, as well as internationally recognized floating PV plant solutions, NEV driving solutions, EV charging solutions and renewable hydrogen production systems. Want to know more? Check out what working with us is like!"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "ASML", "company_link": "https://www.linkedin.com/company/asml/life", "job_title": "Internship- Manufacturing Production Engineer Intern- Tainan", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:27:12", "applicant": "14 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4102275539/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=f7cUHyyyO6%2FY08Pj5rRlHw%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job finance / accounting background or experience with budget planning is preferred assist routine / daily chores such as documentation, meeting minutes...etc. support on tasks assigned by direct manager or associate stakeholders collaborate with colleague engineers when necessary Diversity and inclusion ASML is an Equal Opportunity Employer that values and respects the importance of a diverse and inclusive workforce. It is the policy of the company to recruit, hire, train and promote persons in all job titles without regard to race, color, religion, sex, age, national origin, veteran status, disability, sexual orientation, or gender identity. We recognize that diversity and inclusion is a driving force in the success of our company. Need to know more about applying for a job at ASML? Read our frequently asked questions."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Accolade, Inc.", "company_link": "https://www.linkedin.com/company/accolade-inc-/life", "job_title": "SEO Intern", "location": "Not Found", "posted_on": "5 hours ago as per the 2024-12-31 10:27:17", "applicant": "11 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4111097829/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=t80VYQevAvk6vli7zFiJpw%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job About Accolade Accolade (Nasdaq: ACCD) provides millions of people and their families with an exceptional healthcare experience that is personal, data driven and value based to help every person live their healthiest life. Accolade solutions combine virtual primary care, mental health support and expert medical opinion services with intelligent technology and best-in-class care navigation. Accolade’s Personalized Healthcare approach puts humanity back in healthcare by building relationships that connect people and their families to the right care at the right time to improve outcomes, lower costs and deliver consumer satisfaction. Accolade consistently receives consumer satisfaction ratings over 90%. For more information, visit accolade.com. Compensation for this position is set at $31/hour. This person will need to work hybrid from our Seattle, WA office location three days per week. Accolade's internship program runs June 9th-August 15th, 2025. Role Overview The SEO intern will be critical in supporting both Accolade and PlushCare.com by driving organic traffic, improving brand visibility, and enhancing the user experience across both platforms. This position will directly contribute to achieving corporate objectives of customer acquisition, brand growth, and improved online engagement. In addition to these responsibilities, the SEO intern will have the opportunity to learn a wide range of SEO skills, from technical optimization to content strategy, that will help evolve their career in digital marketing. Working across both Accolade and PlushCare.com will provide valuable, hands-on experience in the healthcare and SEO sectors, positioning the intern for future career growth in the field of search engine optimization and digital marketing. A day in the life… Conduct keyword research and analysis to identify opportunities for content optimization. Support the creation of SEO-friendly content by working with content teams to ensure best practices are followed. Help with technical SEO tasks, such as optimizing meta tags, fixing broken links, and improving page load times. Track and analyze SEO performance metrics and provide reports to stakeholders. What We Are Looking For (requirements) Has or is working towards a Bachelors degree in Marketing, Computer Science or Sales. Ability to come in person to our Seattle office at least 3 times a week. Basic Understanding of SEO Principles: The intern should have foundational knowledge of search engine optimization, including on-page SEO, keyword research, and content optimization. Familiarity with SEO tools like Google Analytics, SEMrush, or Moz is a plus. Strong Analytical Skills: The ability to analyze data, identify trends, and interpret metrics is crucial for measuring SEO performance. The intern should be comfortable working with data to support decision-making and track the success of SEO strategies. Excellent Communication and Writing Skills: The intern should be able to write clearly and effectively, as they will assist in content optimization and may collaborate with content creators. Strong written communication is also important for crafting meta descriptions, page titles, and reporting SEO findings. Attention to Detail and Organizational Skills: SEO involves meticulous work, from identifying technical issues to optimizing content. The intern should have a strong eye for detail and be highly organized to manage tasks such as monitoring changes, auditing pages, and ensuring accuracy in all SEO efforts. Our people are the Heart of Accolade Together, we Are Building a Great And Enduring Business that Truly Makes An Impact. At Accolade, We Are Committed To Building A workplace Where All Can Grow And Thrive.  We Do This By Living Our Core Values Member Obsessed For everything we do, we ask ourselves: Is this going to make our member’s life measurably better? Be Fearless We think differently. We do what’s never been done. We are reinventing healthcare every step of the way. Stronger Together We honor the differences among one another and know that our unique perspectives drive us forward. Genuine Care We care deeply about the human beings we work with and serve. We have each other’s back. Embrace Reality We bring the data, tell the truth, and trust each other. Relentless Execution We operate with a bias for action. Take initiative, move fast & have fun. Accolade is committed to being a company that embraces a hybrid work environment where employees can enjoy the best of both worlds - the flexibility to work from home and the opportunity to have a common place to connect, collaborate, and innovate with others in-person. Our hybrid work model requires that employees who live within 40 miles of an Accolade office are required to be in the office for at least two days during the work week. Accolade will provide reasonable accommodation to qualified employees with disabilities or for a sincerely held religious belief. Accolade is an Equal Opportunity and Affirmative Action Employer committed to advancing an inclusive environment for all qualified applicants and employees. We provide employment opportunities, without regard, to any legally protected status in accordance with applicable laws in the US. We are committed to help ensure you have a comfortable and positive interview experience. Accolade, Inc., PlushCare, Inc., and Accolade 2ndMD LLC will never ask you to pay to get a job. Anyone who does this is a scammer. Further, we will never send you a check and ask you to send on part of the money or buy gift cards with it. These are also scams. If you see or lose money to a job scam, report it to the Federal Trade Commission at ReportFraud.ftc.gov. You can also report it to your state attorney general. To review our policy around data use, visit our Accolade Privacy Policy Page. All your information will be kept confidential according to EEO guidelines. Accolade"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Applied Materials", "company_link": "https://www.linkedin.com/company/applied-materials/life", "job_title": "2025 Summer Mechanical Engineer Intern (Austin, TX)", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:27:22", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4106537930/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=hW7U9XTSJcojCyS34Fz%2BiQ%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Who We Are Applied Materials is the global leader in materials engineering solutions used to produce virtually every new chip and advanced display in the world. We design, build and service cutting-edge equipment that helps our customers manufacture display and semiconductor chips – the brains of devices we use every day. As the foundation of the global electronics industry, Applied enables the exciting technologies that literally connect our world – like AI and IoT. If you want to work beyond the cutting-edge, continuously pushing the boundaries of science and engineering to make possible the next generations of technology, join us to Make Possible® a Better Future. At Applied, we prioritize your well-being and encourage you to bring your best self to work. Your happiness, health, and resiliency are at the core of our benefits and wellness programs. Our robust total rewards package makes it easier to take care of your whole self and your whole family. We’re committed to providing programs and support that encourage personal and professional growth and care for you at work, at home, or wherever you may go. Learn more about our Benefits. Applied Materials’ Austin Engineering Department is searching for an intern to join our team in summer 2025! Research and rapid development group designing, procuring, testing, and iterating prototype parts as part of a team including physicists, EEs, and software experts. The position will entail the following: CAD modeling in Creo or Solidworks Mechanical design and FEA of components Working with suppliers on rapid prototyping and best manufacturing methods Designing experiments to test prototype assembly and iterate/improve design as needed Requirements Student must be pursuing a Bachelor's or Master’s degree program in Mechanical Engineering Student must be in good academic standing at their university, with a preferred GPA of 3.0 or above on a 4.0 scale Experience in semiconductor processing or manufacturing preferred Quick learner Compensation $29 - 37 per hour The salary offered to a selected candidate will be based on a number of factors including location and education level and will vary depending on confirmed job-related knowledge, skills, and experience Applied Materials is committed to diversity in its workforce including Equal Employment Opportunity for Minorities, Females, Protected Veterans and Individuals with Disabilities. Qualifications Education: Skills: Certifications: Languages: Years of Experience: Work Experience: Additional Information Time Type: Full time Employee Type: Intern / Student Travel: Yes, 10% of the Time Relocation Eligible: Yes Applied Materials is an Equal Opportunity Employer committed to diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, national origin, citizenship, ancestry, religion, creed, sex, sexual orientation, gender identity, age, disability, veteran or military status, or any other basis prohibited by law."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Chevron", "company_link": "https://www.linkedin.com/company/chevron/life", "job_title": "Sales & Trading Intern", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:27:27", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4104521081/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=4jHihjK7lBcptmu9ZyPBZA%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Total Number of Openings 1 Performs work for the functions/groups to which these students or recent graduates are assigned. (Note: Interns in this Job Category are not paid for overtime. U.S. payroll interns who are in this Job Category need to be performing work that exempts them from the requirements of the Fair Labor Standards Act (FLSA). Contact HR-Total Rewards for guidance.) Supports clients/customers and assists with functional projects under regular supervision. Has a general knowledge of the work function. About Chevron Renewable Energy Group Inc. (CREG) Would you like to get hands on experience in the energy transition at one of the world’s largest renewable fuel producers? At the Chevron Renewable Energy Group we work on creating a sustainable future the transportation sector. Our 2 German and 9 US biofuel plants produce high quality biofuels from (waste) feedstocks. About The Position We are looking for an intern to support our trading team in the Amsterdam office. You will closely work together with the Traders, analysts, operators and other departments. We aim to create an environment in which you can observe, develop and contribute from the start. Your main responsibilities will be: Trading support & analysis Analyze environmental commodity markets and highlight trading opportunities Maintain and improve market models Perform ad hoc reporting, new counterparties onboarding, know your customer (KYC) request Analyze strategic opportunities and challenges for the corporation and business units What are we looking for? Data driven: strong quantitative and financial analysis skills Demonstration of eagerness to learn and attention to detail Bachelor’s or Master’s degree in Business, Finance, Economics, Engineering, Marketing or a related degree What do we offer? Exciting learning experience in the environmental commodities field Diverse working environment with colleagues from all over the world Full-time internship position with competitive allowance and a duration of 3 to 8 months Further learning and training opportunities CREG values inclusivity and promotes a workplace that actively seeks to welcome contributions from all people. We encourage people of all genders, diverse cultures, abilities, backgrounds, LGBTQIA+ identities, and all age groups to apply. We are committed to building a safe and respectful workplace where everyone is valued for their contribution. This internship description in no way states or implies that these are the only duties to be performed by this intern, who will be required to follow any other instructions and to perform any other duties requested by their supervisor. Chevron participates in E-Verify in certain locations as required by law."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "BioSpace", "company_link": "https://www.linkedin.com/company/biospaceinc/life", "job_title": "Summer Intern - Gene Therapy Research", "location": "Not Found", "posted_on": "Reposted 2 weeks ago as per the 2024-12-31 10:27:32", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4096513698/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=wTOYS91NNKhO9w49%2FiaWaQ%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Company Description Insmed is a global biopharmaceutical company on a mission to transform the lives of patients living with serious and rare diseases. Our most valuable resource is our employees, and everything we do is motivated by a patients-first mentality. We are dedicated to growing our team with talented individuals from around the world who are willing to challenge the status quo, solve problems, and work collaboratively with a sense of urgency and compassion. Guided by our core values of collaboration, accountability, passion, respect, and integrity, we aim to foster an inclusive, diverse, and flexible work environment, where our employees are recognized for leaning in and rolling up their sleeves. If you share our vision and want to work with the most dedicated people in the biopharma industry, come to Insmed to accelerate your career. Recognitions Consistently Ranked Science's Top Employer Insmed is dedicated to creating a collaborative environment where our team can thrive. Every day, our employees turn their passion for science and research into innovative solutions for patients. That's why we've been named the No. 1 company to work for in the biopharma industry in Science's Top Employers survey for four years in a row. A Certified Great Place to Work® We believe our company is truly special, and our employees agree. In July 2024, we became Great Place to Work-certified in the U.S. for the fourth year in a row. We are also honored to have been listed on the Best Workplaces in Biopharma™, Best Workplaces in New York™, PEOPLE® Companies That Care, Best Workplaces for Women™, Best Workplaces for Millennials™, and Best Medium Workplaces™ lists. Overview The Insmed Summer Internship Program gives students an opportunity to gain hands-on experience in a corporate environment in the pharmaceutical industry, receive mentoring from highly skilled professionals, and work on dynamic team projects. Our 2025 Summer Intern program is a full-time (40 hours per week), paid internship. The internship may present opportunities for rotational assignments within the function, and the intern will be assigned goals and objectives that will support the strategic business plan of the company. Intern will partner with gene therapy research and development scientists to conduct novel research related to therapeutic gene therapy. Skills in molecular and cellular biology and biochemistry will be utilized. Responsibilities Conduct experiments and analyze data under the direction of a supervising scientist. Cloning of expression vectors and analysis of DNA sequences. Utilize PCR to analyze gene expression. Mammalian cell culture and transfection. Characterization of biomolecules with analytical method, biological assays, spectroscopy and molecular biology methods. Qualifications Interested in pursuing a career in the pharmaceutical industry Currently in full-time pursuit of a Bachelor's or Master's degree in biology, microbiology, cell biology, pharmaceutics, or related field. High level understanding of molecular and cellular biology Experience working in a research laboratory is desired. Self-motivation and enthusiasm for research. Ability to work independently. Must have excellent communication skills (verbal and written). Highly organized with a strong attention to detail, clarity, accuracy and conciseness. Highly proficient in Microsoft Office (Word, Excel, PowerPoint, Outlook). Must successfully exhibit Insmed's five (5) corporate values: Collaboration, Accountability, Passion, Integrity & Respect; along with any other position specific competencies. Individuals must demonstrate the ability to interact successfully in a dynamic and culturally diverse workplace. Salary Range $23 - $24 an hour Compensation & Benefits Eligible for paid company holidays during the intern program. Additional Information Insmed Incorporated is an affirmative action and equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, disability, age, sexual orientation, gender identity, national origin, veteran status, or genetic information or any other characteristic protected by law. Insmed is committed to providing access, equal opportunity, and reasonable accommodation for individuals with disabilities in employment, its services, programs, and activities. To request reasonable accommodation to participate in the job application or interview process, please contact us by email at TotalRewards@insmed.com and let us know the nature of your request and your contact information. Requests for accommodation will be considered on a case-by-case basis. Please note that only inquiries concerning a request for reasonable accommodation will be responded to from this email address. Unsolicited resumes from agencies should not be forwarded to Insmed. Insmed will not be responsible for any fees arising from the use of resumes through this source. Insmed will only pay a fee to agencies if a formal agreement between Insmed and the agency has been established. The Human Resources department is responsible for all recruitment activities; please contact us directly to be considered for a formal agreement. Applications are accepted for 5 calendar days from the date posted or until the position is filled."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Sensata Technologies", "company_link": "https://www.linkedin.com/company/sensata-technologies/life", "job_title": "Process Development Intern", "location": "Not Found", "posted_on": "3 weeks ago as per the 2024-12-31 10:27:37", "applicant": "10 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4091425424/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=FAAX8wCyhQpxZFG3Y03GEw%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Supports the Process Development Engineering Department in their daily activities. Responsibilities: Work closely with Process Development Engineers on product and process development projects Support and conduct process qualifications of new equipment according the required specifications Research new techniques and solutions to problems experienced during process developments/improvements Create reports on process development and equipment validations Participate into improvement projects Works with Web-based internal portals Requirements: 3rd or 4th year student, or recent graduate in Engineering; Very good English language skills; Good oral and written communication skills Goal-oriented and organized person with ability to handle multiple tasks SmarterTogether Collaborating at Sensata means working with some of the world’s most talented people in an enriching environment that is constantly pushing towards the next best thing Employees work across functions, countries and cultures gaining new perspectives through mutual respect and open communication As OneSensata, we are working together to make things work together Click here to view Sensata Recruitment Privacy Statement Click here to view our Sensata Recruitment Privacy Statement for China NOTE: If you are a current Sensata employee (or one of our Affiliates), please back out of this application and log into Workday via the Company Intranet to apply directly. Type \"FIND JOBS\" in the Workday search bar."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "ZEISS Group", "company_link": "https://www.linkedin.com/company/zeiss/life", "job_title": "Summer Intern: Field Service Engineer (New York)", "location": "Not Found", "posted_on": "2 weeks ago as per the 2024-12-31 10:27:42", "applicant": "65 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4098740935/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=%2F7kSQs%2BNBg72J4LXREO%2F4g%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job About Us: How many companies can say they’ve been in business for over 177 years?! Here at ZEISS, we certainly can! As the pioneers of science, ZEISS handles the everchanging environments in a fast-paced world, meeting it with cutting edge of technologies and continuous advancements. ZEISS believes that innovation and technology are the key to a sustainable future and solutions for global change. We have a diverse range of portfolios throughout the ZEISS family in segments like, Industrial Quality & Research, Medical Technology, Consumer Markets and Semiconductor Manufacturing Technology. We are a global company with over 42,000 employees and have over 4,000 in the US and Canada alone! Make a difference, come join the team! Location/Region: This position is located in New York. What’s the role? As a Field Service Engineer Intern, you’ll undergo technical training and on-the-job experiences designed to prepare you for success. Sound Interesting? Here’s what you’ll do: Successfully completing technical training to acquire foundational knowledge of ZEISS microscopy equipment. Demonstrating technical proficiency by applying classroom concepts in real-world settings. Participating actively in on-the-job training (OJT), assisting experienced FSEs, and working in customer environments. Caring for ZEISS tools and equipment with a commitment to safety and operational excellence. Delivering a presentation at the end of the program to showcase your learning and contributions. Do you qualify? Must be local to New York. Passion for electronics, mechanics, and problem-solving. Interest or experience in technical repair and troubleshooting. Strong interpersonal and communication skills for customer interactions. Dedication to learning and the ability to adapt to a fast-paced environment. Currently enrolled in a 4-year undergraduate or graduate degree program in a technical or scientific discipline, or possess equivalent experience. Demonstrated eagerness to learn and troubleshoot across multiple domains, including software, electronics, optics, electron optics, high voltage, high vacuum, mechanical, and electro-mechanical systems. Proven ability to work effectively both as an individual contributor and as part of a collaborative team. Additional Details This is a customer-facing role that involves travel to various lab and institutional locations. Adherence to ZEISS Corporate Travel Policy and safety standards is required. The internship culminates with a presentation to peers and management, highlighting your growth and achievements. The hourly pay range for this position is $20.00 The pay offered for this role may be influenced by factors such as job location, scope of role, qualifications, education, experience, & complexity/specialization/scarcity of talent. Your ZEISS Recruiting Team: Maria Khalil Zeiss provides Equal Employment Opportunity without unlawful regard to an Applicants race, color, religion, creed, sex, gender, marital status, age, national origin or ancestry, physical or mental disability, medical condition, military or veteran status, citizen status, sexual orientation, pregnancy (includes childbirth, breastfeeding or related medical condition), genetic predisposition, carrier status, gender expression or identity, including transgender identity, or any other class or characteristic protected by federal, state, or local law of the employee (or the people with whom the employee associates, including relatives and friends)."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "CooperSurgical", "company_link": "https://www.linkedin.com/company/coopersurgical/life", "job_title": "Manufacturing Engineer Intern (multiple positions available)", "location": "Not Found", "posted_on": "2 weeks ago as per the 2024-12-31 10:27:47", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4102154448/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=NkSsU%2BQ%2B%2BeHBx5rFzFXttg%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Job Description The Manufacturing Engineer Intern is responsible for optimizing manufacturing processes and ensuring the production of high-quality medical devices. The Manufacturing Engineer Intern will gain hands-on experience in continuous improvement, root cause analysis, project management, and the sustaining of manufacturing devices and manufacturing processes. The Manufacturing Engineer Intern will contribute to initiatives that reduce costs and increase the quality of CooperSurgical’s manufacturing processes. Responsibilities Essential Functions & Accountabilities: Assist in the design and development of efficient manufacturing processes for medical device products, with a focus on quality, cost-effectiveness, and scalability. Assist in optimizations of new and existing manufacturing processes through the application of lean manufacturing principles to improve efficiency, yield, and productivity while maintaining compliance with regulatory and quality standards Conduct process validations, process capability studies, and root cause analyses to identify and resolve manufacturing issues, implementing corrective actions as needed. Assist in the development of project plans and proposals that include elements such as Gantt charts, cost-benefit analysis, risk assessments, and regulatory strategies. Assist in sustaining activities such as executing change orders for existing products and processes, investigating non-conformances in the product and process, and supporting maintenance and calibration technicians. Collaborate with R&D teams to ensure new products are designed for manufacturability, considering assembly methods, equipment selection, and process validation requirements. Contribute to the fostering of a culture of knowledge sharing and professional development. Develop and maintain manufacturing documentation, including work instructions, standard operating procedures, and process control plans, ensuring compliance with regulatory requirements. Support the manufacturing floor via partnering with maintenance engineers and technicians to resolve day-to-day downtime. Qualifications Qualifications, Knowledge, Skills and Abilities: Introductory knowledge of manufacturing processes, equipment, and quality control techniques Strong computer skills with the ability to use Excel, Word, PowerPoint, and Visio. Experience with data analysis (Excel, Minitab) Ability to demonstrate problem-solving skills and the ability to work effectively in a team environment. Excellent communication skills, both verbal and written, with the ability to convey complex technical information to diverse audiences. Work Environment: Occasional lifting of up to 35 kilograms may be required. Prolonged sitting in front of a computer is common. Ability to work in uncomfortable positions, when required. For example, when repairing various manufacturing equipment. Education: Current University student in their junior or senior year pursing a bachelor’s degree in mechanical engineering, Electrical Engineering, Industrial Engineering, Plastics Engineering, Biomedical Engineering or a related field."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Keeta", "company_link": "https://www.linkedin.com/company/keetaglobal/life", "job_title": "Talent Acquisition Intern", "location": "Not Found", "posted_on": "1 day ago as per the 2024-12-31 10:27:52", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4111558518/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=83U52HYHaEWr54JbGqev3g%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job About Keeta Keeta is an independent brand of Meituan, the world's largest tech-driven retail company. We focus on food and consumer product delivery services in international markets with the mission: \"We help people eat better, live better\". Established in March 2010, Meituan has helped transform the supply and demand of service and product retail across the digital landscape. As Meituan and Keeta continue to increase R&D investment and advance in new technologies, we uphold a customer-centric approach, working with our partners to provide quality services to customers. About the Opportunity We are offering an exciting training opportunity for aspiring HR professionals to gain hands-on experience in talent acquisition. As a Talent Acquisition Intern, you will work closely with our HR team to support recruitment efforts, learn about sourcing strategies, and assist in attracting top talent to our growing team. Responsibilities Assist in posting job advertisements and screening resumes. Coordinate and schedule interviews with candidates. Support the recruitment team in sourcing candidates through various platforms. Maintain candidate records and ensure a seamless hiring process. Qualifications Currently pursuing or recently graduated with a degree in HR, Business Administration, or a related field. Strong communication and organizational skills. Passion for recruitment and talent acquisition. Proficiency in MS Office and familiarity with LinkedIn is a plus."}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Amazon", "company_link": "https://www.linkedin.com/company/amazon/life", "job_title": "2025 Sourcing Recruiter Intern - Canada", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:27:57", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4102263363/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=9w0pV1oHxzOGFtkRt6VZbw%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Description Please note the following eligibility requirements to apply for this role: Graduate from Bachelor's degree program between 12/2025 and 6/2026. Ability to relocate within Canada. Relocation assistance provided, if eligible. Ability to complete 12-week internship between May – August 2025. We are unable to offer visa sponsorship for this role. Successful sourcers utilize their experience in setting benchmarks, forecasting and tracking against metrics, and prioritizing to hit customer goals. They thrive in an innovative, fast-paced environment, can roll up their sleeves, work hard, and have fun to get the job done. They draw on knowledge of Talent Acquisition and functional areas of the business, forging dynamic relationships with business leaders and hiring managers. Key job responsibilities Candidates must be able to successfully manage, prioritize, and fulfill job searches against a timeline and have experience setting benchmarks and metrics. They must understand how to prioritize and achieve SLAs. The best candidates will draw on knowledge of talent acquisition and tech roles and areas of the business, forging dynamic relationships with business leaders, hiring managers, and HR business partners. They have a reputation for being exceptional at candidate generation, client/account management, strong organizational skills, possess strong verbal and written communication skills, have an ability to prioritize their time, demonstrate a sense of urgency, and understand the value of providing amazing customer service. Basic Qualifications Are 18 years of age or older Work 40 hours/week throughout the course of a 12-week summer internship between May through September Currently enrolled in a bachelor’s degree program with a graduation conferral date between December 2025 and June 2026 Preferred Qualifications Work, internship, or other leadership experience in a professional environment Strong academic, leadership and/ or extracurricular record Majors/concentrations in HR Management, Organizational Development, business administration, or related fields Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status. Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner. Company - Amazon.com.ca, ULC - A49 Job ID: A2854657"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Grozeo UK", "company_link": "https://www.linkedin.com/company/grozeouk/life", "job_title": "SEO Intern", "location": "Not Found", "posted_on": "1 day ago as per the 2024-12-31 10:28:02", "applicant": "30 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4112295552/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=aPk8Q0RJ%2FzIeoo8CHRQ3zA%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Join the Grozeo UK Digital Marketing Internship Program as an SEO Intern Are you passionate about search engine optimization and eager to apply your knowledge in a dynamic startup environment? Grozeo UK is seeking interns to join our Digital Marketing team with a focus on SEO. This internship offers the flexibility to work from home or in our office under the guidance of professionals, paving the way to potential full-time employment. How to Apply!! Please send an email to maria.m@grozeo.co.uk with the subject line \"SEO Internship,\" attaching your CV and explaining why she should choose you out of all candidates. Internship Details: Duration: Up to 3 months, starting mid-January (duration may vary based on performance and preferences) Schedule: Monday to Friday, 9 AM to 5 PM Location: Your choice to work from home or come into our office Stipend: Starts with £100, with monthly performance reviews for possible increases + performance bonuses + travel expenses Additional Benefits: Certification of Completion Letter of Recommendation Performance Bonuses Role Dynamics: Title: SEO Intern Responsibilities: As an SEO Intern, you will work directly on improving multiple website’s visibility and search engine ranking. Tasks include keyword research, analyzing website traffic trends, implementing SEO strategies, and creating content optimized for search engines. You will assist the Digital Marketing Manager in all tasks related to SEO, including on-page and off-page optimization, content strategy, and link building. Ideal Candidate: Passionate and innovative about SEO and digital marketing Eager to learn and grow within a fast-paced startup environment Possesses foundational knowledge of SEO tools and strategies and is eager to apply this in a practical setting How to Apply!! Please send an email to maria.m@grozeo.co.uk with the subject line \"SEO Internship,\" attaching your CV and explaining why she should choose you out of all candidates. Maria, the SEO Manager, will be the decision-maker for these positions, so please direct your application to her. This internship is an excellent opportunity to learn and work but also to demonstrate creativity, initiative, and dedication. Join us to kickstart your professional journey in SEO at Grozeo UK!"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "NikahForever", "company_link": "https://www.linkedin.com/company/nikah-forever/life", "job_title": "Product Manager Intern", "location": "Not Found", "posted_on": "1 week ago as per the 2024-12-31 10:28:07", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4103112238/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=IuizBQa0kqdxKHT5CcwH7A%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Company Description Nikah forever is India’s most trusted Muslim Matrimony platform, focused on making marriages convenient and fostering a better community. With over 35,000 successful stories and 10,00,000+ members, we use AI algorithms to connect profiles and actively monitor for fake profiles. Join us in changing the perception of marriages! Role Description This is an internship role for a Product Manager at NikahForever located in New Delhi. As a Product Manager Intern, you will be involved in day-to-day tasks such as conducting market research, assisting in product development, analyzing user feedback, and collaborating with cross-functional teams to drive product improvements. Qualifications Market Research and Analysis skills Product Development and Management experience Ability to analyze and interpret user feedback Strong communication and collaboration skills Basic understanding of AI algorithms Pursuing or completed Bachelor's or Master's degree in Business, Marketing, or related field Stipend: 10k to 20k INR"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Syska Hennessy Group", "company_link": "https://www.linkedin.com/company/syska-hennessy-group/life", "job_title": "Mechanical Engineer Summer Intern", "location": "Not Found", "posted_on": "2 weeks ago as per the 2024-12-31 10:28:12", "applicant": "98 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4099133106/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=1r9yeOLphpH0vaXDLbKcAg%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Watch your work come to life in landmark projects around the world when you partner with Syska Hennessy Group! As a global leader in consulting, engineering, and commissioning services, we specialize in MEP, information and communication technology, architectural lighting, vertical transportation, and commissioning. We currently have an opportunity for a Mechanical Engineering Summer Intern. Our dynamic work environment provides the optimal setting for a positive learning experience as an intern. From our supportive culture, diverse workforce, and competitive compensation, to our flexible work schedules and fun social events, it is everything you will need for an exciting, challenging, and rewarding internship. Internship Responsibilities: As an intern, you will support our engineering teams working towards our designs that are inspiring, demanding and highly collaborative. You will learn from others, and they will expect to learn from you. You will share in the responsibility, rewards, and recognition of producing truly innovative solutions and complete client satisfaction. The pace is fast, and the camaraderie is close. Some Responsibilities Include: Assist engineers in preparing design documentation Prepare AutoCAD and Revit drawings of Electrical systems Assist engineers with design calculations and sizing building Electrical systems Assist engineers with field investigations and construction site visits to observe Attend intern education program lunch-and-learn sessions Internship Requirements: The ideal candidate will enjoy a team environment and also flexible enough to work independently where needed. Candidates for this role will be eager to expand their knowledge by challenging themselves and using the highly technical resources around them. Additional Job Requirements: Pursing a bachelor’s Degree from accredited university in Mechanical engineering Must be at a minimum in your second year Previous engineering internship or co-op experience a plus Knowledge in the latest version of MEP AutoCAD and REVIT is a plus Basic knowledge in design and calculation software; MS Office Suite Benefits: Join us this summer to prepare for your career as an Engineer through our Intern Education Program. This program consists of lunch- and- learn sessions covering various aspects of our business while gaining “hands-on” experience working with our engineers and visiting project sites. Once you graduate, jump start your career by joining Syska Hennessy Group and our EDT program. About The EDT Program Our Company is committed to developing engineers into respected technical experts and versatile business leaders. In keeping with that aim, interns that are hired for full time employment upon graduation can take advantage of our Engineering Development Training (EDT) program; an accelerated, but thorough training curriculum. This curriculum will teach not only the technical aspects of our profession, but industry specific business aspects as well. Our senior engineers will work closely with each participant to foster a strong mentor/apprentice relationship. EIT/FE required. As a Member Of Our Highly Collaborative Team, We Also Provide Our Full-time Employees With a Flexible Benefits Package That Reflects Our Respect For Your Workplace Contributions, Professional Goals, And Personal Priorities. The Personal Benefits Program At Syska Hennessy Group Includes: Medical, Dental, Vision insurance 401(k) retirement plan with employer matching Individual and Dependent Life Insurance Short- and Long-Term Disability Health Wellness Programs including flu shots and biometric screenings Tuition Reimbursement Training and professional development courses Professional development incentive bonuses Opportunities for community outreach through internal networks Personal Time Off Program (PTO) Transit/parking program Monthly business phone stipend Work from home Fridays At Syska, we have cultivated a community that supports learning and provides guidance for professional development and further our culture of excellence. We promote an environment that is committed to embedding diversity and equality into the core of our business and culture. We empower our employees so they can take ownership for their work and development and strive to continually improve themselves and our firm. We rely on the talent, drive, enthusiasm, and the total job satisfaction of the great people who work here for our success! Syska is a place where you can build an exceptional career and have a lasting impact on the world. Syska Hennessy Group Integrating the best minds and technology to help clients create exceptional environments"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Syska Hennessy Group", "company_link": "https://www.linkedin.com/company/syska-hennessy-group/life", "job_title": "Mechanical Engineer Summer Intern", "location": "Not Found", "posted_on": "2 weeks ago as per the 2024-12-31 10:28:17", "applicant": "98 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4099133106/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=1r9yeOLphpH0vaXDLbKcAg%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Watch your work come to life in landmark projects around the world when you partner with Syska Hennessy Group! As a global leader in consulting, engineering, and commissioning services, we specialize in MEP, information and communication technology, architectural lighting, vertical transportation, and commissioning. We currently have an opportunity for a Mechanical Engineering Summer Intern. Our dynamic work environment provides the optimal setting for a positive learning experience as an intern. From our supportive culture, diverse workforce, and competitive compensation, to our flexible work schedules and fun social events, it is everything you will need for an exciting, challenging, and rewarding internship. Internship Responsibilities: As an intern, you will support our engineering teams working towards our designs that are inspiring, demanding and highly collaborative. You will learn from others, and they will expect to learn from you. You will share in the responsibility, rewards, and recognition of producing truly innovative solutions and complete client satisfaction. The pace is fast, and the camaraderie is close. Some Responsibilities Include: Assist engineers in preparing design documentation Prepare AutoCAD and Revit drawings of Electrical systems Assist engineers with design calculations and sizing building Electrical systems Assist engineers with field investigations and construction site visits to observe Attend intern education program lunch-and-learn sessions Internship Requirements: The ideal candidate will enjoy a team environment and also flexible enough to work independently where needed. Candidates for this role will be eager to expand their knowledge by challenging themselves and using the highly technical resources around them. Additional Job Requirements: Pursing a bachelor’s Degree from accredited university in Mechanical engineering Must be at a minimum in your second year Previous engineering internship or co-op experience a plus Knowledge in the latest version of MEP AutoCAD and REVIT is a plus Basic knowledge in design and calculation software; MS Office Suite Benefits: Join us this summer to prepare for your career as an Engineer through our Intern Education Program. This program consists of lunch- and- learn sessions covering various aspects of our business while gaining “hands-on” experience working with our engineers and visiting project sites. Once you graduate, jump start your career by joining Syska Hennessy Group and our EDT program. About The EDT Program Our Company is committed to developing engineers into respected technical experts and versatile business leaders. In keeping with that aim, interns that are hired for full time employment upon graduation can take advantage of our Engineering Development Training (EDT) program; an accelerated, but thorough training curriculum. This curriculum will teach not only the technical aspects of our profession, but industry specific business aspects as well. Our senior engineers will work closely with each participant to foster a strong mentor/apprentice relationship. EIT/FE required. As a Member Of Our Highly Collaborative Team, We Also Provide Our Full-time Employees With a Flexible Benefits Package That Reflects Our Respect For Your Workplace Contributions, Professional Goals, And Personal Priorities. The Personal Benefits Program At Syska Hennessy Group Includes: Medical, Dental, Vision insurance 401(k) retirement plan with employer matching Individual and Dependent Life Insurance Short- and Long-Term Disability Health Wellness Programs including flu shots and biometric screenings Tuition Reimbursement Training and professional development courses Professional development incentive bonuses Opportunities for community outreach through internal networks Personal Time Off Program (PTO) Transit/parking program Monthly business phone stipend Work from home Fridays At Syska, we have cultivated a community that supports learning and provides guidance for professional development and further our culture of excellence. We promote an environment that is committed to embedding diversity and equality into the core of our business and culture. We empower our employees so they can take ownership for their work and development and strive to continually improve themselves and our firm. We rely on the talent, drive, enthusiasm, and the total job satisfaction of the great people who work here for our success! Syska is a place where you can build an exceptional career and have a lasting impact on the world. Syska Hennessy Group Integrating the best minds and technology to help clients create exceptional environments"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "Syska Hennessy Group", "company_link": "https://www.linkedin.com/company/syska-hennessy-group/life", "job_title": "Mechanical Engineer Summer Intern", "location": "Not Found", "posted_on": "2 weeks ago as per the 2024-12-31 10:28:22", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4099134021/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=YFcprIif9qVTPGOQ29okaw%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job Watch your work come to life in landmark projects around the world when you partner with Syska Hennessy Group! As a global leader in consulting, engineering, and commissioning services, we specialize in MEP, information and communication technology, architectural lighting, vertical transportation, and commissioning. We currently have an opportunity for a Mechanical Engineering Summer Intern. Our dynamic work environment provides the optimal setting for a positive learning experience as an intern. From our supportive culture, diverse workforce, and competitive compensation, to our flexible work schedules and fun social events, it is everything you will need for an exciting, challenging, and rewarding internship. Internship Responsibilities: As an intern, you will support our engineering teams working towards our designs that are inspiring, demanding and highly collaborative. You will learn from others, and they will expect to learn from you. You will share in the responsibility, rewards, and recognition of producing truly innovative solutions and complete client satisfaction. The pace is fast, and the camaraderie is close. Some Responsibilities Include: Assist engineers in preparing design documentation Prepare AutoCAD and Revit drawings of Electrical systems Assist engineers with design calculations and sizing building Electrical systems Assist engineers with field investigations and construction site visits to observe Attend intern education program lunch-and-learn sessions Internship Requirements: The ideal candidate will enjoy a team environment and also flexible enough to work independently where needed. Candidates for this role will be eager to expand their knowledge by challenging themselves and using the highly technical resources around them. Additional Job Requirements: Pursing a bachelor’s Degree from accredited university in Mechanical engineering Must be at a minimum in your second year Previous engineering internship or co-op experience a plus Knowledge in the latest version of MEP AutoCAD and REVIT is a plus Basic knowledge in design and calculation software; MS Office Suite Benefits: Join us this summer to prepare for your career as an Engineer through our Intern Education Program. This program consists of lunch- and- learn sessions covering various aspects of our business while gaining “hands-on” experience working with our engineers and visiting project sites. Once you graduate, jump start your career by joining Syska Hennessy Group and our EDT program. About The EDT Program Our Company is committed to developing engineers into respected technical experts and versatile business leaders. In keeping with that aim, interns that are hired for full time employment upon graduation can take advantage of our Engineering Development Training (EDT) program; an accelerated, but thorough training curriculum. This curriculum will teach not only the technical aspects of our profession, but industry specific business aspects as well. Our senior engineers will work closely with each participant to foster a strong mentor/apprentice relationship. EIT/FE required. As a Member Of Our Highly Collaborative Team, We Also Provide Our Full-time Employees With a Flexible Benefits Package That Reflects Our Respect For Your Workplace Contributions, Professional Goals, And Personal Priorities. The Personal Benefits Program At Syska Hennessy Group Includes: Medical, Dental, Vision insurance 401(k) retirement plan with employer matching Individual and Dependent Life Insurance Short- and Long-Term Disability Health Wellness Programs including flu shots and biometric screenings Tuition Reimbursement Training and professional development courses Professional development incentive bonuses Opportunities for community outreach through internal networks Personal Time Off Program (PTO) Transit/parking program Monthly business phone stipend Work from home Fridays At Syska, we have cultivated a community that supports learning and provides guidance for professional development and further our culture of excellence. We promote an environment that is committed to embedding diversity and equality into the core of our business and culture. We empower our employees so they can take ownership for their work and development and strive to continually improve themselves and our firm. We rely on the talent, drive, enthusiasm, and the total job satisfaction of the great people who work here for our success! Syska is a place where you can build an exceptional career and have a lasting impact on the world. Syska Hennessy Group Integrating the best minds and technology to help clients create exceptional environments The salary range listed below is for this particular job posting. Actual pay range for candidates will be commensurate with candidate’s experience, skillsets and competencies and may differ based on the cost of labor in their particular location. Syska wide Pay Range $23—$27 USD"}, {"platform": "Linkedin", "platform_link": "https://www.linkedin.com/", "company": "EBSCO Information Services", "company_link": "https://www.linkedin.com/company/ebsco-information-services/life", "job_title": "Intern Security Analyst SecOps, Summer 2025", "location": "Not Found", "posted_on": "2 weeks ago as per the 2024-12-31 10:28:27", "applicant": "Over 100 applicants", "job_link": "https://www.linkedin.com/jobs//jobs/view/4099643602/?alternateChannel=search&refId=AvSftUKBRjPJ9K3Qpfdfmw%3D%3D&trackingId=To9WM5bdAJVDE2neOfoA6A%3D%3D&trk=d_flagship3_search_srp_jobs", "experience_level": "Not Found", "duration": "Not Found", "job_description": "About the job EBSCO Information Services (EIS) provides a complete and optimized research solution comprised of e-journals, e-books, and research databases - all combined with the most powerful discovery service to support the information needs and maximize the research experience of our end-users. Headquartered in Ipswich, MA, EIS employs more than 2,700 people worldwide, most now working hybrid or remotely. We are the leader in our field due to our cutting-edge technology, forward-thinking philosophy, and outstanding team. EIS is a company that will motivate you, inspire you, and allow you to grow. Our mission is to transform lives by providing relevant and reliable information when, where, and how people need it. We are looking for bright and creative individuals whose unique differences will allow us to achieve this inclusive mission around the world. Your Opportunity Security Analyst Intern What You'll Do What You’ll Do (Primary Responsibilities): In this role, you will perform a variety of cybersecurity and compliance activities that help protect EIS’s products and our customer’s data. You will work closely with other cybersecurity professionals and gain valuable exposure to cutting-edge security tools and operating environments. You will participate in risk analysis, incident investigation, and vulnerability assessment. Your Team You will be welcomed as a member of the Security Operations team, a team of about 12 people. Our team enjoys the flexibility and greater work life balance working remotely offers. There will be ample resources, tools, training, and support to ensure your success as a Security Analyst Intern and your development and career growth at EIS. About You About You: Conduct vulnerability assessments of cloud and on-premise environments. Use security tools to investigate potential security issues. Help develop effective security controls for development and production ecosystems. Assist in the management of security/privacy policies, standards, and procedures. Assist in the management of Vendor Risk Management program activities. Work with stakeholders to develop and implement security and privacy controls consistent with established policies and regulatory environments. Conduct audit reviews and information security risk assessments and submit results into Risk Register as needed. Participate in regular exercises for Incident Response. What Sets You Apart Excellent verbal and written communication skills Excellent interpersonal skills and attention to detail Excellent time management skills with proven ability to meet deadlines Strong problem-solving skills Understanding of cybersecurity concepts, such as threats (computer viruses, malware and the like) and vulnerabilities (defects in code or systems that can be exploited). Experience with script development. Experience working in a team environment and as a strong self-starter. Experience with endpoint detection tools and investigations. Our Offer To you As part of the EIS Summer Intern Program, interns receive an hourly wage and dedicated orientation program starting on June 2 nd and participate in enrichment and training events with fellow interns across the company. To learn more about the EIS Summer Internship Program, please visit - https://www.ebsco.com/about/internship-opportunities Pay Range USD $22.00 - USD $26.00 /Hr."}]}]