[{"platform": "Freshers", "platform_link": "https://www.freshersworld.com/", "job_title": "Photography intern", "company": "Zoroy Retail Private Limited", "salary": "Not disclosed", "education": "BFA", "experience_text": "0 Years", "location": "['Bangalore']", "interview_process": "Face to Face Interview", "posted_on": "27 Dec 24", "description": "[heading] Selected intern's day-to-day responsibilities include: Selected intern's day-to-day responsibilities include: \n \n 1. Assist in product photography and editing images for our e-commerce platform \n 2. Create engaging and visually appealing videos for marketing campaigns \n 3. Collaborate with the social media team to produce content for various platforms \n 4. Utilize Canva to design graphics for promotional materials \n 5. Assist in organizing and managing the company's digital asset library \n 6. Attend photoshoots and assist with set-up and equipment management \n 7. Stay up-to-date on photography trends and techniques to bring fresh ideas to the team \n [heading] Skill(s) required Skill(s) required Adobe Photoshop Canva Photography Social Media Marketing Video Editing Video Making Earn certifications in these skills Learn Social Media Marketing Learn Adobe Photoshop Learn Video Editing Learn Photography [heading] Who can apply Who can apply Only those candidates can apply who: 1. are available for full time (in-office) internship 2. have relevant skills and interests * Women wanting to start/restart their career can also apply. [heading] Perks Perks Certificate Informal dress code Free snacks & beverages [heading] Number of openings Number of openings 1 [heading] Certificate: Will be provided at the end of the Internship Certificate: Will be provided at the end of the Internship \n \n \n More information about this Photography intern Job \n \n Please go through the below FAQs to get all answers related to the given Photography intern job \n \n What are the job requirements to apply for this Photography intern job position? \n Ans: A candidate must have a minimum of fresher as an Photography intern \n What is the qualification for this job? \n Ans: The candidate can be a Graduate from any of the following:  BFA \n What is the hiring Process of this job? \n Ans: The hiring process all depends on the company. Normally for an entry level, hiring the candidate has to go for Aptitude, GD (If they look for communication),Technical test and face to face interviews. \n This Photography intern is a work from home job? Ans:  No ,its not a Work from Home Job. \n How many job vacancies are opening for the Photography intern position? \n Ans: There are immediate 1 job openings for Photography intern in our Organisation. \n", "job_type": "Internship / Projects", "job_id": "2295817"}]