[{"page_2": [{"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Infineon", "company_link": "https://www.naukri.com/infineon-jobs-careers-2518", "job_title": "Internship", "job_link": "https://www.naukri.com/job-listings-internship-infineon-technologies-pvt-ltd-ahmedabad-0-to-1-years-261224503494", "location": "Worldwide", "JobType": "Not found", "duration": "No fixed duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "4 days ago as per the 2024-12-30 14:42:24 or None", "applicant": "Less than 10", "opening": "1", "job_description": "Assist in developing and testing mobile applications. Collaborate with senior developers to learn and implement coding best practices. Participate in code reviews and contribute to project documentation. Conduct research to improve app functionality and performance. Support troubleshooting and debugging tasks."}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Heinz", "company_link": "https://www.naukri.com/heinz-jobs-careers-45617", "job_title": "GCC - Intern-20", "job_link": "https://www.naukri.com/job-listings-gcc-intern-20-heinz-india-ahmedabad-0-to-1-years-241224506173", "location": "Worldwide", "JobType": "Not found", "duration": "No fixed duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "6 days ago as per the 2024-12-30 14:42:58 or None", "applicant": "Less than 10", "opening": "1", "job_description": "Project Management: 1. Assist in managing small-scale projects. \n 2. Coordinate with stakeholders, vendors, and team members. \n 3. Ensure timely project delivery. Data Analysis: 1. Collect, analyze, and interpret operational data. \n 2. Create reports, dashboards, and visualizations. \n 3. Provide insights for informed decision-making."}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Stellans Technosoft", "company_link": "https://www.naukri.com/stellans-technosoft-jobs-careers-6762479", "job_title": "Administrative Assistant Intern", "job_link": "https://www.naukri.com/job-listings-administrative-assistant-intern-stellans-technosoft-pvt-ltd-ahmedabad-0-to-1-years-031224500710", "location": "Worldwide", "JobType": "Not found", "duration": "3 months duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "27 days ago as per the 2024-12-30 14:43:32 or None", "applicant": "11", "opening": "1", "job_description": "Maintain organization of office operations, procedures, and compliances. Detail-oriented and highly organized. Data entry and record keeping. Should Handle Monthly Invoices, expenses, billing cycles, and monitor and report on finance. Operate as the lead point of contact for any and all matters specific to the execution of operational activities. Oversee materials and inventory management. Plan, coordinate and manage all administrative procedures and systems. Allocate responsibilities and office space. Assess the team performance. Proficient in phone etiquette and communication. Ensure the smooth and adequate flow of information within the company. Qualifications: Graduate in any discipline. Non technical educational background candidates may apply. Strong skills, including proficiency with Microsoft Office. Strong clerical skills Excellent written and verbal communication skills and Accounting. Strong organizational and communication skills. Strong ability to prioritise and multitask. Comfort working with multiple groups within the business."}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "360 Vr Photography", "company_link": "https://www.naukri.com/360-vr-photography-jobs-careers-124148854", "job_title": "Marketing Manager", "job_link": "https://www.naukri.com/job-listings-marketing-manager-360-vr-photography-ahmedabad-0-to-1-years-031224005013", "location": "Worldwide", "JobType": "Not found", "duration": "6 months duration", "Salary": "25,000/month", "last_date_application": "Not found", "posted_on": "27 days ago as per the 2024-12-30 14:44:06 or None", "applicant": "12", "opening": "1", "job_description": "[bold] Role & responsibilities Role & responsibilities Develop and implement marketing strategies to promote our services in VR, AR, XR, and Metaverse solutions. Plan and execute digital marketing campaigns, including SEO, social media, email, and content marketing. Manage the companys online presence and branding across various platforms. Conduct market research to identify trends and opportunities in the industry. Build relationships with clients and stakeholders to grow the business. Collaborate with cross-functional teams to align marketing efforts with company goals. Track and analyze the performance of marketing campaigns, providing insights for improvement. \n \n \n"}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Inmobi", "company_link": "https://www.naukri.com/inmobi-jobs-careers-404135", "job_title": "Intern - Industrial Trainee", "job_link": "https://www.naukri.com/job-listings-intern-industrial-trainee-inmobi-solutions-pvt-ltd-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-0-to-2-years-051224503741", "location": "Worldwide", "JobType": "Not found", "duration": "3 months duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "25 days ago as per the 2024-12-30 14:44:40 or None", "applicant": "176", "opening": "1", "job_description": "The finance team at InMobi is a very vibrant and tightly knit group of professionals working to streamline and strengthen the processes, frameworks and systems to help the business ride the next wave of rapid growth. We are focused on ensuring compliances across geographies are addressed, reporting standards are met, and are commensurate to the GAAP. A fun group, excited about ideas, and solution-oriented thinking, we look forward to having people who lean on their experience, have a zeal to learn new things and take up challenges which come along with a dynamic business and grow with it. You will be part of the Global Controllership team based in Bangalore, India, specializing in financial reporting."}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Imagic Learning Solutions Private Limited", "company_link": "https://www.naukri.com/imagic-learning-solutions-jobs-careers-4871712", "job_title": "Digital Marketing Internship", "job_link": "https://www.naukri.com/job-listings-digital-marketing-internship-imagic-learning-solutions-private-limited-ahmedabad-0-to-1-years-221122502391", "location": "Worldwide", "JobType": "Not found", "duration": "3 months duration", "Salary": "5,000/month", "last_date_application": "Not found", "posted_on": "30+ days ago as per the 2024-12-30 14:45:13 or None", "applicant": "466", "opening": "1", "job_description": "1. Weekly one day reporting at office near science city. Rest work from home. 2. Weekly 6- 8 products uploading in the online sites. Photos and contents will be given. 3. Digital marketing. 4. Knowledge of Photoshop is must.Knowledge of content writing or photography preferable. 5. Male candidate required. 6. Opportunity to work in professional environment."}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "BDO International Limited", "company_link": "https://www.naukri.com/bdo-india-jobs-careers-498101", "job_title": "Internship - AHM", "job_link": "https://www.naukri.com/job-listings-internship-ahm-bdo-international-limited-ahmedabad-0-to-1-years-100924501637", "location": "Worldwide", "JobType": "Not found", "duration": "No fixed duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "30+ days ago as per the 2024-12-30 14:45:47 or None", "applicant": "16", "opening": "1", "job_description": "We are looking for recent [bold] graduates (2019-2024) graduates (2019-2024) to join our 1-year Internship program for Ahmedabad. This is a fantastic chance to gain hands-on experience, build your professional network, and grow your career. [bold] Eligibility Criteria: Eligibility Criteria: Must have B.Com, BBA Finance [bold] full time full time graduation. Should [bold] not be pursuing PG OR any professional course not be pursuing PG OR any professional course currently. [bold] Provisional Degree Certificate Provisional Degree Certificate in hand is required. [bold] Should not have any other work experience Should not have any other work experience (Internships and freelancing are fine)."}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Alexander Balvis Productions", "company_link": "https://www.naukri.com/alexander-balvis-productions-jobs-careers-6222350", "job_title": "In uencer Marketing Manager", "job_link": "https://www.naukri.com/job-listings-in-uencer-marketing-manager-alexander-balvis-productions-srinagar-kolkata-dhanbad-ranchi-ahmedabad-bengaluru-hyderabad-amritsar-ludhiana-bhopal-gwalior-indore-thane-chandigarh-jabalpur-new-delhi-agra-aligarh-rajkot-1-to-3-years-031224506649", "location": "Worldwide", "JobType": "Not found", "duration": "No fixed duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "27 days ago as per the 2024-12-30 14:46:52 or None", "applicant": "92", "opening": "1", "job_description": "Mumbai, Delhi, Bangalore, Hyderabad, Ahmadabad, Chennai, Kolkata, Surat, Pune, Jaipur, Lucknow, Kanpur, Nagpur, Indore, Thane, Ahmadabad, Chennai, Kolkata, Surat, Pune, Jaipur, Lucknow, Kanpur, Nagpur, Indore, Thane, Bhopal, Visakhapatnam, Patna, Vadodara, Ghaziabad, Ludhiana, Agra, Nasik, Faridabad, Meerut , Rajkot, Varanasi, Srinagar, Aurangabad, Dhanbad, Amritsar, Navi Mumbai, Allahabad, Ranchi, Gwalior, Jabalpur, Coimbatore, Vijayawada, Jodhpur, Madurai, Raipur, Kota, Chandigarh, Guwahati , Sholapur, Bareilly, Mysore, Moradabad, Gurgaon, Aligarh Responsibilies Strategy Development: Develop innovative and data-driven influencer marketing strategies that effectively promote our brand and products to our target audience within the B2B space. Influencer Partnerships: Identify, recruit, and onboard influential B2B partners, including industry leaders, thought influencers, and content creators, to collaborate on marketing campaigns. Relationship Management: Cultivate strong and long-lasting relationships with influencers, affiliates, and brand advocates to foster loyalty and maximize campaign impact. Campaign Execution: Plan, execute, and optimize influencer marketing campaigns from inception to completion, ensuring alignment with the overall marketing strategy. Content Collaboration: Collaborate with influencers and content creators to produce compelling and authentic content that resonates with our target audience and drives engagement. Performance Analysis: Track, measure, and analyze the performance of influencer campaigns to provide actionable insights and recommendations for continuous improvement. Budget Management: Effectively manage the allocated budget for influencer marketing activities, ensuring optimal resource allocation and return on investment. Compliance and Legal: Ensure all influencer marketing campaigns adhere to relevant guidelines, regulations, and disclosure requirements. Industry Monitoring: Stay up-to-date with industry trends, best practices, and emerging technologies in influencer marketing to maintain a competitive edge. Specifications Looking for interns of SEO & digital marketing and Customer Relationship intern who can work online and offline channels. No Degree or Formal educations required for right candidate \n \n Passion and eagerness to learn with team. \n Stipend will be given to right candidate. \n"}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Doctoronline Healthtech", "company_link": "https://www.naukri.com/doctoronline-healthtech-jobs-careers-124470720", "job_title": "HR Generalist Intern", "job_link": "https://www.naukri.com/job-listings-hr-generalist-intern-doctoronline-healthtech-ahmedabad-0-to-1-years-231224010891", "location": "Worldwide", "JobType": "Not found", "duration": "6 months duration", "Salary": "7,000/month", "last_date_application": "Not found", "posted_on": "7 days ago as per the 2024-12-30 14:47:26 or None", "applicant": "13", "opening": "1", "job_description": "We are looking for a HR Generalist intern to look into HR operations and Recruitment at Healppy (DoctorOnline HealthTech Pvt Ltd). \n [bold] Roles & Responsibilities Roles & Responsibilities Human Resources generalist operations like on-boarding, managing records, payroll preparation, payroll processing. Manage employee grievance and other queries. Employee engagement activities. Manage end to end recruitment of IT and operations team. Including Job description preparation, listing, posting jobs, sourcing candidates, screening candidates, scheduling interviews, negotiating salary, preparing and sending offer letters. [bold] Required Skills: Required Skills: Must have very strong analytical and people skills. MBA will be preferred, but any bachelor degree will be fine as well. [bold] Internship Details: Internship Details: Itll be a 6 months internship with possible confirmation based on performance and requirement. There’ll be a stipend of INR 7,000/- per month."}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Truely marry", "company_link": "https://www.naukri.com/truelymarry-jobs-careers-1898674", "job_title": "Internship", "job_link": "https://www.naukri.com/job-listings-internship-truely-marry-srinagar-visakhapatnam-jaipur-kolkata-mumbai-nagpur-ghaziabad-nashik-kanpur-pune-lucknow-meerut-faridabad-ahmedabad-bengaluru-patna-hyderabad-chennai-ludhiana-varanasi-bhopal-ind-0-to-2-years-040923500433", "location": "Worldwide", "JobType": "Not found", "duration": "No fixed duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "30+ days ago as per the 2024-12-30 14:47:59 or None", "applicant": "3946", "opening": "1", "job_description": "As a Digital Marketing Intern, customer relationship intern: you will be responsible for assisting the Product Head/ Manager for the delivery of multiple programs/ product development in the organization Assisting them on complete product life cycle, from concept to execution of the product(s) across products/product lines that drive better customer experience, differentiation and profitability Looking for interns of SEO digital marketing and Customer Relationship intern who can work online and offline channels. No Degree or Formal educations required for right candidate \n Passion and eagerness to learn with team. \n Stipend will be given to right candidate. \n \n Perks and benefits Trainig free, without any fee \n Get Stipend monthly"}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Stellans Technosoft", "company_link": "https://www.naukri.com/stellans-technosoft-jobs-careers-6762479", "job_title": "Dot NET Intern", "job_link": "https://www.naukri.com/job-listings-dot-net-intern-stellans-technosoft-pvt-ltd-ahmedabad-0-to-2-years-031224500709", "location": "Worldwide", "JobType": "Not found", "duration": "3 months duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "27 days ago as per the 2024-12-30 14:49:04 or None", "applicant": "115", "opening": "1", "job_description": "Design, code, test and manage various applications Collaborate with engineering team and product team to establish best products Follow outlined standards of quality related to code and systems Develop automated tests and conduct performance tuning Qualifications: Bachelors degree in Computer Science or relevant field 0-2 years of experience working with .NET or relevant experiences Experience developing web-based applications in C#, HTML, JavaScript, VBScript/ASP, or .NET, ASP.NET webforms, MVC, .net Core, C#, entity framework, Linq Web API Experience working with SQL Server (Index, performance tuning, Store Procedures), MS SQL Server and Knowledge of practices and procedures for full software design life cycle Experience working in agile development environment"}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Alexander Balvis Productions", "company_link": "https://www.naukri.com/alexander-balvis-productions-jobs-careers-6222350", "job_title": "Internship", "job_link": "https://www.naukri.com/job-listings-internship-alexander-balvis-productions-srinagar-kolkata-dhanbad-ranchi-ahmedabad-bengaluru-hyderabad-amritsar-ludhiana-bhopal-gwalior-indore-thane-chandigarh-jabalpur-new-delhi-agra-aligarh-rajkot-surat-vadodara-0-to-2-years-031224506781", "location": "Worldwide", "JobType": "Not found", "duration": "No fixed duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "27 days ago as per the 2024-12-30 14:49:38 or None", "applicant": "246", "opening": "1", "job_description": "Job Description \n We are seeking a talented and creative UI/UX Designer to join our team. As a UI/UX Designer, you will be responsible for translating user requirements into visually appealing and intuitive user interfaces. Your expertise in creating wireframes, storyboards, process flows, and sitemaps will be instrumental in delivering exceptional user experiences for our products. \n \n Responsibilities: \n Design Conceptualization: Utilize wireframes, storyboards, process flows, and sitemaps to visualize and communicate design ideas effectively. \n Collaboration: Work closely with product managers and engineers to deeply understand the products purpose and functionalities, and present well-thought-out solutions to enhance the visual and interactive experience. \n User Requirements Gathering: Gather user requirements from product managers and conduct research to develop compelling and original designs, including images and wireframes. \n UI Design Implementation: Build and design user interfaces using agreed design systems in Figma/Adobe XD, ensuring a consistent and cohesive look and feel across the product. \n UX Troubleshooting: Identify and troubleshoot UX problems through user testing and feedback, and implement improvements accordingly. \n Design Presentations: Present design concepts and ideas to colleagues, executive members, and clients, explaining the rationale behind your design decisions. \n Brand Consistency: Ensure that design elements, such as style, fonts, colors, and images, adhere to established brand guidelines and maintain a high standard of consistency. \n User Experience Research: Conduct regular research on user experience trends, industry best practices, and emerging technologies to stay updated and continuously improve design processes. \n Feedback Integration: Gather and incorporate feedback from stakeholders and users to iteratively enhance the user interface and experience. \n Industry Trends: Stay informed about the latest UI/UX design trends, tools, and techniques, bringing fresh ideas and insights to the team. \n \n \n Requirements: \n Proven Experience: A portfolio showcasing your experience in UI/UX design and a track record of creating engaging and user-centric designs. \n Design Tools: Proficiency in using design tools like Figma, Adobe XD, Sketch, or similar software. \n Creativity: Strong creative and artistic abilities with a keen eye for aesthetics and attention to detail. \n Communication: Excellent communication and presentation skills to articulate design concepts and collaborate effectively with cross-functional teams. \n Problem-Solving: Ability to identify and solve UX/UI challenges with innovative and practical solutions. \n User-Centric Mindset: Deep understanding of user behavior and the ability to create user-centered designs. \n Adaptability: Capacity to work in a fast-paced, dynamic environment and manage multiple projects simultaneously. \n Continuous Learning: A proactive attitude towards learning and staying up-to-date with UI/UX trends and advancements. \n \n If you are a passionate UI/UX Designer with a focus on delivering exceptional user experiences through innovative designs, we invite you to join our team. Contribute your creativity and skills to shape our products and leave a positive impact on our users. \n"}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Kashmiri Products", "company_link": "https://www.naukri.com/kashmiri-products-jobs-careers-4895806", "job_title": "Intern", "job_link": "https://www.naukri.com/job-listings-intern-kashmiri-products-kolhapur-mumbai-nagpur-nashik-pune-ahmedabad-solapur-ahmednagar-vadodara-aurangabad-0-to-1-years-300720500823", "location": "Worldwide", "JobType": "Not found", "duration": "No fixed duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "30+ days ago as per the 2024-12-30 14:50:12 or None", "applicant": "4145", "opening": "1", "job_description": "[bold] Job Description Job Description In this Job we are offering summer and winter Internship, along with fixed stipend, plus incentive on total sales. We can also convert the intership program to final placement based on performance. Internship Programme is with Stipend. [bold] Skill Required Skill Required Excellent Communication written and oral skills well versed with local language. Should have Fast Moving Consumer Goods (FMCG) sales and client interaction exposure. FMCG experience with knowledge of operations must. Should be well verse with writing Email, Whatsapp, communication over smart phones. Daily activity reporting."}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Landscapes India", "company_link": "https://www.naukri.com/landscapes-india-jobs-careers-124269046", "job_title": "Design Interns", "job_link": "https://www.naukri.com/job-listings-design-interns-landscapes-india-mumbai-ahmedabad-1-to-2-years-080824500648", "location": "Worldwide", "JobType": "Not found", "duration": "6 months duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "30+ days ago as per the 2024-12-30 14:50:45 or None", "applicant": "13", "opening": "1", "job_description": "The studio is a non-hierarchical space- designed for continuous learning, and conversation. There are constant opportunities to engage with conversations beyond your immediate sphere. It is also a fast paced work environment that engages in conversations across scale, typology, and form. We are now inviting Internship Applications. The internship period is very important in the process of learning. So, as you apply, we suggest that you carefully go through the website, and study the process that the studio undertakes. The Internship position is open also, for the soon to commence Bangalore studio To apply, please do fill out the form provided via the link below. If you do not hear from us in a period of 30 days, please do contact us."}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "FCM Travel", "company_link": "https://www.naukri.com/fcm-travel-jobs-careers-95953", "job_title": "MICE Operations Internship", "job_link": "https://www.naukri.com/job-listings-mice-operations-internship-fcm-travel-mumbai-suburban-0-to-1-years-301224004627", "location": "Worldwide", "JobType": "Internship", "duration": "6 months duration", "Salary": "14,000/month", "last_date_application": "Apply by : 10th Jan'25", "posted_on": "Just now as per the 2024-12-30 14:50:49 or None", "applicant": "Less than 10", "opening": "2", "job_description": "\n FCM India is a leading travel management company providing innovative, technology-driven solutions. We specialize in delivering personalized business travel experiences, ensuring seamless travel for clients worldwide. \n [bold] Job Purpose: Job Purpose: \n The MICE Operations (Visa) Documentation Specialist will manage visa documentation for delegates attending MICE (Meetings, Incentives, Conferences, and Exhibitions) events. This role ensures timely and accurate processing of visa documentation to facilitate smooth travel for attendees. \n [bold] Key Responsibilities: Key Responsibilities: [bold] Visa Documentation: Visa Documentation: \n Prepare and manage visa applications and supporting documents for delegates attending MICE events. Coordinate with embassies, consulates, and external agencies to ensure timely visa approval. Track visa application status and inform delegates of any updates \n [bold] Client Liaison: Client Liaison: \n Communicate visa requirements and updates to clients and delegates. Provide guidance on required documentation and address any concerns regarding visa processes. \n [bold] Record Keeping: Record Keeping: \n Maintain accurate and organized records of visa applications, statuses, and approvals. Generate and share reports on the visa process and outcomes. \n [bold] Compliance and Process Improvement: Compliance and Process Improvement: \n Ensure adherence to visa regulations and FCM India policies. Identify opportunities for streamlining the documentation process to minimize delays. \n [bold] Key Requirements: Key Requirements: \n [bold] Education: Education: \n Graduate in Travel & Tourism or related field. \n [bold] Experience: Experience: \n Previous experience with embassies or consulates is advantageous. \n [bold] Skills & Competencies: Skills & Competencies: \n Strong communication skills (written and verbal). Detail-oriented with excellent organizational skills. Knowledge of global visa regulations and documentation requirements. Ability to manage multiple tasks and meet deadlines efficiently. Proficiency in Microsoft Office (Word, Excel). Experience with travel management software is a plus. \n [bold] Preferred: Preferred: \n Knowledge of MICE event documentation and travel logistics. Familiarity with international travel regulations. \n \n"}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Hsbc", "company_link": "https://www.naukri.com/hsbc-jobs-careers-7097", "job_title": "CA Intern", "job_link": "https://www.naukri.com/job-listings-ca-intern-hsbc-electronic-data-processing-india-pvt-ltd-mumbai-0-to-1-years-271224500257", "location": "Worldwide", "JobType": "Not found", "duration": "No fixed duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "3 days ago as per the 2024-12-30 14:51:23 or None", "applicant": "13", "opening": "1", "job_description": "\n Some careers open more doors than others. If you re looking for a career that will unlock new opportunities,  join HSBC and experience the possibilities.  Whether you want a career that could take you to the top,  or simply take you in an exciting new direction,  HSBC offers opportunities,  support and rewards that will take you further. Business Banking Business Banking provides financial services solutions that support businesses ranging from small corporates to mid-market enterprises in a variety of industry sectors all over the world.  Leveraging the strength,  scope and expertise of our global product network,  Business Banking is positioned as an essential partner to small and mid-market enterprises seeking to maximise their potential domestically and internationally,  offering streamlined business access to HSBC s international network and broad range of market leading banking products and services. We are currently seeking a CA Intern to join Business Banking Team in Mumbai Principal Responsibilities The role would require to work closely with BB Associate Relationship Managers & Relationship Managers in preparing credit proposals,  legal documentation,  controls/compliance monitoring and liaising within HSBC network and also work on various MIS for internal/external regulatory purpose and due diligence process. \n \n \n \n \n \n \n \n \n \n Requirements \n \n \n \n CA student registered with ICAI and having completed 18 months of Article ship training Candidate to have the aptitude to learn various aspects of banking Candidate should possess good verbal and written communication skills Minimum Graduation or as required for the role,  whichever is higher [bold] Useful Link Useful Link Link to Careers Site: Click [bold]  [bold] HERE HERE You ll achieve more at (internal) / when you join (external) HSBC. HSBC is committed to building a culture where all employees are valued,  respected and opinions count.  We take pride in providing a workplace that fosters continuous professional development,  flexible working and opportunities to grow within an inclusive and diverse environment. Personal data held by the Bank relating to employment applications will be used in accordance with our Privacy Statement,  which is available on our website."}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Hsbc", "company_link": "https://www.naukri.com/hsbc-jobs-careers-7097", "job_title": "Summer Intern", "job_link": "https://www.naukri.com/job-listings-summer-intern-hsbc-electronic-data-processing-india-pvt-ltd-mumbai-0-to-1-years-231224501993", "location": "Worldwide", "JobType": "Not found", "duration": "No fixed duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "7 days ago as per the 2024-12-30 14:51:57 or None", "applicant": "35", "opening": "1", "job_description": "HSBC electronic data processing india pvt ltd is looking for Summer Intern - Pan India to join our dynamic team and embark on a rewarding career journey Assist in various tasks and projects as assigned \n \n Conduct research and gather information \n \n Support team members with administrative duties \n \n Participate in meetings and contribute ideas \n \n Learn about industry practices and company operations \n \n"}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Bdfl Technologies", "company_link": "https://www.naukri.com/bdfl-technologies-jobs-careers-6908599", "job_title": "Customer Care Intern", "job_link": "https://www.naukri.com/job-listings-customer-care-intern-the-10x-academy-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-0-to-1-years-101024500355", "location": "Worldwide", "JobType": "Not found", "duration": "3 months duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "30+ days ago as per the 2024-12-30 14:52:31 or None", "applicant": "98", "opening": "1", "job_description": "Make outbound calls to potential clients/customers to introduce the company s products/services. Handle inbound inquiries and provide detailed information about offerings. Understand customer needs and address their queries effectively. Maintain accurate records of calls and update the customer database with relevant information. Follow up on leads and manage relationships with potential customers. Assist the sales/marketing team in achieving targets by setting appointments and generating leads. Collaborate with the team to improve call strategies and enhance customer engagement. Participate in team meetings and share updates on progress and challenges. \n Key Skills & Requirements: Excellent verbal communication skills in English Strong interpersonal skills with a customer-centric approach. Ability to handle rejections professionally and remain motivated. Basic knowledge of MS Office (Word, Excel) and CRM systems (preferred but not mandatory). Ability to work in a fast-paced environment and adapt to changing priorities. Attention to detail and strong organizational skills. Self-motivated with a desire to learn and grow. Any prior experience in telecalling, sales, or customer service will be a plus but is not mandatory."}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "Thinksprout Infotech", "company_link": "https://www.naukri.com/thinksprout-infotech-jobs-careers-123869709", "job_title": "Mobile App Developer", "job_link": "https://www.naukri.com/job-listings-mobile-app-developer-thinksprout-infotech-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-0-to-3-years-090424500888", "location": "Worldwide", "JobType": "Not found", "duration": "3 months duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "30+ days ago as per the 2024-12-30 14:53:05 or None", "applicant": "2021", "opening": "1", "job_description": "Support the entire application lifecycle (concept, design, test, release and support) Produce fully functional mobile applications writing clean code Gather specific requirements and suggest solutions Write unit and UI tests to identify malfunctions Troubleshoot and debug to optimize performance Design interfaces to improve user experience Liaise with Product development team to plan new features Ensure new and legacy applications meet quality standards Research and suggest new mobile products, applications and protocols Stay up-to-date with new technology trends [bold] Requirements Requirements Proven work experience as a Mobile developer Demonstrable portfolio of released applications on the App store or the Android market In-depth knowledge of at least one programming language like Swift and Java Experience with third-party libraries and APIs Familiarity with OOP design principles Excellent analytical skills with a good problem-solving attitude Ability to perform in a team environment BSc degree in Computer Science or relevant field"}, {"platform": "Naukari", "platform_link": "https://www.naukri.com/", "company": "WN Infotech", "company_link": "https://www.naukri.com/wn-infotech-jobs-careers-6196898", "job_title": "Cloud Compute Engineer", "job_link": "https://www.naukri.com/job-listings-cloud-compute-engineer-wn-infotech-noida-hyderabad-pune-gurugram-bengaluru-0-to-3-years-271224500512", "location": "Worldwide", "JobType": "Not found", "duration": "No fixed duration", "Salary": "Unpaid", "last_date_application": "Not found", "posted_on": "3 days ago as per the 2024-12-30 14:53:39 or None", "applicant": "194", "opening": "1", "job_description": "Job Summary \n \n \n WN Infotech is seeking an experienced Cloud Compute Engineer to design,  deploy,  and maintain cloud-based infrastructure that powers our applications and services.  In this role,  you will be responsible for managing cloud resources,  optimizing compute instances,  and ensuring the scalability,  security,  and performance of our cloud environments.  As a Cloud Compute Engineer,  you will play a critical role in architecting solutions that leverage cloud-native capabilities to support high-demand applications,  automated workflows,  and efficient resource management. This role involves a strong focus on cloud infrastructure automation,  cost optimization,  and performance tuning.  You will collaborate closely with DevOps,  security,  and software development teams to implement best practices in cloud computing,  ensuring that infrastructure meets business requirements and complies with industry standards.  This is an ideal opportunity for a proactive engineer with a deep understanding of cloud technologies,  infrastructure as code,  and high-performance computing. \n \n Your Role and Responsibilities \n \n [bold] Cloud Architecture and Design: Cloud Architecture and Design: Design and implement cloud compute infrastructure that supports scalable and resilient applications,  leveraging cloud-native services and best practices. [bold] Compute Optimization: Compute Optimization: Analyze and optimize compute instances for performance,  scalability,  and cost-effectiveness,  managing resources efficiently across platforms such as AWS,  Azure,  or Google Cloud. [bold] Infrastructure as Code (IaC): Infrastructure as Code (IaC): Use IaC tools like Terraform,  CloudFormation,  or Ansible to automate cloud infrastructure provisioning and management,  ensuring consistency and repeatability. [bold] Automation and Orchestration: Automation and Orchestration: Develop and implement automation for cloud operations,  reducing manual intervention and streamlining deployments. [bold] Monitoring and Performance Tuning: Monitoring and Performance Tuning: Establish monitoring,  logging,  and alerting for cloud environments,  proactively addressing performance issues and ensuring system reliability. [bold] Security and Compliance: Security and Compliance: Implement security measures across cloud infrastructure,  ensuring compliance with regulatory standards (e. g. ,  GDPR,  HIPAA) and best practices for cloud security. [bold] Collaboration with Development Teams: Collaboration with Development Teams: Work closely with development and DevOps teams to align cloud infrastructure with application needs,  supporting continuous integration and delivery (CI/CD) pipelines. [bold] Documentation and Process Improvement: Documentation and Process Improvement: Document cloud architectures,  workflows,  and best practices,  and contribute to continuous improvement of infrastructure processes. \n \n \n Required Technical and Professional Expertise \n \n [bold] Cloud Platforms Expertise: Cloud Platforms Expertise: Strong experience with cloud platforms such as AWS,  Azure,  or Google Cloud,  with knowledge of core services including compute,  storage,  networking,  and security. [bold] Infrastructure as Code (IaC): Infrastructure as Code (IaC): Proficiency in using IaC tools like Terraform,  CloudFormation,  or Ansible to automate infrastructure management. [bold] Scripting and Automation: Scripting and Automation: Experience with scripting languages like Python,  Bash,  or PowerShell to automate cloud tasks and configurations. [bold] Performance Optimization: Performance Optimization: Skills in tuning cloud environments for high performance and efficiency,  with experience in managing resources,  scaling,  and cost management. [bold] CI/CD and DevOps Principles: CI/CD and DevOps Principles: Familiarity with CI/CD tools (e. g. ,  Jenkins,  GitLab CI/CD,  GitHub Actions) and an understanding of DevOps practices to support agile deployments. [bold] Monitoring and Logging: Monitoring and Logging: Knowledge of monitoring tools (Prometheus,  Grafana,  CloudWatch) and logging systems for proactive infrastructure management. [bold] Networking and Security: Networking and Security: Understanding of cloud networking concepts,  VPNs,  firewalls,  and encryption practices to ensure secure and resilient infrastructure. [bold] Database Management (Optional): Database Management (Optional): Experience in managing cloud-based databases (e. g. ,  RDS,  Cloud SQL) is a plus. \n \n \n \n Qualification & Experience Required \n \n [bold] Educational Background: Educational Background: Bachelor s or Master s degree in Computer Science,  Information Technology,  or a related field. [bold] Experience: Experience: Freshers with relevant academic projects or internships in cloud computing are encouraged to apply. Experienced candidates should have 3+ years in cloud infrastructure engineering,  DevOps,  or cloud systems management. [bold] Certifications (Preferred): Certifications (Preferred): AWS Certified Solutions Architect,  Google Professional Cloud Architect,  or Microsoft Azure Administrator. \n \n \n \n \n \n"}]}]